{"Grey Street": [{"end": "2014-08-02 13:30:00", "title": "Lunch -- Uncatered", "event_id": 3, "abstract": "", "start": "2014-08-02 12:00:00", "schedule_id": 5, "duration": "1:30:00"}, {"end": "2014-08-03 13:40:00", "title": "Lunch -- Uncatered", "event_id": 3, "abstract": "", "start": "2014-08-03 12:10:00", "schedule_id": 53, "duration": "1:30:00"}, {"end": "2014-08-01 13:30:00", "title": "Lunch -- Uncatered", "event_id": 3, "abstract": "", "start": "2014-08-01 12:00:00", "schedule_id": 75, "duration": "1:30:00"}], "Theatre": [{"end": "2014-08-02 10:00:00", "title": "Python For Every Child In Australia by Dr James R. Curran", "event_id": 5, "abstract": "", "start": "2014-08-02 09:15:00", "schedule_id": 3, "duration": "0:45:00"}, {"end": "2014-08-03 10:00:00", "title": "Accessibility: Myths and Delusions by Katie Cunningham", "event_id": 6, "abstract": "", "start": "2014-08-03 09:15:00", "schedule_id": 15, "duration": "0:45:00"}, {"end": "2014-08-02 09:15:00", "title": "Welcome", "event_id": 57, "abstract": "", "start": "2014-08-02 09:00:00", "schedule_id": 17, "duration": "0:15:00"}, {"end": "2014-08-02 11:05:00", "title": "Writing Python 2/3 compatible code", "event_id": 49, "abstract": "Python 3 was never intended to be compatible with Python 2. Freed from the shackles of backward compatibility, Python's core developers took the liberty of creating a language that \"really hadn't changed all that much\" [Python 3.0 release notes] -- except that it was almost impossible to write a non-trivial program that ran on both major versions. These days the situation is still not perfect, but it is getting better, thanks to compatibility features at the language level and with libraries like Six and Python-Future.\r\n\r\nCome and learn what Python 3 is all about and how to write clean, modern, mostly idiomatic Python 3 code that runs on both Python 2 and Python 3. What are the risks and caveats with porting? Is it even possible for you? What are the best approaches? Will it be worth the effort?\r\n\r\nThis presentation will be a clear, step-by-step walk-through that aims to change the way you write Python.", "start": "2014-08-02 10:20:00", "schedule_id": 18, "url": "http://2014.pycon-au.org/schedule/30087/view_talk", "duration": "0:45:00", "presenters": "Edward Schofield"}, {"end": "2014-08-02 12:00:00", "title": "Running Django on Docker: a workflow and code", "event_id": 26, "abstract": "Docker (http://docker.io) is the hot-new-thing out there for running your application in development and in production. Here at Infoxchange, we are extremely excited about how Docker allows a build-once, run-anywhere approach to moving applications from testing through to production. We are one of the first organisations to be using Docker in production on high-SLA applications.\r\n\r\nIn this talk we will present:\r\n\r\n- a quick intro to Docker and how it solves our problems at Infoxchange;\r\n- our interface for hosting applications on Docker (\"pallet\");\r\n- how to build and develop a Python app on Docker;\r\n- Infoxchange's Django settings module for the pallet interface;\r\n- Forklift (https://github.com/infoxchange/docker-forklift), a tool we've developed for running and developing apps that use the pallet interface, in and out of a Docker container; and\r\n- Extending forklift for your services.\r\n\r\nIf time permits we will try and cover the additional bonus topics:\r\n\r\n- How to host your legacy mod_python application on Apache inside Docker with minimal changes; and\r\n- Using Forklift to do automated full-stack integration testing of apps by spinning up containers of other apps (which we do in a container that is testing the built app that is running in a container that is our CI server... inception is possible).\r\n\r\nThe talk will be presented by Danielle Madeley and Alexey Kotlyarov.", "start": "2014-08-02 11:15:00", "schedule_id": 19, "url": "http://2014.pycon-au.org/schedule/30006/view_talk", "duration": "0:45:00", "presenters": "Danielle Madeley"}, {"end": "2014-08-02 14:00:00", "title": "Lesser known data structures", "event_id": 47, "abstract": "Python is graced with flexible, easy to use data structures that are at your fingertips every time you start a command prompt. Lists, dictionaries and tuples are our friends. However, sometimes you want more than what they can give.\r\n\r\nWhile subclassing is a great approach, often what you want has already been written. Most often, it’ll be waiting for you within the standard library. This talk will be a tour of some of what awaits you. Don’t be the next person to recreate an ordered dictionary.\r\n\r\nWithin the collections module, as well as other places within the standard library, you’ll find lots of functionality. Using these data structures can lead to simpler, more robust code.\r\n\r\nAs well as explaining how to use some of the data structures that we encounter, we’ll also be checking through open source code to see how they are used in the real world. This will give us insight into how other programmers are using them. Hopefully ", "start": "2014-08-02 13:30:00", "schedule_id": 20, "url": "http://2014.pycon-au.org/schedule/30084/view_talk", "duration": "0:30:00", "presenters": "Tim McNamara"}, {"end": "2014-08-02 14:40:00", "title": "Bang the gong, the game is on: What can Python people learn from Ruby? ", "event_id": 33, "abstract": "What has Ruby got that Python people could learn from? Turns out quite a lot. \r\nRuby's a bit of a cross between Python and Perl, and borrows heavily from them both.\r\nWhat does Ruby do well that we can learn from, and also, what does Python do wonderfully? (Hint: a lot).\r\nThis presentation will give a quick overview of the major syntactic differences, an understanding of the (superior) object model (whose?), and a quick coverage of some of the Ruby standard library.\r\nIf you want a quick leg-up on Ruby vs Python, this quick tour will give that to you. And in doing so, will improve your appreciation for and understanding of Python. ", "start": "2014-08-02 14:10:00", "schedule_id": 21, "url": "http://2014.pycon-au.org/schedule/30051/view_talk", "duration": "0:30:00", "presenters": "Peter Lovett"}, {"end": "2014-08-02 15:20:00", "title": "Software Component Architectures and circuits?", "event_id": 38, "abstract": "Python Asynchronous Frameworks are plentiful in the Python Community. There is Twisted, gevent, Tornado, asynccore and now with Python 3.4, asyncio. circuits is not yet another Asynchronous Framework (although it does support Async I/O) but a strong well defined Component Architecture for building complex software with changing requirements. If you have ever developed with Zope or Kamaelia you will be familiar with the \"Component\" concept. circuits offers a unique perspective on Component Architectures and offers a novel way to design, implement and deploy complex software.", "start": "2014-08-02 14:50:00", "schedule_id": 22, "url": "http://2014.pycon-au.org/schedule/30058/view_talk", "duration": "0:30:00", "presenters": "James Mills"}, {"end": "2014-08-02 16:10:00", "title": "Here be dragons: some elegant and ugly hacks in CPython", "event_id": 15, "abstract": "As Alex Martelli eloquently pointed out at PyCon US 2013, when it comes to shipping software in a timely fashion, \"good enough\" often really is good enough. Nick Coghlan sets out to illustrate this point by taking a tour through some of the elegant and ugly hacks to be found in the CPython interpreter and the Python standard library. ", "start": "2014-08-02 15:40:00", "schedule_id": 23, "url": "http://2014.pycon-au.org/schedule/30033/view_talk", "duration": "0:30:00", "presenters": "Nick Coghlan"}, {"end": "2014-08-02 16:50:00", "title": "Practical Profiling", "event_id": 45, "abstract": "Profiling your code seems like something you should do. Unfortunately, it’s not something that always feels easy to do. This talk aims to give you the tools to improve the speed and memory efficiency of your applications, while minimising the productivity burden of adding new steps to your workflow. \r\n\r\nMost of the time will be spent looking at working with the profile and pstats modules within Python’s standard library. There will be a small focus on showing off some of the features of the pstats.Stats class. We will move from using these tools as one-shot print outs, to being able to use them over time to track performance.\r\n\r\nThroughout the talk, we’ll spend some time peeking at source code from projects that are out in the wild. Looking through other people’s code will give us a great indication about how people are actually using the tools, rather than just what the documentation says.\r\n\r\nThe overarching goal of the talk will be to make profiling a practical part of your programming life. If nothing else, you’ll be able to quantify the gains that your coding as, by pointing to lower overheads due to your super efficient new code!", "start": "2014-08-02 16:20:00", "schedule_id": 24, "url": "http://2014.pycon-au.org/schedule/30082/view_talk", "duration": "0:30:00", "presenters": "Tim McNamara"}, {"end": "2014-08-02 17:30:00", "title": "Lightning talks", "event_id": 58, "abstract": "", "start": "2014-08-02 17:00:00", "schedule_id": 25, "duration": "0:30:00"}, {"end": "2014-08-03 09:15:00", "title": "Welcome", "event_id": 57, "abstract": "", "start": "2014-08-03 09:00:00", "schedule_id": 40, "duration": "0:15:00"}, {"end": "2014-08-03 10:50:00", "title": "What in the World is Asyncio?", "event_id": 22, "abstract": "The Python 3.4 standard library contains a new module called \"asyncio\" (formerly \"tulip\"), which allows you to write single-threaded asynchronous code based on PEP 3156. This presentation will begin with an outline of what asyncio provides and how to use it, highlighting the kinds of use cases that it was designed for. The presentation will then go through a number of example use cases and within the context of these use cases, will compare asyncio with Twisted, one of the existing libraries for asynchronous programming. Finally, the presentation will touch on the question of interoperability between asyncio and libraries like Twisted, Pyramid and gevent.", "start": "2014-08-03 10:20:00", "schedule_id": 45, "url": "http://2014.pycon-au.org/schedule/30066/view_talk", "duration": "0:30:00", "presenters": "Josh Bartlett"}, {"end": "2014-08-03 12:10:00", "title": "Try A Little Randomness", "event_id": 50, "abstract": "This talk is all about random numbers--What are they? What different kinds are there?  What are they useful for?  And why are computers really bad at them?  Come learn all about random numbers, both the good and the bad.", "start": "2014-08-03 11:40:00", "schedule_id": 48, "url": "http://2014.pycon-au.org/schedule/30091/view_talk", "duration": "0:30:00", "presenters": "Larry Hastings"}, {"end": "2014-08-03 14:10:00", "title": "How (not) to upgrade a platform", "event_id": 51, "abstract": "Guido admitted in his PyCon 2014 keynote that he will never again conduct a language transition like that from Python 2 to Python 3. The vast majority of Python code written in 2014 is still a ``SyntaxError`` on the latest version of Python. Some people have been wondering: will Python 3 ever take off? \r\n\r\nWe do some data mining from PyPI to reveal what progress the community has made so far toward migrating the long tail of packages towards Python 3 and which packages are most critical in the dependency graph of unported packages. We extrapolate about when (if ever) Python 3 support will reach a tipping point after which more new code will be written in Python 3 than Python 2.\r\n\r\nWe then share our perspective on mistakes made in the Python 3 transition and lessons that we can all learn from. The lessons apply to migrating any interface -- a language, a codebase, or a web API.\r\n", "start": "2014-08-03 13:40:00", "schedule_id": 50, "url": "http://2014.pycon-au.org/schedule/30093/view_talk", "duration": "0:30:00", "presenters": "Edward Schofield"}, {"end": "2014-08-03 14:50:00", "title": "Descriptors: attribute access redefined", "event_id": 35, "abstract": "Descriptors are a powerful feature of Python that can be used to augment or replace traditional attribute access with arbitrary behaviours.  Such versatility makes the descriptor protocol a valuable tool for any Python programmer, yet although most of us have used descriptors, fewer have implemented one.\r\n\r\nThis presentation will explain the use cases that motivate descriptors and how other features in Python fall short.  We will then look at some of the descriptors that the audience may already have used (even if they didn't know they were using descriptors!)  This will be followed with an explanation of the descriptor protocol and some implementation and usage examples.\r\n\r\nI will discuss some of the finer details of descriptor implementation and will conclude with a look at Elk - a declarative object system authored by the presenter and inspired by Perl's Moose - and the descriptors that power it.", "start": "2014-08-03 14:20:00", "schedule_id": 54, "url": "http://2014.pycon-au.org/schedule/30055/view_talk", "duration": "0:30:00", "presenters": "Fraser Tweedale"}, {"end": "2014-08-03 15:30:00", "title": "Command line programs for busy developers", "event_id": 44, "abstract": "Command line interface tools are the new web framework. In addition to the\r\nPython standard library's getopt, optparse and argparse there is a bewildering\r\narray of packages available on the Python Packaging Index. Packages like Click,\r\nCliff, Docopt, Invoke all provide different mechanics for creating command line\r\napplications. When all you want to do is expose a command line and get back to\r\ncreating functionality, it’s hard to know which alternative to reach for.\r\n\r\nThis presentation will have two parts, the first half will be a brief survey\r\nof popular modules. Strengths, weaknesses and design philosophies will be\r\ncompared by creating command line processing for the same example program.\r\n\r\nThe second half will go into more depth on a specific package, Begins. This\r\npackage was authored by the presenter to minimise the disruption developers\r\nexperience when breaking flow to implement command line processing. The\r\naudience will be shown how a single line of code can create a complex command\r\nline interface. It will also be shown how a handful of decorators from the\r\nBegins API can eliminate boilerplate code and create powerful, complex\r\napplications.", "start": "2014-08-03 15:00:00", "schedule_id": 57, "url": "http://2014.pycon-au.org/schedule/30076/view_talk", "duration": "0:30:00", "presenters": "Aaron Iles"}, {"end": "2014-08-03 16:20:00", "title": "PyPy.js: What? How? Why?", "event_id": 14, "abstract": "PyPy.js is an experiment in building a fast, compliant, in-browser python interpreter.  By compiling the PyPy interpreter into javascript, and retargeting its JIT compiler to emit asmjs code at runtime, it is possible to run python code in the browser at speeds competitive with a native python environment.  This talk will demonstrate the combination of technologies that make such a thing possible, the results that have been achieved so far, and the challenges that still remain when trying to take python onto javascript's home turf.\r\n\r\nWe'll cover: an overview of PyPy and why it's a good fit for this type of project; an introduction to asmjs and the rise of javascript as a compile target; what it looks like when you smoosh these two technologies together; a comparison with other approaches such as brython; and some concrete suggestions for how the result might be useful in practice.", "start": "2014-08-03 15:50:00", "schedule_id": 60, "url": "http://2014.pycon-au.org/schedule/30029/view_talk", "duration": "0:30:00", "presenters": "Ryan Kelly"}, {"end": "2014-08-03 17:00:00", "title": "Serialization formats aren't toys", "event_id": 43, "abstract": "Do you have an API? \r\n\r\nDo you accept input from users? Do you accept it in XML? What about YAML? Or maybe JSON? How safe are you?\r\n\r\nAre you sure?\r\n\r\nIt’s not in the OWASP Top 10, but you don’t have to look far to hear stories of security vulnerabilities involving deserialization of user input. Why do they keep happening?\r\n\r\nIn this talk I’ll go over what the threat is, how you are making yourself vulnerable and how to mitigate the problem. I’ll cover the features (not bugs, features) of formats like XML, YAML, and JSON that make them surprisingly dangerous, and how to protect your code from them.\r\n\r\nBecause here’s the thing: If you are using, say, a compliant, properly implemented XML parser to parse your XML, you are NOT safe. Possibly quite the opposite.", "start": "2014-08-03 16:30:00", "schedule_id": 63, "url": "http://2014.pycon-au.org/schedule/30074/view_talk", "duration": "0:30:00", "presenters": "Tom Eastman"}, {"end": "2014-08-03 17:40:00", "title": "Lightning talks", "event_id": 58, "abstract": "", "start": "2014-08-03 17:10:00", "schedule_id": 66, "duration": "0:30:00"}, {"end": "2014-08-03 17:50:00", "title": "Closing", "event_id": 59, "abstract": "", "start": "2014-08-03 17:40:00", "schedule_id": 68, "duration": "0:10:00"}, {"end": "2014-08-01 17:10:00", "title": "Farewell", "event_id": 61, "abstract": "", "start": "2014-08-01 17:00:00", "schedule_id": 81, "duration": "0:10:00"}, {"end": "2014-08-03 11:30:00", "title": "Streaming templates with asyncio", "event_id": 12, "abstract": "AsyncIO is a new standard library module in 3.4 for writing concurrent applications. While it is easy to see how this would be useful for writing a webserver there are other less obvious opportunities to use this with your code\r\n\r\nThis talk is about one such non obvious use case and the leasons learnt while converting this code and other code bases to work with AsyncIO\r\n\r\nThis focus will not be on getting new users up to speed on AsyncIO but is intended more as a collection of 'here be dragons' advice, things noted and patterns seen while developing for AsyncIO and is intended to help those familiar with the basic concepts avoid some pitfalls that they may encounter.\r\n\r\nYou should come away from this talk with a clearer idea of how you should and should not be writing things with AsyncIO and some inspiration for applying AsyncIO to your own projects", "start": "2014-08-03 11:00:00", "schedule_id": 106, "url": "http://2014.pycon-au.org/schedule/30021/view_talk", "duration": "0:30:00", "presenters": "Jay Coles"}, {"end": "2014-08-01 09:00:00", "title": "Welcome", "event_id": 66, "abstract": "", "start": "2014-08-01 08:50:00", "schedule_id": 111, "duration": "0:10:00"}, {"end": "2014-08-01 09:55:00", "title": " Opening Keynote", "event_id": 92, "abstract": "", "start": "2014-08-01 09:05:00", "schedule_id": 114, "duration": "0:50:00", "presenters": "  Katie Cunningham "}, {"end": "2014-08-01 10:25:00", "title": " Django's Migrations: A Retrospective", "event_id": 93, "abstract": "", "start": "2014-08-01 10:00:00", "schedule_id": 115, "duration": "0:25:00", "presenters": " Andrew Godwin "}, {"end": "2014-08-01 11:30:00", "title": " Django Transactions: Past, Present, and Future", "event_id": 94, "abstract": "", "start": "2014-08-01 10:50:00", "schedule_id": 116, "duration": "0:40:00", "presenters": " Christophe Pettus "}, {"end": "2014-08-01 12:00:00", "title": " Using Django, Tasty Pie, and lxml for the Digital Humanities", "event_id": 95, "abstract": "", "start": "2014-08-01 11:35:00", "schedule_id": 117, "duration": "0:25:00", "presenters": " Scot McPhee "}, {"end": "2014-08-01 13:55:00", "title": " Writing Reusable Django Apps", "event_id": 96, "abstract": "", "start": "2014-08-01 13:30:00", "schedule_id": 118, "duration": "0:25:00", "presenters": " Jacob Haslehurst "}, {"end": "2014-08-01 14:45:00", "title": " Class-based Views: Past, Present and Future", "event_id": 97, "abstract": "", "start": "2014-08-01 14:00:00", "schedule_id": 119, "duration": "0:45:00", "presenters": " Russell Keith-Magee "}, {"end": "2014-08-01 15:20:00", "title": "Lightning talks", "event_id": 98, "abstract": "", "start": "2014-08-01 14:50:00", "schedule_id": 120, "duration": "0:30:00"}, {"end": "2014-08-01 16:05:00", "title": "  How to be helped (or; Why is FunkyBob angry with me?) ", "event_id": 99, "abstract": "", "start": "2014-08-01 15:45:00", "schedule_id": 123, "duration": "0:20:00", "presenters": "  Curtis Maloney "}, {"end": "2014-08-01 17:00:00", "title": " Closing Keynote", "event_id": 100, "abstract": "", "start": "2014-08-01 16:10:00", "schedule_id": 124, "duration": "0:50:00", "presenters": " Tony Morris "}, {"end": "2014-08-01 09:05:00", "title": "", "event_id": 91, "abstract": "", "start": "2014-08-01 09:00:00", "schedule_id": 126, "duration": "0:05:00"}, {"end": "2014-08-01 10:00:00", "title": "", "event_id": 91, "abstract": "", "start": "2014-08-01 09:55:00", "schedule_id": 127, "duration": "0:05:00"}, {"end": "2014-08-01 11:35:00", "title": "", "event_id": 91, "abstract": "", "start": "2014-08-01 11:30:00", "schedule_id": 128, "duration": "0:05:00"}], "Breakout 1": [{"end": "2014-08-02 11:05:00", "title": "A new default web stack", "event_id": 54, "abstract": "When building a new web application, the default set of tools used to be a web framework such as Django and a relational database such as PostgreSQL.\r\n\r\nIn 2014, these tools are no longer enough. In this talk, I'll present a new default stack to help build applications that are faster, more robust, easy to scale and still support rapid iteration and fast feature development.\r\n\r\nI'll show how the addition of Celery, Solr/ElasticSearch, Redis and statsd to the default web stack provide powerful new capabilities that can super-charge new application development.", "start": "2014-08-02 10:20:00", "schedule_id": 26, "url": "http://2014.pycon-au.org/schedule/30099/view_talk", "duration": "0:45:00", "presenters": "Simon Willison"}, {"end": "2014-08-02 12:00:00", "title": "Caching: A trip down the rabbit hole", "event_id": 41, "abstract": "The question: How do I make my website fast?\r\n\r\nIf that sounds like a loaded question to you: good, we're on the same page.\r\n\r\nIn this talk I will give you a full overview of one of the most powerful and headache-inducing tools in the web-developer's kit: caching.\r\n\r\nThis is a talk for all experience levels, from beginner to seriously brain-melty. The code and scenarios we'll be exploring are within the context of a Django project, but the principles are applicable to all of web development.\r\n\r\nWe'll begin our journey in the light, warm land of web browser caches: learning how you can make your users' web browsers do all the work for you. Making your site feel rocket-fast and responsive with little more than some finely crafted HTTP response headers.\r\n\r\nFrom there, we'll begin our descent into the underworld of server-level caching, using reverse-proxies such as Varnish or Nginx that shield the application code from having to do any work. What they do, how they can help, and more important -- when do they *not* help, and when do you have to go deeper.\r\n\r\nFinally we'll explore the dark art of application-level caching. Whether it's caching whole responses, partial responses, preventing repetitive SQL queries or expensive API response serialization calls. And, if our brains haven't exploded yet, we might throw in some asynchronous cached-view-generation  just for good measure.\r\n\r\nWhether you're a hobbyist or a grizzled veteran, you should come out of this talk with a few new tricks up your sleeve for making all your sites do more with less work.\r\n\r\nExpect references from -- depending on mood -- Alice in Wonderland, The Matrix, or Dante Alighieri's \"Inferno\".", "start": "2014-08-02 11:15:00", "schedule_id": 28, "url": "http://2014.pycon-au.org/schedule/30071/view_talk", "duration": "0:45:00", "presenters": "Tom Eastman"}, {"end": "2014-08-02 14:00:00", "title": "PyBots! or how to learn to stop worrying and love coding", "event_id": 48, "abstract": "In this talk, Anna will argue how physical computing — building interactive systems such as robots that sense and act upon, or respond to the physical world — provides an ideal application space for teaching and learning programming concepts and problem solving; that appeals to a diverse audience; and that can provide a positive introduction to the world of open source software and hardware.\r\n\r\nDrawing on her experiences teaching introductory programming with Arduino-based robots, Anna will step through a tutorial demonstrating how to develop a mobile PyBot - a robot programmed using Python and the Firmata protocol, and will provide tips to help you or the apprentice coders in your life to take the first steps towards a lifetime of loving to code.", "start": "2014-08-02 13:30:00", "schedule_id": 30, "url": "http://2014.pycon-au.org/schedule/30086/view_talk", "duration": "0:30:00", "presenters": "Anna Gerber"}, {"end": "2014-08-02 14:40:00", "title": "Lessons from a Study Group", "event_id": 18, "abstract": "I started a study group to go through Udacity's Programming 101 course which is taught using Python. As a Ruby on Rails developer, I had plenty to learn, but most of my experience can be abstracted for running any programming study group. This is an overview of my experiences about what worked, what didn't, and if I'd do it again (spoiler alert: I've got one going already!). I learned a lot from it and want to share some of those lessons as well as encourage others to start something similar.", "start": "2014-08-02 14:10:00", "schedule_id": 32, "url": "http://2014.pycon-au.org/schedule/30052/view_talk", "duration": "0:30:00", "presenters": "Lucy Bain"}, {"end": "2014-08-02 15:20:00", "title": "Learning to program is hard, and how to fix that", "event_id": 56, "abstract": "There are a lot of hurdles to overcome when learning your first programming language - What does this error mean? What's the difference between a for loop and a while loop? How does pass-by-reference evaluation work? What are classes? How do I even begin to turn this task into a working program?\r\n\r\nPython is widely used as a language for learning to program, and for good reasons, but there are still plenty of ways that students can get stuck, both in learning the language, and in learning more abstract programming concepts.\r\n\r\nThis talk will present a number of challenges frequently faced by beginner students in a university course which teaches students Python from the ground up, and how the course material was redesigned both to make it easier for students to learn, but also to ensure that students encountered all of the necessary challenges so that they'd have something to learn.", "start": "2014-08-02 14:50:00", "schedule_id": 34, "url": "http://2014.pycon-au.org/schedule/30022/view_talk", "duration": "0:30:00", "presenters": "Jackson Gatenby"}, {"end": "2014-08-02 16:10:00", "title": "The Curse of the Django Podcast", "event_id": 40, "abstract": "The Django community is full of amazing, enthusiastic and multi-talented individuals who love to take on exciting new extra-curricular projects in their massive amounts of spare time. \r\n\r\nA Django podcast is an excellent example of this kind of project and it is one that has been taken up no less than 5 times so far.\r\n\r\nI am the latest to take up this torch.\r\n\r\nThis has so far been an amazing, educational, exhilarating experience: I have had the honour of gathering the thoughts of some of the best, brightest and most prolific in our community. It's been a load of work but also a load of fun.\r\n\r\nCome hear the story of how this has happened, and come to learn how you can be part of the greater Django information and communication machinery.", "start": "2014-08-02 15:40:00", "schedule_id": 36, "url": "http://2014.pycon-au.org/schedule/30070/view_talk", "duration": "0:30:00", "presenters": "Elena Williams"}, {"end": "2014-08-02 16:50:00", "title": "Grok.art: Enhance your creativity", "event_id": 20, "abstract": "There is a recognition that the software development profession is a young field which needs evolution to achieve the reliable success enjoyed by other professions and that it combines elements of science, engineering and art. The artistic and creative aspects are more mysterious.\r\n\r\nMy study has been a combination of Fine Art and Information Systems and I see great potential benefits from improving creativity in systems development. Creativity is an intrinsic part of understanding and solving problems whether you are a hobbyist, programmer, sysadmin, tester, manager or client. However its an idea which generally horrifies anyone responsible for a development, especially from managers of large projects. Ignoring creativity limits opportunities, reducing the effectiveness of systems and change. \r\n\r\nIn this talk I explore creativity, art, experimentation, ideas and models in the hope that you can realise your own great moments of inspiration and build better systems with less struggle.\r\n\r\n“... artists are mystics rather than rationalists. They leap to conclusions that logic cannot reach.” - Sol LeWitt", "start": "2014-08-02 16:20:00", "schedule_id": 38, "url": "http://2014.pycon-au.org/schedule/30064/view_talk", "duration": "0:30:00", "presenters": "Mathew Oakes"}, {"end": "2014-08-03 10:50:00", "title": "Software Carpentry in Australia: current activity and future directions", "event_id": 29, "abstract": "Software Carpentry is a volunteer organisation that teaches basic software skills to researchers in science, engineering and medicine. Supported by the Mozilla Science Lab, it runs two-day bootcamps all over the world, provides open access material for self-paced instruction, and runs a training program for aspiring instructors. The core two-day curriculum includes the Unix shell (and how to automate repetitive tasks); Python or R (and how to grow a program in a modular, testable way); Git and GitHub (and how to track and share work efficiently); and SQL (and the difference between structured and unstructured data).     \r\n\r\nWhile the organisation has been around for over a decade, it had a breakout year in 2013. The number of qualified instructors swelled to over 100 and collectively they ran over 100 events for over 4300 researchers in a dozen countries. To kick things off in Australia, the founder of Software Carpentry (Dr. Greg Wilson) visited Sydney and Melbourne in February 2013 to host the first ever bootcamps outside of Europe and North America. Since that visit five local instructors have been trained up and have delivered an additional ten bootcamps around the country.\r\n\r\nThis presentation will review the first year of Software Carpentry activities in Australia, with a particular focus on the key lessons learned in teaching computational best practices to the research community. Future plans and directions will also be outlined, including an overview of an innovative new project called the Research Bazaar. Coordinated out of The University of Melbourne, this project has started offering regular bootcamps to researchers in the Melbourne area and looks set to inspire widespread institutional support for bootcamp delivery. The Software Carpentry teaching materials are also undergoing rapid development, with work on an advanced curriculum and new lessons on “data carpentry” already underway. There are very few examples of open, collaborative lesson development in the education sector, so the application of routine software development practices in this space (e.g. version control, pull requests, and the progressive release of new versions) is somewhat ground breaking.", "start": "2014-08-03 10:20:00", "schedule_id": 43, "url": "http://2014.pycon-au.org/schedule/30016/view_talk", "duration": "0:30:00", "presenters": "Damien Irving"}, {"end": "2014-08-03 11:30:00", "title": "Linux Defenders: Empowering the Community to Take Action Against Software Patent Threats", "event_id": 24, "abstract": "It’s hard to escape the inefficiencies of the patent world. The amount of patent litigation has drastically increased, specifically in technologies based in computer software. Further, patent wars are extending beyond large corporations to startups and individual developers. Those in the open source world are encountering two options: fly under the radar and hope to avoid lawsuits or license often times dubious patented technology. Now, is the time to introduce another option and protect your freedom to operate. The Linux Defenders program, supported by Open Invention Network, sets to provide healthy avenues for the Linux community to invent. The goal is to give innovators the leverage to proactively limit the resources that can be used by trolls and those with overly broad and vague patents. In this talk, we will present practical community-based approach that makes a difference.", "start": "2014-08-03 11:00:00", "schedule_id": 46, "url": "http://2014.pycon-au.org/schedule/30090/view_talk", "duration": "0:30:00", "presenters": "Andrea Casillas"}, {"end": "2014-08-03 12:10:00", "title": "Grug make fire! Grug make wheel!", "event_id": 30, "abstract": "In prehistoric times, Python developers were faced with a confusing landscape of tools and conflicting advice when they wanted to package their Python modules for public release. As a result of all the distutils/distribute/setuptools changes over the last 5 years, there's lots of confusion about what you should do when preparing a package for distribution - and even some confusion about what the purpose of packaging is in the first place.\r\n\r\nAfter a mammoth effort from a number of volunteers in the community, over several years, this situation is changing. It's taken a while, but the Python community has invented the wheel!\r\n\r\nIn this talk, we'll look at the process that has led to the development of the wheel format. But more importantly, we'll look at the steps you need to take when packaging a module of Python code for others to use, and get it on the Python Package Index (PyPI).", "start": "2014-08-03 11:40:00", "schedule_id": 49, "url": "http://2014.pycon-au.org/schedule/30035/view_talk", "duration": "0:30:00", "presenters": "Russell Keith-Magee"}, {"end": "2014-08-03 14:10:00", "title": "How do debug tool bars for web applications work?", "event_id": 42, "abstract": "When your production web application breaks, working out what went wrong can be hard. Information from log messages and details of any Python exceptions which occurred, along with other application performance data can help to identify the issue, but not always. Often you will need to fall back to a development or test environment and hope you can replicate the problem and then debug the issue from there.\r\n\r\nThe purpose of this talk is to dive in and look at one class of tools that can be used in helping debug web applications. Specifically, it will look at web application tools such as the Django debug tool bar.\r\n\r\nRather than simply look at how you might use such a tool though, this talk will look at how these debug tool bars are actually implemented, how they hook into your web application, how they capture the information that they do, as well as how they can be extended to add new functionality.\r\n\r\nThe limitations on these tools as far as performance overhead, security of data etc, which nearly aways lead to them only being recommended for development environments, will also be discussed.\r\n\r\nAt the same time though, this notion that they are only suitable for development environments will also be challenged by looking at how a tool such as the New Relic Python agent, which implements application performance monitoring, overcomes such limitations to provide a production grade solution.\r\n\r\nAre there lessons to be learnt from how the New Relic Python agent works which could drive improvements to existing web application debug tool bars? Could the New Relic Python agent itself be used as a base for a new generation of debug tool bars which combine an ability to debug a web application, even in a production environment, with the ability to monitor the performance of the web application over time?", "start": "2014-08-03 13:40:00", "schedule_id": 51, "url": "http://2014.pycon-au.org/schedule/30073/view_talk", "duration": "0:30:00", "presenters": "Graham Dumpleton"}, {"end": "2014-08-03 14:50:00", "title": "Sounds good!", "event_id": 34, "abstract": "Do you know if it’s worth upgrading your Spotify account to stream songs at 320kb/s?\r\n\r\nAn understanding of the fundamentals of computer sound is essential for the well-rounded IT professional. Audio is a field that is teeming with jargon, but it doesn’t have to be so scary! In this session we’ll go back to basics and take a look at the core components of sound, including how we (as humans) perceive sounds, and how we can represent them within a computer. By the end of this session, you'll know enough to go home and create your own simple synthesiser!", "start": "2014-08-03 14:20:00", "schedule_id": 55, "url": "http://2014.pycon-au.org/schedule/30054/view_talk", "duration": "0:30:00", "presenters": "Sebastian Beswick"}, {"end": "2014-08-03 15:30:00", "title": "Seeing with Python", "event_id": 23, "abstract": "In 2013 I purchased a Ninja Block (http://ninjablocks.com/) and wanted to add a camera based sensor to it. So began my adventures in computer vision using python. The talk will discuss the various libraries (including PyOpenCV & SimpleCV ) available for python to perform CV tasks like motion detection, object tracking & facial recognition. As my goals for the camera sensor underwent \"feature creep\" the project required it's own dedicated processing power, so a BeagleBone Black & later a Raspberry Pi were purchased and the project became a IoT device. I will also share my experiences with developing python CV solutions ARM based computers. If the demo gods are willing, code examples will be demonstrated.", "start": "2014-08-03 15:00:00", "schedule_id": 58, "url": "http://2014.pycon-au.org/schedule/30069/view_talk", "duration": "0:30:00", "presenters": "Mark Rees"}, {"end": "2014-08-03 16:20:00", "title": "Software Metrics and Ratcheted Builds in Python", "event_id": 36, "abstract": "The JIRA team automates it's Java build system across development and build systems.\r\n\r\nTo help scale a small Engineering Health team across a team of 60+ full time developers and growing, we built a engineering metrics system in Python. This consists of a source code scanner, custom metrics generator, as well as a ratcheted build system written in Python using git-notes as a storage mechanism.\r\n\r\nBy storing the data in git-notes, the data follows the repository which makes it extremely simple and flexible.\r\n\r\nIn this talk we'll cover how we've used core python features to build these command line tools, the overall architecture of the system, and some tips around introducing Python into your build process.", "start": "2014-08-03 15:50:00", "schedule_id": 61, "url": "http://2014.pycon-au.org/schedule/30056/view_talk", "duration": "0:30:00", "presenters": "Ian Grunert"}, {"end": "2014-08-03 17:00:00", "title": "devpi: Your One Stop Cheese Shop", "event_id": 39, "abstract": "Modern Python developers depend on a large number of 3rd party packages. This in turn introduces a problem: how to manage those packages for rapid, reliable deployment in a world where the central repository - PyPi (the Cheese Shop) - is out of their control. Additionally, private packages may be developed which need to seamlessly be integrated into the deployment systems.\r\n\r\nIn this talk I will present devpi, a PyPI (Cheese Shop) server and packaging/testing/release tool. I will cover its reasons for existing, its many capabilities and configuration for some common scenarios.\r\n", "start": "2014-08-03 16:30:00", "schedule_id": 64, "url": "http://2014.pycon-au.org/schedule/30080/view_talk", "duration": "0:30:00", "presenters": "Richard Jones"}, {"end": "2014-08-01 17:10:00", "title": "Farewell", "event_id": 61, "abstract": "", "start": "2014-08-01 17:00:00", "schedule_id": 80, "duration": "0:10:00"}, {"end": "2014-08-01 09:45:00", "title": "Monte Carlo Business Case Analysis with pandas", "event_id": 81, "abstract": "Pandas is increasingly becoming a standard tool in scientific computing.  Could it also have a role in the CFO's office?\r\n \r\nCFOs regularly need to analyse the impact of different projects or business cases, and they almost universally do this using spreadsheets.  Spreadsheets have many advantages - they have a low barrier to entry and are easy for most people to understand.  However as they get more complicated, disadvantages start to appear; in particular, they can be inflexible and highly error-prone.\r\n \r\nIn this talk I will explain how business case analysis can be done using python and pandas.  The python version has several advantages over spreadsheets: it is more flexible as the business structure changes; formulas only need to be changed in a single place, reducing the chance of error; and report-ready plots are quick to produce.  I'll go through a way of structuring the problem for some simple business logic, and ways to visualise the results.\r\n \r\nThe example I’ll discuss is made more interesting and useful by being “Monte Carlo” analysis. Traditional business case analysis takes single point estimates of sales, costs and prices, and calculates a single profit forecast. Everybody knows the profit will not turn out to be exactly equal to the forecast.  But it is not clear what the range of profits might be, or how likely a loss is.  \"Monte Carlo\" analysis solves this problem by allowing ranges or distributions on the assumptions; the forecast is then a range of outcomes.\r\n \r\nIn short, I’ll demonstrate how you can use pandas to analyse high-impact business decisions, and dodge many of the problems of using spreadsheets.", "start": "2014-08-01 09:15:00", "schedule_id": 98, "url": "http://2014.pycon-au.org/schedule/30072/view_talk", "duration": "0:30:00", "presenters": "Arthur Street"}, {"end": "2014-08-01 10:25:00", "title": " Python for Bioinformatics", "event_id": 82, "abstract": "", "start": "2014-08-01 09:45:00", "schedule_id": 100, "duration": "0:40:00", "presenters": " Clare Sloggett "}, {"end": "2014-08-01 11:20:00", "title": " PyMODIS: processing 14 years of NASA's remotely sensed MODIS imagery", "event_id": 83, "abstract": "", "start": "2014-08-01 10:50:00", "schedule_id": 101, "duration": "0:30:00", "presenters": " Ben Davies "}, {"end": "2014-08-01 12:00:00", "title": " Pandas 101", "event_id": 84, "abstract": "", "start": "2014-08-01 11:20:00", "schedule_id": 102, "duration": "0:40:00", "presenters": " Lex Hider "}, {"end": "2014-08-01 14:25:00", "title": " Clustering of high-content screen images to discover off-target phenotypes", "event_id": 86, "abstract": "", "start": "2014-08-01 14:00:00", "schedule_id": 104, "duration": "0:25:00", "presenters": " Juan Nunez-Iglesias "}, {"end": "2014-08-01 14:55:00", "title": " Multiplying really really big matrices", "event_id": 87, "abstract": "", "start": "2014-08-01 14:35:00", "schedule_id": 105, "duration": "0:20:00", "presenters": " Paul Leopardi "}, {"end": "2014-08-01 16:15:00", "title": " Stream Based Processing for Data Analysis", "event_id": 88, "abstract": "", "start": "2014-08-01 15:45:00", "schedule_id": 107, "duration": "0:30:00", "presenters": " Lachlan Blackhall "}, {"end": "2014-08-01 13:55:00", "title": " Python, Pyramid, and Embedded Devices", "event_id": 85, "abstract": "", "start": "2014-08-01 13:30:00", "schedule_id": 108, "duration": "0:25:00", "presenters": " Justin Clacherty "}, {"end": "2014-08-01 15:20:00", "title": "  Lost in High-dimensional Space? Python to the Rescue!", "event_id": 89, "abstract": "", "start": "2014-08-01 15:00:00", "schedule_id": 109, "duration": "0:20:00", "presenters": " Jay Larson "}, {"end": "2014-08-01 17:00:00", "title": " Predictive Analytics with Python", "event_id": 90, "abstract": "", "start": "2014-08-01 16:15:00", "schedule_id": 110, "duration": "0:45:00", "presenters": " Flemming Villalona "}, {"end": "2014-08-01 09:15:00", "title": " Welcome", "event_id": 102, "abstract": "", "start": "2014-08-01 09:00:00", "schedule_id": 129, "duration": "0:15:00", "presenters": " Graeme Cross "}], "Breakout 3": [{"end": "2014-08-02 12:00:00", "title": "Python 101+", "event_id": 16, "abstract": "A very brief introduction for those that have no Python experience,\u000bthen moving across all the essentials that you really need to know. \r\n\u000bSelf-taught in Python? Think you might have missed a bit? Make sure that your foundations are correct and complete. \u000bAvoid getting into trouble later by making sure you know all the essentials - and a bit more besides. \r\nThis tutorial-style presentation will help you get the most out of the rest of the conference.\r\n", "start": "2014-08-02 10:20:00", "schedule_id": 69, "url": "http://2014.pycon-au.org/schedule/30049/view_talk", "duration": "1:40:00", "presenters": "Peter Lovett"}, {"end": "2014-08-02 15:20:00", "title": "Advanced Django Patterns for Large-Scale Websites", "event_id": 53, "abstract": "Eventbrite and Lanyrd are both large-scale, complex sites that are built using Python and Django. In this fast-moving tutorial engineers who have worked on both sites will discuss some of the less common Django techniques needed to scale Django applications to handle massive datasets and millions of visitors.", "start": "2014-08-02 13:30:00", "schedule_id": 70, "url": "http://2014.pycon-au.org/schedule/30098/view_talk", "duration": "1:50:00", "presenters": "Simon Willison"}], "Breakout 2": [{"end": "2014-08-03 15:30:00", "title": "Programming the Performance Co-Pilot toolkit", "event_id": 9, "abstract": "Effective system-level performance analysis in complex computing environments  presents a hard problem.  This is a problem shared by all platforms and solutions begin with pervasive instrumentation and measurement.\r\n\r\nThis talk will describe the Performance Co-Pilot project and  covers how python tools can be used to customise it for your own environment.\r\n\r\nA practical introduction will be given showing how to write python tools to export real-time performance metrics from arbitrary system components so that the data is available for live and retrospective analysis.  A customised distributed analysis tool will then be built using that data.", "start": "2014-08-03 15:00:00", "schedule_id": 16, "url": "http://2014.pycon-au.org/schedule/30007/view_talk", "duration": "0:30:00", "presenters": "Nathan Scott"}, {"end": "2014-08-02 11:05:00", "title": "Verification: Truth in Statistics", "event_id": 21, "abstract": "Come to this talk if you want to learn a few basic techniques for putting numerical data in context. If you've ever predicted anything, or tried to work out whether some number was \"good enough\", you'll probably get something out of this presentation. All techniques and tools demonstrated using Python.\r\n\r\nEvery day, decisions both big and small are made on the basis of the information published by the Bureau of Meteorology. These include simple decisions such as taking an umbrella or planning a barbecue. Our forecasts also inform Australia's emergency services on where extreme weather events may have occurred, to help with planning and preparation.\r\n \r\nUnderstanding and communicating our strengths and weaknesses is very important, both as an organisation and also internally within the Environment and Research division. This presentation will focus on the statistical methods and systems used to evaluate the objective, scientific performance of our forecast systems. The name for this area of study is \"Verification\". While the concepts have come from the research environment, they are widely applicable and can help anyone who is assessing the performance of any system.\r\n \r\nThis presentation will include:\r\n  -- An overview of the major ideas of verification\r\n  -- How to create a 'skill score'\r\n  -- The application of these concepts to thunderstorm forecasting\r\n  -- How to use Python tools for verification analyses\r\n  -- Tips on how to apply these ideas easily in other contexts\r\n \r\nObtaining relevant thunderstorm observational data can be particularly challenging, particularly pertaining to severe and damaging aspects: lightning, hail, heavy rain and very strong wind gusts. In order achieve a stronger footing, some new methods of analysis are under development. It is necessary to establish the scientific validity of the verification metrics at the same time as constructing the systems to support the data analysis.\r\n \r\nA prototype web-based tool written in Python (and under active development by the presenter) will be demonstrated. This tool can run locally to provide an enhanced lab environment for assessing case study data, or be set up as a server for continuous monitoring and reporting.\r\n \r\nNo pre-existing knowledge of Python or statistics is assumed. The talk will include several technical aspects, such as working at different computing scales, usability and user experience, working with statistical algorithms, data visualisation for both web and journal publications, and the architectural challenges of a complex application.", "start": "2014-08-02 10:20:00", "schedule_id": 27, "url": "http://2014.pycon-au.org/schedule/30077/view_talk", "duration": "0:45:00", "presenters": "Tennessee Leeuwenburg"}, {"end": "2014-08-02 12:00:00", "title": "Graphs, Networks and Python:  The Power of Interconnection", "event_id": 27, "abstract": "Graph and network structures are everywhere and can be found in social, biological and technological networks that impact us on a daily basis. Understanding, and exploiting, graphical structures creates opportunities for obtaining new analytic insights, implementing new computational paradigms, and better defining the relationship between objects of any sort.\r\n\r\nPython provides access to these graph and network structures using the fantastic NetworkX library (http://networkx.github.io/) .  In this presentation we will give an introduction to the NetworkX library, showing how easy it is to build and exploit simple graphical and network structures.\r\n\r\nFrom that starting point we will then discuss a number of more complicated, real world examples of how the NetworkX library can be used to:\r\n - Analyse social networks to extract valuable information about people / entities within those networks.\r\n - Implement reconfigurable processing pipelines (something we refer to as computational graphs) for data capture, processing and analytics.\r\n - Easily track the relationship between Python objects in a variety of other interesting and useful scenarios.\r\n\r\nThis presentation will be targeted at intermediate developers and no prior experience with graphs, networks or NetworkX is required. This presentation will offer an easy introduction to the world of networks and graphs in Python and will illustrate real world uses of this powerful and useful paradigm. \r\n", "start": "2014-08-02 11:15:00", "schedule_id": 29, "url": "http://2014.pycon-au.org/schedule/30008/view_talk", "duration": "0:45:00", "presenters": "Lachlan Blackhall"}, {"end": "2014-08-02 14:00:00", "title": "IPython parallel for distributed computing", "event_id": 37, "abstract": "IPython is becoming a very popular platform for scientific methods development, providing tools for documentation, presentation and distributed computing. A key part of the platform is the IPython \"notebook\" which integrates with IPython parallel. IPython parallel is a very intuitive and (importantly) simple framework for distributing python functions as tasks in a queue -  similar in some ways to parallel-python or Celery.\r\n\r\nThis talk is focused on introducing the IPython.parallel platform and will cover:\r\n\r\n1) How to identify if a problem is distributable.\r\n2) The architecture of the IPython parallel framework.\r\n3) How to quickly start a cluster of \"workers\" using the web interface and command line.\r\n4) How to push tasks to workers and collate the results using \"direct\" and \"load balanced\" views.\r\n\r\nThe talk will provide examples of embarrassingly parallel tasks as notebooks with a focus on meteorological data sets.", "start": "2014-08-02 13:30:00", "schedule_id": 31, "url": "http://2014.pycon-au.org/schedule/30057/view_talk", "duration": "0:30:00", "presenters": "Nathan Faggian"}, {"end": "2014-08-02 14:40:00", "title": "Text mining online data with scikit-learn", "event_id": 31, "abstract": "Text mining has a large variety of applications and is becoming used in more businesses for gathering intelligence and providing insight. People are sending text constantly online via social media, chat rooms and blogs. Tapping into this information can help businesses gain an advantage and is increasingly a necessary skill for data analytics. Text mining is a unique data mining problem, dealing with real world data that is often heavy on artefacts, difficult to model and challenging to properly manage. Text mining can be seen as a bit of a dark art that is difficult to learn and gain traction. However some basic strategies can often be applied to get good results quite quickly, and the same basic models appear in many text mining challenges.\r\n\r\nThe scikit-learn project is a library of machine learning algorithms for the scientific python stack (numpy & scipy). It is known for having detailed documentation, a high quality of coding and a growing list of users worldwide. The documentation includes tutorials for learning machine learning as well as the library and is a great place to start for beginners wanting to learn data analytics. There is a strong focus on reusable components and useful algorithms, and the text mining sections of scikit-learn follow the “standard model” of text mining quite well.\r\n\r\nIn this presentation, we will go through the scikit-learn project for machine learning and show how to use it for text mining applications. Real world data and applications will be used, including spam detection on Twitter, predicting the author of a program and determining a user's political bent based on their social media account.", "start": "2014-08-02 14:10:00", "schedule_id": 33, "url": "http://2014.pycon-au.org/schedule/30037/view_talk", "duration": "0:30:00", "presenters": "Robert Layton"}, {"end": "2014-08-02 15:20:00", "title": "Record linkage: Join for real life", "event_id": 46, "abstract": "In an ideal world, you can join on candidate keys, names are never misspelt, people never move house, and I have a pony. I don’t have a pony. But we do have record linkage. \r\n\r\nRecord linkage (also known as data linkage or fuzzy record matching) is a naive Bayes algorithm which matches data about individuals across databases or within a single database, by constructing the probabilities that two records apply to the same individual or to different individuals.\r\n\r\nIn this talk I will discuss the techniques of record linkage in Python, the usefulness and the limitations of linkage, and the effect that this technique is having on healthcare research in particular.\r\n\r\nHealthcare/epidemiology studies often require data from more than one source, and individuals frequently have multiple interactions with a data set without a unique identifier. The outcomes of these studies are only as good as the record linkage which underlies them, so the ways in which record linkage is done can have a direct impact on our ability to understand, prevent and treat serious medical conditions.\r\n", "start": "2014-08-02 14:50:00", "schedule_id": 35, "url": "http://2014.pycon-au.org/schedule/30083/view_talk", "duration": "0:30:00", "presenters": "Rhydwyn Mcguire"}, {"end": "2014-08-02 16:10:00", "title": "Deploy to Android: Adventures of a Hobbyist", "event_id": 19, "abstract": "Writing a program in Python targeting the Android environment is well within your reach with the use of third party kits such as Kivy and the Pygame Subset for Android.  \r\n\r\nKivy is an \"Open source Python library for rapid development of applications\" and comes with tools which allow Kivy based programs to be packaged as Android apks for deployment to Android devices.   In this session I will give an overview of the Kivy development and deployment process.  I will also draw inspiration from my successes and failures in developing Python programs with Kivy to highlight Kivy's strengths, weaknesses and idiosyncracies.   Code examples will be kept to a minimum, with a focus on illustrating the capabilities of the Kivy library and explaining how its parts work together. \r\n\r\nI will also reserve some time to discuss the Pygame Subset for Android and how it can be used to deploy Pygame based games to Android devices.  ", "start": "2014-08-02 15:40:00", "schedule_id": 37, "url": "http://2014.pycon-au.org/schedule/30048/view_talk", "duration": "0:30:00", "presenters": "Brendan Scott"}, {"end": "2014-08-02 16:50:00", "title": "The Quest for the Pocket-Sized Python", "event_id": 55, "abstract": "Python's already a language of choice for developers on the web, in science, and on the desktop. In the meantime, the world of Mobile computing has exploded in the last couple of years, and developers targetting Android, iOS, and other Mobile platforms are writing their apps in Java, Objective-C, JavaScript... but definitely not Python.\r\n\r\nBut Python's a great language for solving the sort of problems that are posed in Mobile development time -- speedy development cycles, 20 years worth of libraries for solving many tasks that you throw at it, and a ready-made community to help developers. So why aren't we using Python?\r\n\r\nThis talk surveys the current landscape of Python on the major Mobile platforms, and ways you can start targeting Mobile platforms with your Python code. We'll look at considerations for Mobile web development, the state of Python-based mobile toolkits, and progress towards Python-coded native UIs.\r\n", "start": "2014-08-02 16:20:00", "schedule_id": 39, "url": "http://2014.pycon-au.org/schedule/30053/view_talk", "duration": "0:30:00", "presenters": "Christopher Neugebauer"}, {"end": "2014-08-03 10:50:00", "title": "What is OpenStack?", "event_id": 32, "abstract": "OpenStack is one of the biggest python projects ever, and is hiring plenty of interesting python people to work on Open Source, which is cool. Yet, many people tell me that they don't really understand what OpenStack is. Let's fix that once and for all.\r\n\r\n25 minutes isn't a long time, so what I'll provide is an overview of the various components of OpenStack and how they tie together. We'll cover what bits might be of interest to your average python hacker, as well as the general problems we're trying to solve. I secretly hope this will enthuse people to come and hack on OpenStack, but its also cool if audience members walk away from the talk deciding that OpenStack is not of interest to them -- so long as they now understand vaguely what OpenStack is, then we're cool.\r\n\r\nI'll also try and cover how the OpenStack Foundation and code governance model works, but it might require talking really fast. We shall see!", "start": "2014-08-03 10:20:00", "schedule_id": 44, "url": "http://2014.pycon-au.org/schedule/30040/view_talk", "duration": "0:30:00", "presenters": "Michael Still"}, {"end": "2014-08-03 11:30:00", "title": "Python Micro-service Architecture", "event_id": 52, "abstract": "Micro or single-purpose service architecture is an server application design that utilises numerous lightweight service processes communicating with a simple API, often RESTful. This style of architecture has started being used in the past few years with the aim of increasing development velocity through flexibility.\r\n\r\nThis talk will examine the development workflows, tooling and libraries available in Python to make developing these services practical. Emphasis will be on technically addressing the weaknesses of this style of development in areas such as testing, deployment and communication.", "start": "2014-08-03 11:00:00", "schedule_id": 47, "url": "http://2014.pycon-au.org/schedule/30097/view_talk", "duration": "0:30:00", "presenters": "Rory Hart"}, {"end": "2014-08-03 14:10:00", "title": "Small Data: Databases in the real world", "event_id": 11, "abstract": "We hear a lot about how various different databases and storage methods work at massive scale, but that always comes at a massive engineering and ops cost - and for most companies, that's not what they need anyway.\r\n\r\nWe'll take a look at databases with the perspective of a smaller engineering team - from 1 to 100 people - and see how databases not only perform at scale, but also how they perform with rapid development, continuous deployment & smaller hardware requirements, and take a look at what Big Data really means anyway.", "start": "2014-08-03 13:40:00", "schedule_id": 52, "url": "http://2014.pycon-au.org/schedule/30014/view_talk", "duration": "0:30:00", "presenters": "Andrew Godwin"}, {"end": "2014-08-03 14:50:00", "title": "(Benford's) Law and Order (Fraud)", "event_id": 25, "abstract": "\"On the internet, fraudulent and abusive behavior is considered especially heinous. At Heroku, the dedicated detectives who investigate these vicious felonies are members of an elite squad armed with large amounts of data and spare CPU cycles. These are their stories.\"\r\n\r\nBad behavior can wreak havoc on your web application. It might be mass-signups, fraudulent orders, spammy posts, right up to automated bots designed to work around restrictions you have set in place; this can cost you time, resources, and lots of money. All is not lost though. Despite the ongoing efforts of abusers, their activity still leaves fingerprints and clues, which you can use to your advantage.\r\n\r\nThis talk is a 101 introduction to some of the methods which you can use to separate good from bad users using a combination of data mining, statistics, and some some basic machine learning. Basically, I want to get you thinking like an internet detective.\r\n\r\nSome of the topics I will be covering include:\r\n\r\n- Collecting and preparing data sources.\r\n- Effective methods for classifying existing users.\r\n- Feature extracting; what works and what doesn't.\r\n- Analyzing user-provided data to profile your users, and weed out the bad operators.\r\n- Determining a user's intentions by looking at their access patterns.\r\n- Making use of 'outliers' to find suspicious users and transactions.\r\n- Stopping bad users before they can wreak havoc.\r\n\r\nAs this is a 101 topic I will provide some basic examples, as well as links to more in-depth resources for further reading. I would recommend this talk to developers of web applications, especially those with a large number of users, the ability to process credit cards, or with a 'free' offering. Attendees should have a basic understanding of topics such as SQL, Pandas, and some basic understanding of mathematics and statistics, although this is not essential as I will be providing links to further reading.", "start": "2014-08-03 14:20:00", "schedule_id": 56, "url": "http://2014.pycon-au.org/schedule/30092/view_talk", "duration": "0:30:00", "presenters": "Rhys Elsmore"}, {"end": "2014-08-03 16:20:00", "title": "Learning Science with Open hardware and Python", "event_id": 13, "abstract": "ExpEYES is from the PHOENIX (Physics with Home-made Equipment and Innovative Experiments) project of Inter-University Accelerator Centre,New Delhi. It is a hardware & software framework for developing science experiments, demonstrations and projects without getting in to the details of electronics or computer programming. It converts your PC into a science laboratory. ", "start": "2014-08-03 15:50:00", "schedule_id": 62, "url": "http://2014.pycon-au.org/schedule/30019/view_talk", "duration": "0:30:00", "presenters": "Kushal Das"}, {"end": "2014-08-03 17:00:00", "title": "Continuous Integration Testing for Your Database Migrations", "event_id": 17, "abstract": "This is a talk about how OpenStack does database migration continuous integration, and how other projects might be able to learn from what we've done.\r\n\r\nOpenStack is an interesting project in that it runs in a variety of different scale scenarios. There are very small deployments of only a few machines, and large public clouds with thousands of machines. The OpenStack project takes Continuous Integration (CI) very seriously, and runs a suite of unit and integration tests on all proposed patches.\r\n\r\nOne thing we weren't very good at testing though, was database upgrades. We have unit tests for many of them, but we don't know how these upgrades affect real users in the field. As a response, we worked on adding database migration testing to our CI environment. This new test infrastructure is open source (https://github.com/stackforge/turbo-hipster), and extensible. It currently runs tests on smaller databases, as well as a largish real user database. It has already caught two significant performance problems in database migrations.\r\n\r\nThis talk will cover how we built the test infrastructure (in python!). It will cover what we've learned from the 12 months of running it - time that we'll have had by the conference day. It will tell a story about some of the bugs we've found and how we fixed them.\r\n..", "start": "2014-08-03 16:30:00", "schedule_id": 65, "url": "http://2014.pycon-au.org/schedule/30046/view_talk", "duration": "0:30:00", "presenters": "Joshua Hesketh"}, {"end": "2014-08-03 12:10:00", "title": "Building Better Web APIs", "event_id": 28, "abstract": "Web APIs are how much of the modern web speaks - services speaking HTTP and JSON are ubiquitous, and nearly everything from your phone to your TV interacts with one of them. We'll go over how APIs are structured and versioned, how you test them, and how you let people authenticate to them -- and what the best practices are when creating them.", "start": "2014-08-03 11:40:00", "schedule_id": 67, "url": "http://2014.pycon-au.org/schedule/30015/view_talk", "duration": "0:30:00", "presenters": "HawkOwl  "}, {"end": "2014-08-01 09:15:00", "title": "Welcome", "event_id": 66, "abstract": "", "start": "2014-08-01 09:00:00", "schedule_id": 87, "duration": "0:15:00"}, {"end": "2014-08-01 09:45:00", "title": " OpenStack Identity and Federation ", "event_id": 67, "abstract": "", "start": "2014-08-01 09:15:00", "schedule_id": 89, "duration": "0:30:00", "presenters": " Jamie Lennox (Red Hat)  "}, {"end": "2014-08-01 10:25:00", "title": " Python Build Reasonableness and Semantic Versioning ", "event_id": 68, "abstract": "", "start": "2014-08-01 09:55:00", "schedule_id": 90, "duration": "0:30:00", "presenters": " Robert Collins (HP) "}, {"end": "2014-08-01 11:20:00", "title": "  Tempest: OpenStack Integrated Testing", "event_id": 69, "abstract": "", "start": "2014-08-01 10:50:00", "schedule_id": 91, "duration": "0:30:00", "presenters": " Matthew Treinish (HP) "}, {"end": "2014-08-01 12:00:00", "title": " Changing the world with ZeroVM and Swift", "event_id": 70, "abstract": "", "start": "2014-08-01 11:30:00", "schedule_id": 92, "duration": "0:30:00", "presenters": " Jakub Krajcovic (Rackspace Australia) "}, {"end": "2014-08-01 14:00:00", "title": " Deploy your Python app into an OpenStack cloud using Solum", "event_id": 71, "abstract": "", "start": "2014-08-01 13:30:00", "schedule_id": 93, "duration": "0:30:00", "presenters": " Angus Salkeld (Rackspace Australia) "}, {"end": "2014-08-01 14:40:00", "title": "  OpenStack security", "event_id": 72, "abstract": "", "start": "2014-08-01 14:10:00", "schedule_id": 94, "duration": "0:30:00", "presenters": " Grant Murphy (Red Hat) "}, {"end": "2014-08-01 15:20:00", "title": "  TripleO – What, Why, How", "event_id": 73, "abstract": "", "start": "2014-08-01 14:50:00", "schedule_id": 95, "duration": "0:30:00", "presenters": " James Polley (HP) "}, {"end": "2014-08-01 16:15:00", "title": " How to Read the Logs ", "event_id": 74, "abstract": "", "start": "2014-08-01 15:45:00", "schedule_id": 96, "duration": "0:30:00", "presenters": " Anita Kuno  (HP) "}, {"end": "2014-08-01 16:55:00", "title": " Large Scale Identification of Race Conditions (In OpenStack CI)", "event_id": 75, "abstract": "", "start": "2014-08-01 16:25:00", "schedule_id": 97, "duration": "0:30:00", "presenters": " Joseph Gordon (HP) "}, {"end": "2014-08-01 14:10:00", "title": "", "event_id": 91, "abstract": "", "start": "2014-08-01 14:00:00", "schedule_id": 122, "duration": "0:10:00"}, {"end": "2014-08-01 17:10:00", "title": "Close", "event_id": 101, "abstract": "", "start": "2014-08-01 17:00:00", "schedule_id": 125, "duration": "0:10:00"}], "Foyer": [{"end": "2014-08-01 08:50:00", "title": "Registration", "event_id": 1, "abstract": "", "start": "2014-08-01 07:30:00", "schedule_id": 1, "duration": "1:20:00"}, {"end": "2014-08-02 09:00:00", "title": "Registration", "event_id": 1, "abstract": "", "start": "2014-08-02 08:00:00", "schedule_id": 2, "duration": "1:00:00"}, {"end": "2014-08-02 10:20:00", "title": "Morning Tea", "event_id": 2, "abstract": "", "start": "2014-08-02 10:00:00", "schedule_id": 4, "duration": "0:20:00"}, {"end": "2014-08-02 15:40:00", "title": "Afternoon Tea", "event_id": 4, "abstract": "", "start": "2014-08-02 15:20:00", "schedule_id": 6, "duration": "0:20:00"}, {"end": "2014-08-03 09:00:00", "title": "Registration", "event_id": 1, "abstract": "", "start": "2014-08-03 08:00:00", "schedule_id": 14, "duration": "1:00:00"}, {"end": "2014-08-03 10:20:00", "title": "Morning Tea", "event_id": 2, "abstract": "", "start": "2014-08-03 10:00:00", "schedule_id": 41, "duration": "0:20:00"}, {"end": "2014-08-03 15:50:00", "title": "Afternoon Tea", "event_id": 4, "abstract": "", "start": "2014-08-03 15:30:00", "schedule_id": 59, "duration": "0:20:00"}, {"end": "2014-08-01 10:45:00", "title": "Morning Tea", "event_id": 2, "abstract": "", "start": "2014-08-01 10:25:00", "schedule_id": 73, "duration": "0:20:00"}, {"end": "2014-08-01 15:40:00", "title": "Afternoon Tea", "event_id": 4, "abstract": "", "start": "2014-08-01 15:20:00", "schedule_id": 76, "duration": "0:20:00"}, {"end": "2014-08-02 20:00:00", "title": "Dinner", "event_id": 7, "abstract": "", "start": "2014-08-02 18:00:00", "schedule_id": 85, "duration": "2:00:00"}]}