[{"Description": "", "Title": "Lunch", "Event": 24, "Start": "2013-01-28 12:20:00", "Duration": "1:00:00", "Id": 11, "Room Name": "uncatered"}, {"Description": "", "Title": "Miniconf TBA", "Event": 25, "Start": "2013-01-28 10:40:00", "Duration": "1:40:00", "Id": 18, "Room Name": "Location X"}, {"Description": "", "Title": "Miniconf TBA", "Event": 25, "Start": "2013-01-28 13:20:00", "Duration": "1:40:00", "Id": 25, "Room Name": "Location X"}, {"Description": "", "Title": "Miniconf TBA", "Event": 25, "Start": "2013-01-28 15:40:00", "Duration": "1:40:00", "Id": 32, "Room Name": "Location X"}, {"Description": "", "Title": "Lunch", "Event": 24, "Start": "2013-01-29 12:20:00", "Duration": "1:00:00", "Id": 41, "Room Name": "uncatered"}, {"Description": "", "Title": "Morning Tea", "Event": 26, "Start": "2013-01-29 10:00:00", "Duration": "0:40:00", "Id": 62, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Morning Tea", "Event": 22, "Start": "2013-02-01 10:00:00", "Duration": "0:40:00", "Id": 63, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Morning Tea", "Event": 22, "Start": "2013-01-31 10:00:00", "Duration": "0:40:00", "Id": 64, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Lunch", "Event": 24, "Start": "2013-01-31 12:20:00", "Duration": "1:00:00", "Id": 65, "Room Name": "uncatered"}, {"Description": "", "Title": "Lunch", "Event": 24, "Start": "2013-02-01 12:20:00", "Duration": "1:00:00", "Id": 66, "Room Name": "uncatered"}, {"Description": "", "Title": "Lunch", "Event": 24, "Start": "2013-01-30 12:20:00", "Duration": "1:00:00", "Id": 68, "Room Name": "uncatered"}, {"Description": "", "Title": "Afternoon Tea", "Event": 23, "Start": "2013-01-30 15:00:00", "Duration": "0:40:00", "Id": 69, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Afternoon Tea", "Event": 23, "Start": "2013-01-31 15:00:00", "Duration": "0:40:00", "Id": 70, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Afternoon Tea", "Event": 23, "Start": "2013-02-01 15:00:00", "Duration": "0:40:00", "Id": 71, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Morning Tea", "Event": 26, "Start": "2013-01-28 10:00:00", "Duration": "0:40:00", "Id": 72, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Main conference opening", "Event": 28, "Start": "2013-01-30 09:20:00", "Duration": "0:40:00", "Id": 75, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Morning Tea", "Event": 22, "Start": "2013-01-30 10:00:00", "Duration": "0:40:00", "Id": 76, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Afternoon Tea", "Event": 27, "Start": "2013-01-28 15:00:00", "Duration": "0:40:00", "Id": 77, "Room Name": "MCC Foyer"}, {"Description": "", "Title": "Afternoon Tea", "Event": 27, "Start": "2013-01-29 15:00:00", "Duration": "0:40:00", "Id": 78, "Room Name": "MCC Foyer"}, {"Description": "Started as a braindead fuzz-testing tool for calling system calls with random garbage, trinity has grown into a tool that (at time of writing) seems to be finding bugs in areas all over the kernel, from network protocols to filesystems, from virtual memory to virtualisation, and many more.\r\n\r\nWhile the idea of system call fuzzing has been around for a long time (dating back to days even pre-dating Linux), this tool now uses a number of interesting techniques to find corner-case bugs, and increase overall coverage testing.\r\n\r\nOn startup, Trinity creates a lot of random metadata (sockets, file handles, memory mappings, etc), and passes them to syscalls as they request them. Results are stored, and passed on to other future syscalls (possibly made by different threads). All sorts of mayhem ensues.\r\n\r\nWill include a demo runthrough, and discussion of some of the more interesting bugs that have been found so far.", "Title": "Trinity: A Linux kernel fuzz tester (and then some)", "URL": "http://linux.conf.au/schedule/30216/view_talk", "Event": 69, "Start": "2013-01-30 10:40:00", "Presenter_emails": "davej@redhat.com", "Presenters": "Dave Jones", "Duration": "0:45:00", "Id": 79, "Room Name": "MCC1"}, {"Description": "Aesthetic design is not unicorn magic; It's a pragmatic & predictable process. Getting to know the syntax is more achievable than we think. \r\n\r\nWould you like to better understand why some things are ugly, off-putting or broken but  don't always know what to do about it? This talk is for you!\r\n\r\nWe'll run a marathon starting with the design fundamentals and journey right through to the worlds of user experience and interface design. \r\n\r\nWin a few arguments with designers, get insight into their realm and most importantly: think, create and critique — anything and everything until you understand it completely.", "Title": "Think, Create & Critique Design", "URL": "http://linux.conf.au/schedule/30217/view_talk", "Event": 41, "Start": "2013-01-30 10:40:00", "Presenter_emails": "andyfitz@gmail.com", "Presenters": "Andy Fitzsimon", "Duration": "0:45:00", "Id": 80, "Room Name": "MCC2"}, {"Description": "In the last year, the specifications of WebRTC (real-time communication) have improved massively and first implementations of the PeerConnection API are available in Google Chrome and Opera.\r\n\r\nWeb developers are now able to imple­ment video con­fer­en­cing in Web pages with just a few lines of JavaS­cript code - given a server that provides connection setup functionality.\r\n\r\nThe Medi­aStream and Peer­Con­nec­tion objects provide some­thing fun­da­ment­ally dif­fer­ent from the tra­di­tional web: peer-to-peer con­nec­tions without an inter­me­di­ate relay. This present­a­tion will explain the new objects, dig into the challenges that had to be overcome to make this happen, and show a demo of their (still experimental) imple­ment­a­tion in the Chrome and Opera Web browsers. By the time of LCA, Mozilla may have experimental implementations, too.\r\n", "Title": "Code up your own video conference in HTML5", "URL": "http://linux.conf.au/schedule/30040/view_talk", "Event": 115, "Start": "2013-01-30 10:40:00", "Presenter_emails": "silviapfeiffer1@gmail.com", "Presenters": "Silvia Pfeiffer", "Duration": "0:45:00", "Id": 81, "Room Name": "MCC3"}, {"Description": "The disruptor is an open source library with a unique take on concurrent programming. Bucking the trend of moving higher up the stack, the disruptor focuses on mechanical sympathy - working in a way that best fits the way CPUs actually work. Contrary to popular belief, this leads to a simpler, more efficient architecture that actually makes development easier. This talk will introduce the disruptor, explain why its so fast and explain how to use it most effectively.", "Title": "Concurrent Programming with the Disruptor", "URL": "http://linux.conf.au/schedule/30168/view_talk", "Event": 34, "Start": "2013-01-30 10:40:00", "Presenter_emails": "adrian@symphonious.net", "Presenters": "Adrian Sutton", "Duration": "0:45:00", "Id": 82, "Room Name": "MCC4"}, {"Description": "GSM/3G are surprisingly insecure, which is sad since good cryptographic frameworks exist.  During the past year the Serval Project has been working on integrating very strong security into voice, text and data transfers on a mesh network. Rather than implement a secure SIP and secure RTP combination, we have taken a fresh approach and created a light-weight but secure packet and voice transport that is designed from the ground up with mesh networking in mind.  One of the key innovations is using public keys as the network address, so that no key exchange or verification is required to setup an end-to-end encrypted channel.  Consideration has also been given to how to defeat man-in-the-middle attacks for peers who are not able to verify each others keys prior to connection.\r\n\r\nThe system will be demonstrated in it's intended application in open-source Serval Mesh telephones to allow secure telephone calls.\r\n\r\nPart of the talk will discuss the technical details of the security model, but (hopefully) in a fairly accessible manner that most developers should be able to follow, and in particular avoiding getting buried in mathematics.  Feedback on the security model is invited so that any obvious vulnerabilities can be addressed before the software becomes widely distributed.", "Title": "Making Mobile Communications Secure", "URL": "http://linux.conf.au/schedule/30058/view_talk", "Event": 88, "Start": "2013-01-30 10:40:00", "Presenter_emails": "paul@servalproject.org", "Presenters": "Paul Gardner-Stephen", "Duration": "0:45:00", "Id": 83, "Room Name": "MCC5"}, {"Description": "Pipes, FIFOs, signals, datagram and stream sockets (and sockets in the Unix versus Internet domains), file locks (various kinds!), environment variables, memory mappings, event file descriptors (eventfd), pseudo-terminals, message queues, semaphores, shared memory, and good old regular files...  The range of interprocess communication and synchronization (often referred to collectively as IPC) facilities available on Linux can at first seem bewildering.  Which facilities should an application use?  This tutorial provides an overview of each of the IPC facilities, showing the features that the different facilities have in common, and the features that distinguish them.\r\n\r\nThe aims of this tutorial are to provide developers with examples of the use of each of the IPC facilities and the beginnings of a roadmap to help decide which IPC facilities are likely to be most suitable when writing new applications.  I'll compare different IPC facilities using measures such as portability, flexibility, ease of use, operational limits, configurability, persistence (lifetime), access control, integration with the traditional Unix \"everything is a file\" model and the UNIX/Linux API in general, and specific functional advantages and disadvantages. I'll also briefly consider whether one can make any general statements about relative performance of different IPC facilities.\r\n\r\nAlthough aimed primarily at developers, other participants (e.g., system administrators) may find the tutorial useful for gaining greater insight into the operation, configuration, and management of the various IPC facilities.\r\n\r\nA reading knowledge of C will be useful.", "Title": "An Introduction to Linux IPC Facilities", "URL": "http://linux.conf.au/schedule/30020/view_talk", "Event": 57, "Start": "2013-01-30 10:40:00", "Presenter_emails": "michael.kerrisk@gmail.com", "Presenters": "Michael Kerrisk", "Duration": "1:40:00", "Id": 84, "Room Name": "MCC6"}, {"Description": "Did you know that your innocent USB mouse is actually a power-hungry battery-draining monster?  This talk explores the impact of USB devices on platform power consumption, and introduces some cool new power features in the Intel Ivy Bridge and Haswell USB host controllers.\r\n\r\nUSB devices have always been battery eaters.  A single active USB device will prevent runtime PM of USB host controllers, keep the CPU in higher C-states, and keep the system out of the new Intel S0i3 sleep states.  This talk will cover tools that can enable USB power management, including the USB power sysfs interface and the USB power options in PowerTop 2.0.  We'll also touch on the horrid little USB devices that break when power management is turned on, and how Linux customers can avoid purchasing them.\r\n\r\nWe'll also cover some cool new USB power management features that Intel has been stuffing into their Ivy Bridge and Haswell chipsets.  Ivy Bridge includes support for USB 3.0, and the new \"Link Power Management\" feature that allows individual links in the USB bus to power down.  Haswell includes support for a cool new mechanism to completely turn off USB ports, and a way to place the USB host controller into the deepest PCI power savings state (D3cold).\r\n\r\nThe aim of this talk is to educate users on how USB devices impact their battery life, and to introduce them to cool power savings on new and future Intel systems.  This talk targets all users, but will provide deep dives into technical details for the more advanced users.", "Title": "Vampire Mice: How USB PM impacts you", "URL": "http://linux.conf.au/schedule/30009/view_talk", "Event": 86, "Start": "2013-01-30 11:35:00", "Presenter_emails": "sarah.a.sharp@intel.com", "Presenters": "Sarah Sharp", "Duration": "0:45:00", "Id": 85, "Room Name": "MCC1"}, {"Description": "Seven years ago at LCA, Van Jacobsen introduced the concept of net channels but since then the concept of user mode networking has not hit the mainstream. There are several different user mode networking environments: Intel DPDK, BSD netmap, and Solarflare OpenOnload. Each of these provides higher performance than standard Linux kernel networking; but also creates new problems. This talk will explore the issues created by user space networking including performance, internal architecture, security and licensing.", "Title": "Userspace networking: fact or fiction?", "URL": "http://linux.conf.au/schedule/30063/view_talk", "Event": 254, "Start": "2013-01-30 11:35:00", "Presenter_emails": "stephen.hemminger@gmail.com", "Presenters": "Stephen Hemminger", "Duration": "0:45:00", "Id": 86, "Room Name": "MCC2"}, {"Description": "Two way radio systems such as those used in Police, Fire, Military, Ham Radio and Humanitarian applications are going Digital.  Analog systems such as Single Sideband (SSB) and Frequency Modulation (FM) are being replaced by speech coding, radio modems, and forward error correction.\r\n\r\nBut there is a problem - current two way digital radio systems are based on proprietary, closed source technology.  Closed source policies are poised to lock us out of experimentation and innovation for the next generation of two way digital radio.\r\n\r\nA group of Ham radio innovators are fighting against this trend, designing open source two way radio systems that out perform closed source alternatives. \r\n\r\nThis presentation will explain digital radio systems in terms that are easy to understand for the average LCA attendee.  The open source systems we have developed will be explained and demonstrated, including tips on how to get started with your own digital radio experiments.", "Title": "Open Source Digital Radio", "URL": "http://linux.conf.au/schedule/30019/view_talk", "Event": 85, "Start": "2013-01-30 11:35:00", "Presenter_emails": "david@rowetel.com", "Presenters": "David Rowe", "Duration": "0:45:00", "Id": 87, "Room Name": "MCC3"}, {"Description": "No hacker likes owning a windows box; who downs a \"Domain Administrator whiskey\" after popping an explorer.exe? No sir, its root whiskey after a shell, and we like it, like it, yes we do.\r\n\r\nJoin kiwi hacker Metlstorm in a collection of post-exploitation unix party tricks, the sort of thing that's going on in your hosting provider's appalling PHP webserver right now. You'll laugh, you'll cry, you'll immediately apply apparmour profiles to your apache! Whether its non-root rootkits, your desktop dbus dishing dirt on your discussions of dirty deeds, or your ssh shell sharing secrets surreptitiously, compromising Linux boxen is back in fashion. Its a POSIX party, and pam isn't the only one providing privilege!\r\n", "Title": "Ain't No Party Like A Unix Party", "URL": "http://linux.conf.au/schedule/30244/view_talk", "Event": 102, "Start": "2013-01-30 11:35:00", "Presenter_emails": "adam@storm.net.nz", "Presenters": "Adam Boileau", "Duration": "0:45:00", "Id": 88, "Room Name": "MCC4"}, {"Description": "The Humanitarian OpenStreetMap Team (HOT) applies the principles of open source and open data to humanitarian response and disaster preparedness. The OpenStreetMap project aims to make a free map of the entire world. Freely geographic information is specific valuable in disaster situations. Free data allows better decision making to be made for routing of supplies, internally displaced people to be registered more accurately, and better models to be build of impact before an event happens. HOT helps foster the availability and knowledge of free data and tools in two ways:\r\n\r\n1. After a disaster happens the OpenStreetMap community responds to gather geographic data, modify tools, and provide support to humanitarian responders working on the ground. \r\n\r\n2. HOT helps communities preparing for and recovering from disasters, by teaching them to collect geographic information and use that information to make better decisions.\r\n\r\nThis talk will show how ones hacker, coder, admin, documentation, instructor, and other skills can help make a difference in preparation for events such as earthquakes, volcanoes, and tsunamis. The audience will learn more about the HOT toolset such as QuantumGIS, Java OpenStreetMap Editor, and a few tools we've built to fulfill specific needs.  At the end those that want to help the project and start helping, will have the necessary information to join.", "Title": "Open Source and Open Data for Humanitarian Response with OpenStreetMap", "URL": "http://linux.conf.au/schedule/30237/view_talk", "Event": 71, "Start": "2013-01-30 11:35:00", "Presenter_emails": "kate.chapman@hotosm.org", "Presenters": "Kate Chapman", "Duration": "0:45:00", "Id": 89, "Room Name": "MCC5"}, {"Description": "Back in the 1990s, energy efficiency was not even on the list of RCU-related concerns. Systems using RCU at that time dealt with either large quantities of heavy equipment or large financial flows, so that the energy consumption of the entire server (let alone RCU's contribution) was way down in the noise. This situation changed dramatically with the 2002 introduction of RCU into the Linux kernel. Since then, RCU's energy-efficiency code has been rewritten more than five times. The most recent rewrite was motivated by workloads where RCU was leaving tens of percent of potential energy savings on the table. This talk will give a brief overview of how energy efficiency came to RCU, the current situation, future prospects, and generally applicable lessons learned.", "Title": "Making RCU Respect Your Device's Battery Lifetime", "URL": "http://linux.conf.au/schedule/30203/view_talk", "Event": 101, "Start": "2013-01-30 13:20:00", "Presenter_emails": "paulmckrcu@gmail.com", "Presenters": "Paul McKenney", "Duration": "0:45:00", "Id": 91, "Room Name": "MCC1"}, {"Description": "The Clojure language is inspired by the functional programming model\r\nof LISP and inherits the strengths of the JVM while avoiding the\r\npitfalls of Java.\r\n\r\nLearn why Clojure is designed for performance by avoiding unconscious\r\nmutation and providing Software Transactional Memory idioms for\r\nconcurrency.\r\n", "Title": "Clojure - Designed for Performance", "URL": "http://linux.conf.au/schedule/30273/view_talk", "Event": 76, "Start": "2013-01-30 13:20:00", "Presenter_emails": "tmarble@info9.net", "Presenters": "Tom Marble", "Duration": "0:45:00", "Id": 92, "Room Name": "MCC2"}, {"Description": "Over the years, geeks have used various pastimes to feed their curiosity. A common theme in these hobbies is communication. From Amateur radio operators, who build circuits to modulate their voice and pass it over the airwaves, to the modern mass market methods of packet switched communication services - IRC, email, VoIP.\r\n\r\nWhile the technology that amateur radio operators employ to communicate have been around for awhile, there is a large amount of modernisation going on. Design and assembly of circuits with more advanced DSP and SDR techniques is accessible to the average LCA attendee. Digital voice codecs commonly used by amateur radio operators are common, and David Rowe's Codec2 represents cutting edge low bitrate voice codec technology - open sourced!\r\n\r\nThe speaker and his accomplices have combined Codec2, a homebrew radio, and an Android phone to create a low cost, built-at-home system to perform digital voice transmission over radio.\r\n\r\nAs the architecture of the system is described during this talk, watch a radio get put together from basic components. This talk will give you the chance to experience a demo of controlling devices with the Android Host Device APIs, give insight into designing and building a radio, and describe the challenges involved in bringing it all together.", "Title": "Droids that talk: Pairing Codec2 and Android", "URL": "http://linux.conf.au/schedule/30226/view_talk", "Event": 100, "Start": "2013-01-30 13:20:00", "Presenter_emails": "joel@jms.id.au", "Presenters": "Joel Stanley", "Duration": "0:45:00", "Id": 93, "Room Name": "MCC3"}, {"Description": "Wikileaks, the Arab Spring, and the Occupy movement have made the need for user-controlled digital technologies clear, as activists have used the Internet and mobile phones to organise and to communicate with each other and with potential supporters. The consequences of failures in these systems, particularly security breaches, can be extreme: activists may face fines, jail time, or even death. Free and open source software (FOSS) provides one potential solution to these problems, as it is focused on users' needs. FOSS communities also already overlap significantly with many other activist communities, and are working to develop cross-movement connections as well as useful tools. However, many FOSS communities, and particularly those defined by a commitment to open source, rather than than free, software, are reluctant to take overt political stands. Similarly, many activists on both the left and the right have an aversion to digital technologies for both ideological and practical reasons. This means that there are frequently significant barriers to increasing the links between FOSS and progressive political movements. This presentation explores the connections between FOSS communities and the broader activist landscape. It looks at the politics of FOSS, the ways in which global movements and FOSS communities are building links, and the potential benefits of actively seeking cross-fertilisation of ideas and politics between FOSS and progressive movements.\r\n", "Title": "Free and open source software and activism", "URL": "http://linux.conf.au/schedule/30195/view_talk", "Event": 59, "Start": "2013-01-30 13:20:00", "Presenter_emails": "scroeser@gmail.com", "Presenters": "sky croeser", "Duration": "0:45:00", "Id": 94, "Room Name": "MCC4"}, {"Description": "LibreOffice is the most powerful and viable Free Software office suite, available across an increasing wealth of platforms. Come and hear a quick history and rational behind project. We'll look at what we've achieved so far primarily in development, but also in governance, community and process.\r\n\r\nWe ought to look at the wealth of new features shipping in the latest release, and take a look at some of the new things that are in the pipeline.\r\n\r\nSee a demo of the LibreOffice On-Line prototype, get a view of our in-progress Android Viewer application and port, and hear how almost all the work we do for these products helps the normal\r\nfat-client office experience too. Catch a glimpse too of our collaborative editing prototype, hear about it's design and issues.\r\n\r\nFinally find the best place for you to make a blow for Free Software as part of our development team; see you there.\r\n", "Title": "Two years of LibreOffice", "URL": "http://linux.conf.au/schedule/30198/view_talk", "Event": 116, "Start": "2013-01-30 13:20:00", "Presenter_emails": "michael.meeks@suse.com", "Presenters": "Michael Meeks", "Duration": "0:45:00", "Id": 95, "Room Name": "MCC5"}, {"Description": "The Bourne shell is universally available on every Linux system, from the least-powerful embedded device, to the largest supercomputer.\r\n\r\nIn this tutorial, we'll cover the basics of:\r\n  The Shell's input: how it reads words, splits them, expands special stuff, etc.\r\n  Control flow: case, if, while, for\r\n  Common utilities: sed, awk, grep, test, find, xargs, etc\r\n\r\nAfter some introductory material, we'll spend the time working together to build a simple server for fortunes/fables entirely in shell. \r\n\r\nAttendees should bring laptops, and be competent with a text editor.", "Title": "Shell for Starters", "URL": "http://linux.conf.au/schedule/30110/view_talk", "Event": 54, "Start": "2013-01-30 13:20:00", "Presenter_emails": "peter.chubb@nicta.com.au", "Presenters": "Peter Chubb", "Duration": "1:40:00", "Id": 96, "Room Name": "MCC6"}, {"Description": "Solid-state drives have made significant improvements to computing.  Recently, they have moved from being connected to storage busses (SAS and SATA) to being connected to system busses (PCIe).  There are several non-volatile memory technologies in development which claim to be able to achieve latencies comparable to DRAM; if successful, it would be logical to attach such non-volatile memory more closely to the CPU.\r\n\r\nThis presentation will cover the recent history of non-volatile memory usage as storage, and speculate on useful software interfaces for CPU addressable non-volatile memory.\r\n", "Title": "The future of non-volatile memory", "URL": "http://linux.conf.au/schedule/30184/view_talk", "Event": 99, "Start": "2013-01-30 14:15:00", "Presenter_emails": "matthew@wil.cx", "Presenters": "Matthew Wilcox", "Duration": "0:45:00", "Id": 97, "Room Name": "MCC1"}, {"Description": "Translation and internationalization brings open source software to people all over the globe, but it all starts with language support. This talk will explain how to add support for a new script to an open font, from character design to debugging, and how language communities can work with open font designers in an ongoing project. Along the way, we will see how the open source font toolchain can correct other common problems, from letterspacing to accents, and learn why it does not take an expert to make a real contribution.", "Title": "How to Fix a Font", "URL": "http://linux.conf.au/schedule/30308/view_talk", "Event": 82, "Start": "2013-01-30 14:15:00", "Presenter_emails": "nate@lwn.net", "Presenters": "Nathan Willis", "Duration": "0:45:00", "Id": 98, "Room Name": "MCC2"}, {"Description": "In the Asia Pacific Region the Regional Registry, APNIC, ran out of IPv4 addresses in April 2011. This presentation will examine the address allocation records leading up to the exhaustion, and the profile of IP address consumption in the 6 months prior to exhaustion, and compare this to the 12 months following exhaustion. The questions examined in this presentation relate to the extent to which the formation of a post exhaustion secondary re-distribution market has occurred, and an examination of the routing tables to see if there is any evidence of other forms of address redistribution in the Asia Pacific region. The effect of this exhaustion in other regions in the world will also be examined. The data being analysed for this presentation is the address registration records maintained by the Regional Routing Registries, and the inter-domain routing table (BGP) snapshots, and the key indicators I will be looking out are the allocation rate, the size distribution of allocations, the time period between allocation and advertisement, and the address transfer logs.\r\n\r\nThe second part of this presentation will look at IPv6 deployment metrics to examine the extent to which IPv4 exhaustion has had an impact on the momentum for the adoption of IPv6 in the ASia Pacific region.The presentation will compare IPv6 uptake rates pre and post exhaustion in the ASia Pacific region, and compare them with those of other regions.\r\n", "Title": "The IPocalypse - 20 months later", "URL": "http://linux.conf.au/schedule/30006/view_talk", "Event": 60, "Start": "2013-01-30 14:15:00", "Presenter_emails": "gih@apnic.net", "Presenters": "Geoff Huston", "Duration": "0:45:00", "Id": 99, "Room Name": "MCC3"}, {"Description": "Defence Signals Directorate (DSD) is the Commonwealth authority for cyber and information security. It plays a vital role in assisting federal and state authorities on matters relating to the security and integrity of information and networks. In order to achieve these goals, DSD works closely with the open source community and employs a large number of software developers that actively contribute to open source projects. We are not as secretive as some people would have you believe, and you might already be familiar with previous software that DSD has released.\r\n\r\nThis talk will first briefly touch on some of the previous open source projects DSD has released, including the \"PyFlag\" framework (a forensic analysis tool), \"White Trash\" (a Squid dynamic whitelisting module), and \"Spill Guard\" (a Microsoft Office data leak prevention tool).\r\n\r\nThe main focus of the talk will be on a newly open sourced prototype tool for the purpose of hard disk analysis called Pronghorn. Pronghorn is a proof of concept block analysis framework created by DSD staff as an entry to the DFRWS 2012 forensic challenge. It's not production ready, but it uses some novel concepts to automate the analysis of hard drive images.", "Title": "DSD and open source software", "URL": "http://linux.conf.au/schedule/30281/view_talk", "Event": 123, "Start": "2013-01-30 14:15:00", "Presenter_emails": "alan.leigh@defence.gov.au", "Presenters": "Alan Leigh", "Duration": "0:45:00", "Id": 100, "Room Name": "MCC4"}, {"Description": "Have you ever wondered what is happening in the inner core of your operating system?\r\nDid you spend countless hours trying to find an elusive timing problem?\r\n\r\nWhy the tracer?\r\nThe LTTng 2.0 project provides an easy to use tracing capability for Linux. Its tools can trace both the kernel and your userspace applications, allowing you to link operation in your application to the action of the operating system. It use the standard kernel trace instrumentation, so you don’t need to patch and recompile your kernel. This new generation provides a unified control tool which allows easy control of the data gathering (Creating a trace session, enabling events, adding context, start and stop recording, etc). The low overhead of the tracer allows you to run it on production system without affecting the performance of your applications.\r\n\r\nLTTng is also supported by powerful visualization tools which can give you a quick summary of the state of your system or a detailed timeline of each significant operation with a nanosecond precision. This presentation will focus on the usability of LTTng, showing how the combined user-space and kernel tracers, the high-level summary views such as LTTngTop, the graphical analysis tools such as the Eclipse Linux Tools LTTng plugin or the Python scripting extensions, can be used to solve hard software problems.\r\n\r\nLTTng can be easily installed with your favorite package manager in Debian, Ubuntu, Fedora and OpenSuse.\r\n\r\nIf you are a sysadmin wanting to get a better understanding of the load of your server or an application developer with a latency or performance problem, this presentation will give you a tool that can find and solve your problems.", "Title": "LTTng 2.0: Advanced Linux tracing for everyone", "URL": "http://linux.conf.au/schedule/30231/view_talk", "Event": 117, "Start": "2013-01-30 14:15:00", "Presenter_emails": "yannick.brosseau@polymtl.ca", "Presenters": "Yannick Brosseau", "Duration": "0:45:00", "Id": 101, "Room Name": "MCC5"}, {"Description": "As the Linux graphics system has matured in recent years, developers\r\nhave had the opportunity to shift their focus from feature\r\nimplementation (OpenGL 3.x conformance, GLSL support, etc.) to\r\noptimization. At the same time, tools for measuring graphics\r\nperformance have historically been quite limited, (often little more\r\nthan the moral equivalents of time and top).\r\n\r\nIn this presentation I will discuss recent developments in tools (such\r\nas apitrace) for measuring GPU performance. I will also showcase some\r\nof the most most significant, recent performance improvements for\r\nLinux graphics, focusing primarily on Intel GPUs.", "Title": "Measuring and Improving OpenGL Performance", "URL": "http://linux.conf.au/schedule/30213/view_talk", "Event": 122, "Start": "2013-01-30 15:40:00", "Presenter_emails": "cworth@cworth.org", "Presenters": "Carl Worth", "Duration": "0:45:00", "Id": 105, "Room Name": "MCC1"}, {"Description": "Is your application running slow? Have performance issues got you down? Do you suspect yet another Linux kernel performance bug is the cause of all your problems?\r\n\r\nThe increasing complexity of hardware and software is making it more difficult to understand the cause of performance issues. This presentation will look at the tools and techniques for analysing performance issues on Linux. Real world examples of userspace, kernel and hardware issues will be analysed.\r\n\r\nAlong the way, things that can wreak havoc with performance analysis such as just in time compilation, interpreted languages, virtualisation and cloud environments will be addressed.", "Title": "How to make (almost) anything go faster", "URL": "http://linux.conf.au/schedule/30183/view_talk", "Event": 97, "Start": "2013-01-30 15:40:00", "Presenter_emails": "anton@samba.org", "Presenters": "Anton Blanchard", "Duration": "0:45:00", "Id": 106, "Room Name": "MCC2"}, {"Description": "MyPortfolio.school.nz is a national portfolio service offered to all schools in New Zealand. It is based on the open source ePortfolio system Mahara. Established in 2008, MyPortfolio has grown from a trial to a fully embedded system in the New Zealand school sector. There are already more than 1,100 schools connected with over 64,000 accounts (July 2012) making it the largest Mahara instance in the world. \r\n\r\nOn MyPortfolio, students and teachers can create electronic portfolios to showcase and reflect on their learning. Portfolios can also be used as an alternative form of assessment in which authentic learning evidence is evaluated and viewed in context. In addition to the creation of portfolios, learners can collaborate on group portfolios, work on team projects and discuss topics in online forums.\r\n\r\nThis presentation outlines the process from the inception of MyPortfolio to an established system within the Managed Learning Environment of New Zealand schools. It especially looks at the time from 2010 to 2012 in which the growth has been more rapid, aided by workshops, email and increasingly online forum support. We will detail examples within this community of ePortfolio users that indicate avenues for sustainable support and growth. In addition, we will outline ways in which community members can and already have influenced further development of the underlying software, how new ideas become part of core Mahara and how this community is linked back to the wider Mahara community.", "Title": "Using open source in over 1,100 schools in New Zealand", "URL": "http://linux.conf.au/schedule/30187/view_talk", "Event": 98, "Start": "2013-01-30 15:40:00", "Presenter_emails": "kristina@catalyst.net.nz", "Presenters": "Kristina Hoeppner", "Duration": "0:45:00", "Id": 107, "Room Name": "MCC3"}, {"Description": "redgrep is a grep based on regular expression derivatives. That is, it uses regular expression derivatives to construct the DFA†. It then uses LLVM to JIT‡ the DFA.\r\n\r\nSince regular expression derivatives permit the three basic Boolean operations of disjunction (|), conjunction (&) and complement (!), redgrep enables you to write very powerful regular expressions very easily and guarantees to match them in linear time.\r\n\r\nIn this talk, we will cover how regular expression derivatives work, then dive into their implementation in redgrep. Resurfacing after a look at code generated by LLVM, we will conclude with benchmarks.\r\n\r\n\r\n† Deterministic Finite Automaton\r\n‡ Just-In-Time compile\r\n", "Title": "redgrep: from regular expression derivatives to LLVM", "URL": "http://linux.conf.au/schedule/30022/view_talk", "Event": 36, "Start": "2013-01-30 15:40:00", "Presenter_emails": "junyer@google.com", "Presenters": "Paul Wankadia", "Duration": "0:45:00", "Id": 108, "Room Name": "MCC4"}, {"Description": "Netfilter is an extremely powerful framework for manipulating packets, but does anyone actually like writing rules for it with iptables? Anyone who says they do likely hasn't had to maintain rulesets at scale, and if they have, they've almost certainly used some sort of tool that does the heavy lifting for them. \r\n\r\nEnter Ript, a clean and opinionated Domain Specific Language for describing firewall rules, that implements database migrations-like functionality for applying these rules with zero downtime.\r\n\r\nAt Ript's core is an easy to use Ruby DSL for describing both simple and complex sets of iptables firewall rules. After defining the hosts and networks you care about, Ript's DSL provides helpers for all the common use cases: accepting, dropping, & rejecting packets, as well as for performing DNAT and SNAT. \r\n\r\nHere is an example ruleset definition: \r\n\r\n# partitions/joeblogsco.rb\r\npartition \"joeblogsco\" do\r\n  label \"www.joeblogsco.com\", :address => \"72.14.191.216\"\r\n  label \"app-01\",             :address => \"10.60.1.230\"\r\n\r\n  rewrite \"public website + ssh access\" do\r\n    ports 80, 22\r\n    dnat  \"www.joeblogsco.com\" => \"app-01\"\r\n  end\r\nend\r\n\r\nRipt provides a method to group common sets of rules together called \"partitions\", which are used at rule application time to perform zero-downtime migrations. This fosters a much more agile approach to firewall changes that limits the size and helps increase the frequency of changes - core principles behind Continuous Delivery. \r\n\r\nRipt is designed from the ground up to be easy to use, and is extremely well tested end-to-end. Developed at Bulletproof Networks, it's been in use since 2012 in multi-tenanted firewall platforms as well as standalone systems. \r\n\r\nIn this talk Lindsay Holmwood will take you on a whirlwind tour of the DSL, explain how Ript utilises iptables features to work its magic, and provide some concrete examples of how Ript can help increase the reliability of the services you deliver.\r\n\r\n", "Title": "Ript: a terse but expressive DSL for iptables", "URL": "http://linux.conf.au/schedule/30293/view_talk", "Event": 63, "Start": "2013-01-30 15:40:00", "Presenter_emails": "lindsay@holmwood.id.au", "Presenters": "Lindsay Holmwood", "Duration": "0:45:00", "Id": 109, "Room Name": "MCC5"}, {"Description": "Slow programs are frustrating to use, and feel like they're getting in the users' way, rather than helping them.  Projects that make it hard to get code landed or released can be just as infuriating.\r\n\r\nI've made mistakes in all those areas, and in this talk I'll share ideas and specific techniques: to make performance work tractable and to avoid performance regressions; to increase cadence and quality; and most of all to make the project easier and more fun to work on, especially for new contributors.", "Title": "Remedies for frustration with speed, quality, and reviews", "URL": "http://linux.conf.au/schedule/30332/view_talk", "Event": 270, "Start": "2013-01-30 15:40:00", "Presenter_emails": "mbp@sourcefrog.net", "Presenters": "Martin Pool", "Duration": "0:45:00", "Id": 110, "Room Name": "MCC6"}, {"Description": "The Perl Renaissance is in full swing. Object frameworks and syntax have been undated, web frameworks are easy and powerful, and modules are easy to manage and install.  \r\n\r\n* Overhauling Perl's Object Oriented framework with Moose.\r\n* Using MooseX::Method::Signatures for beautiful classes.\r\n* Building web applications using Dancer\r\n* Not worrying about web servers by using Plack.\r\n* Critiquing your code with Perl::Critic\r\n* Write amazing regexps with named captures.\r\n* Install new modules quickly and easily with cpanminus\r\n* Manage Perl installations easily with perlbrew\r\n* A whole swag of new features with perl 5.10–5.16\r\n* Much, much more!\r\n\r\n", "Title": "The Perl Renaissance", "URL": "http://linux.conf.au/schedule/30319/view_talk", "Event": 108, "Start": "2013-01-30 16:35:00", "Presenter_emails": "paul.j.fenwick@gmail.com", "Presenters": "Paul Fenwick", "Duration": "0:45:00", "Id": 111, "Room Name": "MCC1"}, {"Description": "The Open Web Application Security Project (OWASP) Developer Guide 2013 is coming soon. In this presentation, you'll learn about the major revision to one of the major open source code hardening resources. \r\n\r\nThe new version will encompass not only web applications (although that is its primary focus), but also general advice for all languages, frameworks, and applications through the use of re-usable architecture, designs, patterns and practices that you can adopt in your code with a bit of thought. \r\n\r\nLearn about:\r\n\r\n* The latest research in application security \r\n* How to apply new patterns to eliminate hundreds of security flaws in your apps, such as the bizarre world of race conditions, distributed and parallel artefacts. Few apps can afford to be single threaded any more, and yet these subtle flaws are easily prevented if you only knew how\r\n* Challenges of documenting bleeding edge practices in long lived documents\r\n* How to pull together a global open source document team whilst holding down a day job\r\n\r\nIf you code web apps, or write apps that need to be secure, this is a must attend presentation!", "Title": "OWASP Developer Guide 2013 - what it means for open source projects", "URL": "http://linux.conf.au/schedule/30285/view_talk", "Event": 78, "Start": "2013-01-30 16:35:00", "Presenter_emails": "vanderaj@greebo.net", "Presenters": "Andrew van der Stock", "Duration": "0:45:00", "Id": 112, "Room Name": "MCC2"}, {"Description": "This presentation will examine the extraordinary decision by the Full Federal Court in the Optus \"TV Now\" case and its serious ramifications for the future of cloud based computing and streaming services. \r\n\r\nThe presentation will discuss the potential effects on cloud based services, streaming services and mobile entertainment that flow from the severe restrictions outlined in the decision on the \"personal recording\" copyright exemption. \r\n\r\nThe High Court has recently declined special leave to appeal, so this case now forms the basis for interpreting the \"personal recording\" exemption. I will examine the implications of this for industry and the potential way forward for reform.\r\n\r\nThe presentation will draw on some of the analysis that I have written in http://www.czaxxover140.blogspot.com.au/2012/02/optus-v-nrl-rightsholders-vs.html and http://www.czaxxover140.blogspot.com.au/2012/06/optus-v-nrl-copyrights-dark-clouds.html", "Title": "Copyright's Dark Clouds: Optus v NRL", "URL": "http://linux.conf.au/schedule/30133/view_talk", "Event": 35, "Start": "2013-01-30 16:35:00", "Presenter_emails": "powell.bm@gmail.com", "Presenters": "Ben Powell", "Duration": "0:45:00", "Id": 113, "Room Name": "MCC3"}, {"Description": "[with Craig Burton, E-Voting Manager, Victorian Electoral Commission]\r\n\r\nEssential to the proper functioning of a democracy is the right of citizens to vote freely, privately and independently. Electronic voting can enable this right to be exercised by a diverse voter population, in particular by people who are unable to complete a conventional paper ballot.\r\n\r\nIn this presentation, an overview is provided of a proposed design for an open-source, electronic voting system to be used in polling stations in the state of Victoria. This proposal is distinguished from prior practice by a commitment to developing a system which is end-to-end verifiable. Individual electors can verify that their votes are correctly recorded, and any member of the public can audit the election, including the decryption and counting of votes, without jeopardizing the privacy of voters.\r\n\r\nWe shall outline the procedures to be used at polling stations to cast votes, and explain how voters (with and without disabilities) can verify the integrity of the system. We also introduce open-source tools, employing mix networks and zero-knowledge proofs, which can be used in the conduct of an election, demonstrating how these tools  operate to verify the processing of votes.\r\n", "Title": "Designing a Verifiable and Accessible Electronic Voting System", "URL": "http://linux.conf.au/schedule/30130/view_talk", "Event": 44, "Start": "2013-01-30 16:35:00", "Presenter_emails": "jason@jasonjgw.net,craig.burton@vec.vic.gov.au", "Presenters": "Jason White,Craig Burton", "Duration": "0:45:00", "Id": 114, "Room Name": "MCC4"}, {"Description": "UEFI Secure Boot feature has attracted a lot of attentions from the Linux community. This presentation details the motivations behind the creation of the UEFI technology, the history and future of its industry adoption on systems based on a variety of processor architectures. It contrasts the differences between the TCG Trusted Boot and UEFI Secure Boot, and what role, if any, TPM plays in either or both. It discusses the motivations and history of the UEFI Secure Boot feature.\r\n\r\nThe main targeted audience of this presentation is the Linux OS loader and kernel developers dealing with the machine dependent interactions with the platforms.\r\n", "Title": "UEFI, the Converged Firmware Infrastructure", "URL": "http://linux.conf.au/schedule/30021/view_talk", "Event": 39, "Start": "2013-01-30 16:35:00", "Presenter_emails": "dong.wei@hp.com", "Presenters": "Dong Wei", "Duration": "0:45:00", "Id": 115, "Room Name": "MCC5"}, {"Description": "HTML5. CSS 3. ECMAScript. WebGL. SVG. If there is ever a worldwide shortage of acronyms, the Web developer community can definitely contribute a few back. We've all heard about the amazing things that can be done with this technology stack on everything from a two year old Android phone up to a massive supercomputer running Chrome in an X session, and seen the cool demos.\r\n\r\nUltimately, though, cool technology impresses disappointingly few people, and leaves them asking \"now what?\". To make matters worse, a technical demo that works brilliantly in, for example, Firefox on the desktop might be unusably slow on Chrome on iOS, or worse, not even work due to poor feature detection or CSS property prefixing.\r\n\r\nIn this talk, I'll discuss ways to both design and implement common effects in a future-proof, performant way on a variety of platforms: touchscreen phones and tablets, hybrid tablets, traditional desktops, even embedded devices with remote controls. Furthermore, I'll cover whether and when you should be reaching for the animation and visual effect toolbox, and how to juggle the need for responsiveness against the need to stand out from the crowd.", "Title": "users: delighted; (better UX using CSS 3 in particular and \"HTML5\" in general)", "URL": "http://linux.conf.au/schedule/30224/view_talk", "Event": 75, "Start": "2013-01-30 16:35:00", "Presenter_emails": "adam@adamharvey.name", "Presenters": "Adam Harvey", "Duration": "0:45:00", "Id": 116, "Room Name": "MCC6"}, {"Description": "Checkpoint/restore is a feature that allows to freeze a set of running processes and save their complete state to a disk. This state can later be restored, so the processes resume exactly the way they were running before. This feature opens a whole set of possibilities, such as live migration, fast start of a huge application, or kernel update without service interruption. While such functionality exist in e.g. OpenVZ kernel, many attempts to merge it upstream had failed miserably, mostly for the code complexity reasons.\r\n\r\nWe found a way to overcome this by implementing most of the required pieces in userspace, using the existing kernel APIs and extending those if necessary. This is what Checkpoint and Restore in Userspace (aka CRIU) project is about.\r\n\r\nThe talk outlines the current state of the project, including:\r\n- recent CRIU-related changes merged to the upstream kernel and their use outside of CRIU needs;\r\n- current abilities of CRIU userspace tool, including a demo of Apache+MySQL checkpoint/restore;\r\n- plans for the future.\r\n\r\nThe report is of interest to system and distro developers, advanced users, and anyone interested in containers, virtualization, HA and HPC.\r\n", "Title": "Checkpoint and Restore: are we there yet?", "URL": "http://linux.conf.au/schedule/30116/view_talk", "Event": 94, "Start": "2013-01-31 10:40:00", "Presenter_emails": "xemul@openvz.org", "Presenters": "Pavel Emelyanov", "Duration": "0:45:00", "Id": 117, "Room Name": "MCC1"}, {"Description": "Avatar has made 3D films popular again; and the necessary hardware for stereoscopic filming is now cheap enough for individuals. This is a talk about a small real world development project, covering several different aspects in brief instead of focusing on one technical issue.\r\n\r\nThe project goal was to help the production of a low budget 3D film by writing a program for realtime display of stereoscopic video on a Linux laptop. The film maker was using a home built rig built around two Elphel cameras (themselves running embedded Linux) and needed to be able to preview and adjust stereo parameters on location.\r\n\r\nDevelopment was mostly in Python using wxWidgets and GStreamer. I'll talk about issues with event loops in GUI toolkits and the benefits of the GStreamer modular pipeline architecture.\r\n\r\nA key part of the program was using the GPU to de-Bayer raw camera input in realtime. I'll also talk about shader programming, and what would be required in a possible future integration of GPU components within GStreamer.", "Title": "Stereographic film making and Linux", "URL": "http://linux.conf.au/schedule/30129/view_talk", "Event": 52, "Start": "2013-01-31 10:40:00", "Presenter_emails": "hugh.fisher@anu.edu.au", "Presenters": "Hugh Fisher", "Duration": "0:45:00", "Id": 118, "Room Name": "MCC2"}, {"Description": "'diff' and 'patch' are great tools for communicating, reviewing and applying changes to text files such as program source code.  They are even better when the functionality is included in a distributed content tracker such as 'git'.\r\n\r\nHowever in a world of highly parallel development we are often faced with conflicting changes which 'patch' cannot resolve. Resolving these by hand can get boring.\r\n\r\n'wiggle' is a tool that helps you apply patches that 'patch' cannot handle by finding a best-possible match and allowing you to review the resulting merge to accept or decline each hunk, falling back on manual resolution only in cases of serious conflict.\r\n\r\nThis talk will describe a variant of the 'diff' algorithm that is used for finding best-matches and will show how this can help provide pain-free conflict resolution.\r\n", "Title": "Wiggle while you work", "URL": "http://linux.conf.au/schedule/30052/view_talk", "Event": 58, "Start": "2013-01-31 10:40:00", "Presenter_emails": "neilb@suse.de", "Presenters": "Neil Brown", "Duration": "0:45:00", "Id": 119, "Room Name": "MCC3"}, {"Description": "NetFPGA (www.netfpga.org) is a platform for developing 1Gbps or 10Gbps wire-speed layer 2 and 3 switching in reprogrammable hardware, using Xilinx Field Programmable Gate Arrays (FPGAs). NetFPGA is developed at Stanford University and enjoys primary support on Linux hosts. The codebase is open source.\r\n\r\nIn developing a low-power network switch for our Power-over-Ethernet low-cost SoC cluster, we develop the USB2 interface and switching firmware using NetFPGA as a development platform. A small adaptor board has been developed that connects to the debug connector of the NetFPGA card and allows dual USB2 network interfaces for small low-power System-on-a-Chip devices such as NVidia Tegra 2/3, TI OMAP and others.\r\n\r\nThis presentation will discuss the development of the NetFPGA USB 2 interface using a conglomeration of open-source and freeware tools, all hosted on Linux development platforms.\r\n\r\nhttps://gnosia.anu.edu.au/wiki/NetFPGA_USB_2", "Title": "NetFPGA USB 2 interface", "URL": "http://linux.conf.au/schedule/30255/view_talk", "Event": 104, "Start": "2013-01-31 10:40:00", "Presenter_emails": "bob@cs.anu.edu.au", "Presenters": "Robert Edwards", "Duration": "0:45:00", "Id": 120, "Room Name": "MCC4"}, {"Description": "Puppet is a pervasive, open source configuration management language that has traditionally been used to perform configuration of individual servers.\r\n\r\nAt its core, Puppet is really 3 things:\r\n- an API for managing the states of things,\r\n- a language for composing configuration interfaces,\r\n- a language for managing the dependencies between things.\r\n\r\nThis presentation will demonstrate how these characteristics actually make Puppet a great language for modeling application clusters. It will cover:\r\n- how application clusters can be considered as state,\r\n- how Puppet's device APIs can be used to model the state of things through RPCs,\r\n- the changes required to Puppet core for it to be able to manage application clusters.\r\n", "Title": "Using Puppet to Model Application clusters", "URL": "http://linux.conf.au/schedule/30250/view_talk", "Event": 73, "Start": "2013-01-31 10:40:00", "Presenter_emails": "dan@puppetlabs.com", "Presenters": "Dan Bode", "Duration": "0:45:00", "Id": 121, "Room Name": "MCC5"}, {"Description": "Git can be a confusing morass of rote commands whose names often don't have much to do with what it actually does.  To better understand Git, it is important to know how Git works internally.  Unfortunately this is often explained in terms of things like \"Directed Acyclic Graphs\" and other intimidating computer science terms.  It turns out Git only has a few tricks, and they can be illustrated very accurately using simple children's toys.\r\n\r\nWe'll be illustrating the basic commands (add, commit) do; the index/staging area; the stash; branching and merging; tagging; remotes; reset; and rebase if time allows.\r\n\r\nBasic knowledge of version control concepts and git commands is expected of the audience.  If you’ve started using git, but are uncomfortable with it, don’t really get it, and the commands seem arbitrary, this is for you.\r\n\r\nWARNING: CHOKING HAZARD – Small Parts. Not For Children Under 4 Years.", "Title": "Git For Ages 4 And Up", "URL": "http://linux.conf.au/schedule/30286/view_talk", "Event": 79, "Start": "2013-01-31 10:40:00", "Presenter_emails": "schwern@pobox.com", "Presenters": "Michael Schwern", "Duration": "1:40:00", "Id": 122, "Room Name": "MCC6"}, {"Description": "The Linux Foundation and its technical advisory board has a long history of working with UEFI (and indirectly Microsoft) to ensure that Secure Boot would function in a way that Linux Could take advantage of:\r\n\r\nhttp://www.linuxfoundation.org/publications/making-uefi-secure-boot-work-with-open-platforms\r\n\r\nIn particular, we foresaw the GPLv3 bootloader problem and crafted a solution whereby the user would always be able to take control of the platform and install their own secure boot keys (this solution is now mandated by Microsoft in their Windows 8 hardware certification requirements).\r\n\r\nThis talk will review the history, give the current state of play of secure boot on Linux (we know it works with Red Hat and Ubuntu, but what about all the other distributions) paying particular attention to what the four secure variable databases actually are, what they can contain and how they all\r\ninteract.\r\n\r\nFinally we will explain in detail how the end user can take full control of their platform, why this isn't as simple as simply throwing out Microsoft's key and installing your own and what all the technical requirements are to achieve full PC platform ownership (including installing trust signatures of bios rom drivers, creating additional EFI programmes for booting unsigned media and simply managing the secure variable databases).\r\n\r\n", "Title": "Making UEFI Secure boot work for you", "URL": "http://linux.conf.au/schedule/30115/view_talk", "Event": 95, "Start": "2013-01-31 11:35:00", "Presenter_emails": "jejb@hansenpartnership.com", "Presenters": "James Bottomley", "Duration": "0:45:00", "Id": 123, "Room Name": "MCC1"}, {"Description": "The Raspberry Pi is a low-cost single board computer, created with the aim of supporting and promoting the teaching of computer science. One million units are projected to have shipped by the end of the year. I will detail the history of this charitable project before looking at progress to date and challenges for the future. The project has had great success at building and growing its development community, and we now have a community developed rebuild of Debian for armv6 with the hard floating point ABI (Raspbian). How is it we are able to attract so much interest?\r\n\r\nI will discuss the various software challenges the Foundation and its volunteer developers have faced. These include working with proprietary graphics drivers, assembling a patch set suitable for mainline inclusion and accelerating common graphics toolkits. Finally I'll take a look at the weird, wacky and wonderful projects the community have come up with so far.", "Title": "The Raspberry Pi and Linux", "URL": "http://linux.conf.au/schedule/30232/view_talk", "Event": 70, "Start": "2013-01-31 11:35:00", "Presenter_emails": "asb@asbradbury.org", "Presenters": "Alex Bradbury", "Duration": "0:45:00", "Id": 124, "Room Name": "MCC2"}, {"Description": "As the Linux kernel continues to gain features which permit it to operate with lower scheduling latencies, it is becoming increasingly feasible to utilise systems running stock kernels for high speed data acquisition in applications such as radar.  This makes such applications much more accessible to both developers and end users.  However, having low scheduling latency is not enough to ensure smooth operation of the system.  The acquisition software itself must also be carefully designed to ensure it can keep up with the data as it arrives and distribute it to analysis processes.\r\n\r\nAfter briefly describing the needs of a radar system, this talk will outline the various programming approaches and techniques utilised in the implementation of a radar data acquisition system and explore the reasons behind the choices made.  The presentation will be aimed at developers who have not necessarily worked with data acquisition before.", "Title": "The anatomy of a high speed data acquisition system", "URL": "http://linux.conf.au/schedule/30300/view_talk", "Event": 47, "Start": "2013-01-31 11:35:00", "Presenter_emails": "jwoithe@atrad.com.au", "Presenters": "Jonathan Woithe", "Duration": "0:45:00", "Id": 125, "Room Name": "MCC3"}, {"Description": "In 1911, only 4% of our population was aged 65 years or older. In 2011, this increased to a whopping 14% - that's over 3 million people! Until someone invents a way to stop aging, we need to face facts. We're getting older...and this brings about a host of problems when interacting with a website or product (small font anyone?).\r\n\r\nJoin us for a (occasionally light-hearted) primer on creating inclusive user experiences (UX). In this session, we'll take a look at what happens when you age, how it impacts your use of software and the web, and tips for including accessibility into your designs so that it benefits every one of varying levels of abilities. Oh, and the best thing? These tips also benefit you when you get older.\r\n", "Title": "Getting older? Tips & tricks for designing inclusive open source user interfaces", "URL": "http://linux.conf.au/schedule/30283/view_talk", "Event": 51, "Start": "2013-01-31 11:35:00", "Presenter_emails": "ruthe@stamfordinteractive.com.au", "Presenters": "Ruth Ellison", "Duration": "0:45:00", "Id": 126, "Room Name": "MCC4"}, {"Description": "Puppet is an immensely powerful tool for system administration, but with great power comes great responsibility, and it’s not always obvious how to structure your configurations.  There are many different ways to accomplish similar goals, and this malleability has given rise to a plethora of different design and architecture principles - some of which are good, and many of which are bad.\r\n\r\nIn this talk, Ben and Dan will explain the guiding principles of responsible Puppet design and architecture, walking you through real-world examples in order to illustrate solid methodological approaches, and illuminate Puppet administrators of all skill levels.  As an added bonus, we will also show you how Puppet can be integrated into automated deployment and continuous integration platforms - an increasingly important component of today’s development and operational landscape.\r\n\r\nThis talk will include such topics as:\r\n\r\n  - The separation of data and logic: How not to commit such Puppet sins as hardcoding credentials, paths, and other sensitive variables into your modules.\r\n  - External data sources: There are a variety of ways to interface Puppet with other data sources, including Heira, puppet-db, extlookup, dilly, and more.\r\n  - The tiered manifest approach: Leveraging different granularity levels for fine-grained control.\r\n  - Module-writing best practices: Why it’s important for modules to be as generic as possible, and how to deal with differing environments and edge cases.\r\n  - Explicit sanity preservation: Verifying the validity of the incoming values.\r\n  - The importance of useful log output: Puppet has mature logging facilities built-in.  Use them to get useful output in your dashboard, in email digests, and running manually triggered Puppet runs.\r\n  - Recommended (and enforced) style guides: Machine-readable manifests are good, but human-readable manifests are better.\r\n  - A comparison of visualisation tools: Everybody loves charts and graphs.  Dashboards, reports aggregators, and automated metrics for the pointy-haired boss in your life.", "Title": "How to use Puppet like an Adult", "URL": "http://linux.conf.au/schedule/30149/view_talk", "Event": 65, "Start": "2013-01-31 11:35:00", "Presenter_emails": "bkero@mozilla.com,dmaher@mozilla.com", "Presenters": "Ben Kero,Daniel Maher", "Duration": "0:45:00", "Id": 127, "Room Name": "MCC5"}, {"Description": "The ArduSat project will launch at least one and possibly two cubesats into orbit in mid 2013, carrying a payload combining an extensive sensor suite and cameras with a multi-node processor platform based on Arduino. Once in orbit the satellite will be accessible to students, space enthusiasts, and others who will be able to upload their own data collection and processing experiments to the platform, or control the cameras to take pictures from space. The project has received significant funding via Kickstarter and support from corporate sponsors including Australian Open Hardware company Freetronics.\r\n\r\nThe payload operational software and the hardware design is all Open Source, with collaborators around the world working together on the design. The final hardware design and validation is all being performed in Australia, and various test flights including High Altitude Balloon launches will also take place in Australia.\r\n\r\nThe design of the payload is an interesting exercise in low-level system architecture, with multiple microcontroller nodes requiring pseudo-independent access to the shared sensor suite. An objective of the design is to allow experiments to be prototyped quickly and cheaply on the ground using standard Arduino-based hardware, so maintaining software compatibility with regular Arduino boards and sensors while still meeting flight requirements is a high priority.\r\n\r\nThis talk will provide an overview of the ArduSat project and what it hopes to achieve, the system architecture of the payload, and demonstration of a late-stage payload prototype.", "Title": "ArduSat: Open Source in orbit", "URL": "http://linux.conf.au/schedule/30238/view_talk", "Event": 33, "Start": "2013-01-31 13:20:00", "Presenter_emails": "jon@oxer.com.au", "Presenters": "Jonathan Oxer", "Duration": "0:45:00", "Id": 129, "Room Name": "MCC1"}, {"Description": "Chrome OS is a Linux-based operating system developed by Google that aims to provide a fast, simple, and secure environment for the web.\r\n\r\nOne of the main goals of the project is security, and in order to provide a secure environment we developed a firmware and kernel solution called Verified Boot that strives to ensure all executed code is known to be safe from the moment the system is powered on.\r\n\r\nAnother goal of ours is pushing open source wherever possible.  So for our second generation of Chrome OS devices we created a firmware stack based on the open source projects Coreboot and U-boot, paired with our own Verified Boot.\r\n\r\nThis presentation will discuss our new firmware stack and the reasons behind it, provide detail on what effort was required to support Intel's Sandybridge/Ivybridge architecture in Coreboot, and discuss what portions of the firmware are not yet open and why.\r\n\r\nIt will also provide detail on our open source Embedded Controller firmware and why that is another important piece of our approach to security and our commitment to open source.", "Title": "Open Source Firmware", "URL": "http://linux.conf.au/schedule/30310/view_talk", "Event": 106, "Start": "2013-01-31 13:20:00", "Presenter_emails": "dlaurie@google.com", "Presenters": "Duncan Laurie", "Duration": "0:45:00", "Id": 130, "Room Name": "MCC2"}, {"Description": "OpenStack Swift is a large-scale distributed object storage system designed for a wide range of use cases. In part 1 of this talk, we will discuss the importance of data sovereingty and how OpenStack enables it. Part 2 will be an in-depth look at several swift requests and how swift handles and recovers from different failure scenarios.", "Title": "Playing with OpenStack Swift", "URL": "http://linux.conf.au/schedule/30070/view_talk", "Event": 48, "Start": "2013-01-31 13:20:00", "Presenter_emails": "me@not.mn", "Presenters": "John Dickinson", "Duration": "0:45:00", "Id": 131, "Room Name": "MCC3"}, {"Description": "", "Title": "Blocked for room setup", "Event": 237, "Start": "2013-01-31 13:20:00", "Duration": "0:45:00", "Id": 132, "Room Name": "MCC4"}, {"Description": "RAM is \"cheap\". Or is it? If a million machine data center could cut RAM in half, how much could be saved, in capital equipment cost and power/cooling expense? Transcendent Memory (or \"tmem\") is a new approach for flexibly, dynamically, and efficiently managing physical memory. First conceived to facilitate the optimization of physical memory utilization among a set of guests in a virtualization environment (and implemented in Xen 4.0), tmem has now also been applied in the kernel to dynamically compress page cache and swap pages (\"zcache\"), and to dynamically hot-plug memory among a set of kernels (\"RAMster\").  And tmem may, in the future, allow more effective utilization of future memory-extension technologies. All this with very minimal changes to the kernel required. We will describe why RAM is no longer cheap, explain the basics of Transcendent Memory including the kernel changes, and show how tmem can provide unprecedented flexibility toward optimizing RAM utilization in future data centers.", "Title": "Transcendent Memory: Not Just for Virtualization Anymore!", "URL": "http://linux.conf.au/schedule/30062/view_talk", "Event": 46, "Start": "2013-01-31 13:20:00", "Presenter_emails": "avi.miller@gmail.com", "Presenters": "Avi Miller", "Duration": "0:45:00", "Id": 133, "Room Name": "MCC5"}, {"Description": "It would be wonderful if servers and programs would just work and never break. Until that magical day, though, we need to be prepared. Whether you are a junior sysadmin new to the trade or an engineer at a startup who also has to run servers, this tutorial has something for you.\r\n\r\nWe will be covering the basics of gathering information about a server, what it's doing, and how to do seat-of-the-pants estimates on performance. We will discuss and analyze servers misbehaving in typical ways as well as get some ideas on useful ways to think about debugging a server.\r\n\r\nFrom there we will do some exercises in spotting problems and debugging running processes. We will also explore side-channel analysis as a tool for intuiting what a process is doing. Typical failure patterns will be discussed and analyzed, and you will have a chance to do some hands-on debugging.\r\n\r\nRequirements: a laptop, an SSH client, and a basic knowledge of Linux and how to use a shell (bash/zsh).", "Title": "Systems Administration: Server and Process Behavior", "URL": "http://linux.conf.au/schedule/30277/view_talk", "Event": 77, "Start": "2013-01-31 13:20:00", "Presenter_emails": "mark@dreamwidth.org", "Presenters": "Mark Smith", "Duration": "1:40:00", "Id": 134, "Room Name": "MCC6"}, {"Description": "Small transparent serial telemetry radios are a core part of many projects, and play a key role in amateur UAV systems. Unfortunately popular telemetry radios, such as the widely Xbee line of radios, provide poor range and the lack of source code for the radio firmware makes protocol improvements difficult.\r\n\r\nThis first half of this talk will describe a project to build a telemetry radio system with an open firmware, and hardware that supports much longer ranges than comparibly priced existing systems. The open firmware includes features like frequency hopping, time division multiplexing and support for a wide range of regulatory additions such as listen before talk.\r\n\r\nOnce you have a good long range telemetry system you need some higher level protocols to run over it. The second half of this talk will focus on the problems of reliable transmission over the telemetry link, looking at why TCP performs poorly in the face of large amounts of packet loss. An anternative block oriented transport, implemented in Python on Linux, is discussed which provides much better performance for reliable transmission of image and command data over the telemetry link.\r\n", "Title": "Building a free software telemetry radio system", "URL": "http://linux.conf.au/schedule/30080/view_talk", "Event": 50, "Start": "2013-01-31 14:15:00", "Presenter_emails": "andrew@tridgell.net", "Presenters": "Andrew Tridgell", "Duration": "0:45:00", "Id": 135, "Room Name": "MCC1"}, {"Description": "Five years ago, I published a Linux Journal article entitled \"SMP and Embedded Real Time\" (http://www.linuxjournal.com/article/9361) stating that SMP systems could in fact support real-time workloads.  This article was not well-received in all segments of the real-time community, but there are nevertheless quite a few SMP real-time systems in use today offering scheduling latencies of a few tens of microseconds.\r\n\r\nSo perhaps you can imagine my surprise when in early 2012 I received a bug report stating that the Linux kernel's RCU implementation was causing 200-microsecond latency spikes.  The root cause? I simply hadn't been thinking big enough.  This talk tells the story of the ensuing adventure.", "Title": "Real-Time Response on Multicore Systems: It Is Bigger Than I Thought", "URL": "http://linux.conf.au/schedule/30201/view_talk", "Event": 61, "Start": "2013-01-31 14:15:00", "Presenter_emails": "paulmckrcu@gmail.com", "Presenters": "Paul McKenney", "Duration": "0:45:00", "Id": 136, "Room Name": "MCC2"}, {"Description": "As the size and performance requirements of storage systems have increased, file system designers have looked to new architectures to facilitate system scalability. Ceph is a fully open source distributed object store, network block device, and file system designed for reliability, performance, and scalability from terabytes to exabytes.\r\n\r\nFault tolerance is a key challenge for both system design and operations. Ceph is designed to be both highly available and elastic.  In large clusters, disk, host, and even network failures are the norm rather than the exception, hardware is heterogeneous and incrementally deployed or de-provisioned, and availability must be continuous. This talk will describe the Ceph architecture and the impact that has on system operations, including failure management, monitoring, and provisioning.", "Title": "Ceph: Managing A Distributed Storage System At Scale", "URL": "http://linux.conf.au/schedule/30156/view_talk", "Event": 62, "Start": "2013-01-31 14:15:00", "Presenter_emails": "sage@inktank.com", "Presenters": "Sage Weil", "Duration": "0:45:00", "Id": 137, "Room Name": "MCC3"}, {"Description": "Excess buffering on the Internet leads to delays, slow downs and complaints. This presentation is a light hearted exploration of buffering demonstrated by (ab)using the analogy of Internet and plumbing. ", "Title": "Bufferbloat from a Plumber's point of view", "URL": "http://linux.conf.au/schedule/30118/view_talk", "Event": 56, "Start": "2013-01-31 14:15:00", "Presenter_emails": "stephen.hemminger@gmail.com", "Presenters": "Stephen Hemminger", "Duration": "0:45:00", "Id": 138, "Room Name": "MCC4"}, {"Description": "Our platform, built in the same spirit as Arduino, will enable a whole range of new Internet-enabled hardware projects by combining ARM and FPGA in an affordable package running Linux. We look forward to sharing our technical and business experience building an OpenHardware/OpenSource startup in mainland China.", "Title": "A New Linux Platform, Hardware and Software", "URL": "http://linux.conf.au/schedule/30246/view_talk", "Event": 72, "Start": "2013-01-31 14:15:00", "Presenter_emails": "rngadam@lophilo.com", "Presenters": "Ricky Ng-Adam", "Duration": "0:45:00", "Id": 139, "Room Name": "MCC5"}, {"Description": "You already know that git tracks source code, and odds are you've contributed to at least one project that uses it.  But did you know that git can track arbitrary data, too?  This talk will show you how to use git as a database for arbitrary purposes, and demonstrate Git's strengths and weaknesses compared to other data stores.\r\n\r\nFind out how to use libgit2 to poke at a Git repository from C or your language of choice, and learn why you might want to use it in your next project.  Explore the details of the Git object store, and how your data can map into it efficiently.  Take advantage of git's delta compression and network protocol to construct a distributed application.  Hear about novel applications of git repositories today, and plan for the awesome git hack you'll invent tomorrow.\r\n\r\nAs a demonstration, I'll show how I integrated Git into a build system, to track all the dependencies of a project and how they fit together.", "Title": "Git: not just for source code anymore", "URL": "http://linux.conf.au/schedule/30322/view_talk", "Event": 109, "Start": "2013-01-31 15:40:00", "Presenter_emails": "josh@joshtriplett.org", "Presenters": "Josh Triplett", "Duration": "0:45:00", "Id": 141, "Room Name": "MCC1"}, {"Description": "Embedded computing offers a direct exposure to low-level hardware unavailable with modern desktop computers. As such, it provides a far more concrete computing experience for young developers. The ability to directly experience the effects of programmatic changes offers a broader sensory environment than graphics on the screen. The value of this can be seen by the broad appeal of a variety of robotics classes and competetions for students.\r\n\r\nConsructing robots from \"real\" materials is of undeniable educational value. However, the time, energy and expense of constructing the robots creates some significant constraints on how such classes can be run. The obvious alternative is to use a construction kit, such as Legos. The Lego company sells complete microcontroller systems, but those microcontrollers are buried behind a wall of sophisticated and shiny user interface.\r\n\r\nI've been teaching a class to 10-12 year old students which takes advantage of the rapid construction and modification offered by Lego pieces but replaces the Lego microcontroller with a standard Arduino board. The result has been hugely successful, with students building a variety of robots and programming them in a series of 6 classes, each 90 minutes in length.\r\n\r\nThis presentation will first motivate the course style, contrasting it with other similar environments like Lego Robotics and Squeak/Etoys. Then, I'll show how the Arduino boards work in the Lego environment, highlight some of the classroom materials and then demonstrate the students creations.\r\n", "Title": "Teaching Robotics and Embedded Computing with Legos and Arduino", "URL": "http://linux.conf.au/schedule/30177/view_talk", "Event": 66, "Start": "2013-01-31 15:40:00", "Presenter_emails": "keithp@keithp.com", "Presenters": "Keith Packard", "Duration": "0:45:00", "Id": 142, "Room Name": "MCC2"}, {"Description": "At the NCI National Facility at ANU we exclusively use Linux for supercomputing. This talk covers how we use and alter (and hopefully help to improve) Linux and other Open Source projects to create a fast and stable petascale machine.\r\n\r\nOverview:\r\n - How we boot and run clusters at large scale using oneSIS, CentOS, root on Lustre, ...\r\n - How we tweak the kernel and tune the OS to keep them stable and efficient\r\n - Problems we've seen and areas we'd like to see improved\r\n\r\nOur current supercomputer is 12k Nehalem cores with a 20GB/s filesystem and QDR InfinBand. The next machine (hopefully operational by LCA time) is 60k Sandy Bridge cores with a 100GB/s filesystem and FDR InfiniBand. Each of our new clusters is usually in the top 50 machines in the world.\r\n\r\noneSIS and the Lustre filesystem together with CentOS running vanilla and modified RHEL6 kernels are the primary components of our software stack. Uniquely the OS's for all 3600 nodes boot from a single copy of the OS that resides on the global Lustre filesystem. This gives us an easily updatable OS and guarantees all compute nodes are booting identical software.\r\n\r\nHigh performance and predictability is a key focus. The main player in this game is numa awareness. We use cpusets extensively and enforce processor and memory binding to obtain ideal numa alignment and optimal and reproducible job performance. We have worked with the OpenMPI project to get binding included, and our users run jobs with binding on by default.\r\n\r\nWe are increasingly using cgroups and eventually may use all of cputime, freeze/thaw, acl, namespaces, and memcg - all tasks which our own resource manager software currently handles. We also have a history and interest in page migration which may again become useful to reduce machine fragmentation as each numa zone gets more cores.\r\n\r\nLike many HPC sites we write our own job and cluster monitoring tools and these are available for other sites to use and modify, as are our changes to kernels and some InfiniBand tools. Unlike many sites we also write our own batch system.\r\n\r\nI'll talk about our Linux improvement wishlist too - eg. Lustre integration into mainline so we can update kernels more aggressively and get shiny new stability. inode/dentry reclaim of deleted inodes with vfs_cache_pressure=0. Low overhead control groups. Better transparent huge pages. Improved virtual memory stability. md is awesome but zfs-on-linux might be better. OFED integration with mainline.", "Title": "1.5MW and 3600 penguins in a room: Supercomputing at ANU", "URL": "http://linux.conf.au/schedule/30284/view_talk", "Event": 103, "Start": "2013-01-31 15:40:00", "Presenter_emails": "robin.humble+lca@anu.edu.au", "Presenters": "robin humble", "Duration": "0:45:00", "Id": 143, "Room Name": "MCC3"}, {"Description": "Linux supports the feature of \"hotplugging\" CPUs in the system, a term used to denote the ability to logically online or offline processors on the fly (i.e., on a running system). This feature is provided by the CPU hotplug infrastructure in the Linux kernel.\r\n\r\nCPU hotplug has now come to have many more usecases than what it was originally designed for. Some of the important ones are RAS (to offline malfunctioning CPUs on a running system), power management (to hotplug CPUs based on the load/utilization for aggressive power savings), RT (for isolation of RT workloads), Suspend/Resume (uses CPU hotplug during both suspend and resume), SMP booting, dynamic partition resizing on powerpc/s390 architectures etc.\r\n\r\nThe current design and implementation of CPU hotplug in Linux has encountered some significant challenges owing to the newer and wider usecases which were not foreseen earlier. Some of them are: less-than-expected performance in several new usecases, race conditions and deadlock possiblities in new scenarios, unacceptable latency for RT workloads and so on. Also, the CPU hotplug design and code has slowly developed into a convoluted mess, making it hard to maintain and improve. This has become a significant problem as highlighted by the fact that it has hindered progress on several occasions [1][2].\r\n\r\nTo summarize, there is a need to redesign CPU hotplug for both elegance and efficiency, which can help us reap benefits such as fast booting, faster suspend/resume, and more efficient power management. This talk will present an overview of the current usecases and challenges with CPU hotplug and discuss some of the new designs being explored in the community for improving the CPU hotplug framework.\r\n\r\n----\r\n[1]. There is a lot of CPU hotplug related code duplication in almost all architectures that support SMP, and worse, these implemenations have plenty of bugs. This caused boot failures on several architectures when a simple change was made to how the scheduler dealt with CPU hotplug.\r\n\r\n[2]. Recently, a patch was posted in the community to speed-up booting by trying to boot CPUs asynchronously with the rest of the kernel initialization. This caused boot failures on some architectures because the CPU hotplug code was simply not ready for handling such a scenario.", "Title": "Rethinking CPU hotplug for elegance and efficiency", "URL": "http://linux.conf.au/schedule/30202/view_talk", "Event": 68, "Start": "2013-01-31 15:40:00", "Presenter_emails": "srivatsa.bhat@linux.vnet.ibm.com", "Presenters": "Srivatsa Bhat", "Duration": "0:45:00", "Id": 144, "Room Name": "MCC4"}, {"Description": "Software Transactional Memory is an alternative to traditional Posix locks, and is now available in your favorite compiler!  gcc-4.7 has STM support, so you can do clever things like:\r\n__transaction { insert_node(foo); } \r\nThis talk will cover what STM is, how you can use it, some good and bad points, and dig under the covers to show how it is implemented, and how you can hack the implementation if you feel so inclined.", "Title": "Software Transactional Memory in GCC 4.7", "URL": "http://linux.conf.au/schedule/30010/view_talk", "Event": 87, "Start": "2013-01-31 15:40:00", "Presenter_emails": "boutcher@cs.umn.edu", "Presenters": "Dave Boutcher", "Duration": "0:45:00", "Id": 145, "Room Name": "MCC5"}, {"Description": "Throughout history there have been several major shifts in society, shifts that disrupted and reinvented traditional power structures, commerce, communities and the lives of individuals. In the last 20 years we have seen the massive distribution of almost every traditional bastion of power: publishing, communications, monitoring and force. In the next 10 years we will see the massive distribution of property (and food) with 3D printing coming into it's own and the advancement of nanotechnology. Things have been changing at an accelerating pace and it is a good time to ask where we are going.\r\n\r\nThe Internet is almost by definition a privately owned space. Everything we do online is through the prism of multiple contracts, with ISPs and online services. There has been a lot of movement by governments and companies alike to try to define and limit the Internet in their favour, and it is important that we move the debate beyond \"open vs closed\" and towards a clearer definition of the technical and social characteristics shouldn't be meddled with if we want to maintain maximum freedom for all people, not just geeks.\r\n\r\nGovernments around the world, and the systems they support are defined and bound by jurisdictions based on geography, which is not sufficient for representing our online lives. And we are seeing a movement from governments around the world try to deal with the Internet in a jurisdictional way which in counterproductive to how the Internet operates.\r\n\r\nThe Distributed Democracy is a project to play with the idea of a model of open, representative body for our online lives. Not just another lobby group, but a transnational \"government\".\r\n\r\nDetails of the http://distributeddemocracy.wikispaces.com & http://society5.net", "Title": "Geeks rule over kings - the Distributed Democracy", "URL": "http://linux.conf.au/schedule/30313/view_talk", "Event": 107, "Start": "2013-01-31 15:40:00", "Presenter_emails": "pia.waugh@gmail.com", "Presenters": "Pia Waugh", "Duration": "0:45:00", "Id": 146, "Room Name": "MCC6"}, {"Description": "SINNERS!! HEAR ME!! For too long have you lain contented and SLOTHFUL in the illusion that time is infinite! SOON the UNIX EPOCH will END and numbers will OVERFLOW their confines CLEANSING all in a flood the likes we have not seen since 1901!!! The SINS of your 32 BITS will chase your children and your children's children unless you REPENT NOW and cleanse your code of the 2038 BUG!!\r\n\r\nCalendaring is hard. Calendaring is very hard. Its also a little crazy. OK, its a lot of crazy. Fortunately there’s a small band of equally crazy people who make it all work so you don’t have to know anything about the crazy.\r\n\r\nWe’re going to look at some of that crazy, reveal the madness.\r\n\r\nWe’ll see that computers suck at math.\r\n\r\nWe’ll discover that there are time zones on Mars.\r\n\r\nWe’ll look at the 2038 bug, why you care about it now in 2013, why your fancy 64 bit laptop won't save you, and how to protect yourself against it.\r\n\r\nWe'll examine a solution to the 2038 bug that works on 32 bit machines and is in production right beneath your noses, a 2038 clean reimplementation of time.h!", "Title": "REPENT!!! FOR THE END OF THE UNIX EPOCH IS NIGH!!!", "URL": "http://linux.conf.au/schedule/30148/view_talk", "Event": 93, "Start": "2013-01-31 16:35:00", "Presenter_emails": "schwern@pobox.com", "Presenters": "Michael Schwern", "Duration": "0:45:00", "Id": 147, "Room Name": "MCC1"}, {"Description": "So you've started playing with this cool thing called \"Arduino\". You're having fun with buttons and LEDs and have started making some real projects that use them.\r\n\r\nBut then you realise a few limitations: they can be bulky, they're a little expensive, they don't have quite enough flash, they have too many I/O pins, or maybe they're just entirely too easy to use and you want some new challenges. What do you do?\r\n\r\nYou attend this presentation! :)\r\n\r\nThis presentation is neatly divided in half; the first (Hardware) half talks about:\r\n* What Arduino hardware really is\r\n* What makes up an Arduino system\r\n* In-Circuit System Programmers (ie., that six-pin header you\r\nbasically never use).\r\n* What similar hardware exists\r\n* How YOU can make a cheaper and simpler platform for yourself\r\n* Your ATmega chip's little brother, the ATtiny...\r\n\r\nThe second half focuses on the Arduino software:\r\n* What the Arduino software brings you\r\n* How the Arduino software limits you\r\n* Using make & avr-gcc to build software for AT{mega,tiny} chips\r\n* Accessing the registers that control the processor directly\r\n* How software really uses the hardware interrupts\r\n* Getting more than two interrupts\r\n* Using the on-board timers to hand-bake PWM and other things\r\n* Faster I/O\r\n* Shrinking your application\r\n\r\nIf you ever PEEKed and POKEd with a C64, and are now fiddling with Arduinos - this is the talk for you.\r\n", "Title": "After Arduino", "URL": "http://linux.conf.au/schedule/30037/view_talk", "Event": 67, "Start": "2013-01-31 16:35:00", "Presenter_emails": "mibus@mibus.org", "Presenters": "Robert Mibus", "Duration": "0:45:00", "Id": 148, "Room Name": "MCC2"}, {"Description": "After nine years, the GTK+ project recently released the new 3.0 major version, in time for GNOME 3.0; this new major version brought an API break to clean the cruft from the platform, as well as include new and exciting features, like CSS support for styling widgets and support for touch-based input devices.\r\n\r\nWhile work is under way to stabilise the toolkit, there is also an effort to review the foundations upon which the toolkit itself is built: a new, canvas-like approach to UI building; GL-based rendering; an animation framework (to be exposed through CSS3 transitions and animations); multi-touch gesture support.\r\n\r\nIn the meantime, Clutter prepares itself to bump its major version to 2.0, bringing to the table a better, leaner, API that tackles the lessons learned in the last 6 years, as well as what other platforms like CoreAnimation, Qt, and HTML provide.\r\n\r\nOn paper, GTK+ 4.0 and Clutter 2.0 seem like an inevitability.\r\n\r\nIn this talk I will try to answer the questions of where we are; what we want to achieve; and how do we get there — as well as how you can help out, whether you are interested in application developement or toolkit development.", "Title": "Ponies and Rainbows: Clutter 2.0 and GTK+ 4.0", "URL": "http://linux.conf.au/schedule/30067/view_talk", "Event": 91, "Start": "2013-01-31 16:35:00", "Presenter_emails": "ebassi@gmail.com", "Presenters": "Emmanuele Bassi", "Duration": "0:45:00", "Id": 149, "Room Name": "MCC3"}, {"Description": "Endian bugs are a common source of problems, mostly on big endian architectures such as PowerPC, sparc or s390. Getting endian'ness right isn't always trivial and some programming tricks will work on one endianness and not another.\r\n\r\nI will first show endian issues related to programs trying to access in memory data using the wrong size types. Then I will talk about the the problem of data \"on the wire\" (networking, storage, file\r\nformats) along with tools such as sparse that can help getting it right, and will then dive into IO busses and peripheral such as PCI and graphics.\r\n\r\nI will attempt to shed some light on the latter by describing what happens under the hood, the representation of data on typical processor bus and how it interconnects to a typical IO bus, where does swapping happens and when it needs to be handled in software.", "Title": "Big and Little Endian inside / out", "URL": "http://linux.conf.au/schedule/30056/view_talk", "Event": 45, "Start": "2013-01-31 16:35:00", "Presenter_emails": "benh@kernel.crashing.org", "Presenters": "Benjamin Herrenschmidt", "Duration": "0:45:00", "Id": 150, "Room Name": "MCC4"}, {"Description": "We are often presented with a conundrum when choosing an implementation language: should we choose a language with dynamic typing, or with static typing?\r\n\r\nOn the one hand, dynamically typed languages like Python, Erlang, or JavaScript provide us with the flexibility of duck-typing; a perception of faster coding, refactoring, a shallower learning curve, and the potential for post-hoc testing due to a programmer’s ability to be arbitrarily invasive of the structures used in the language.\r\n\r\nOn the other hand, statically typed languages like Haskell, Java, or C# hold out the promise of early elimination of whole classes of errors via type-checking, as well as type-based tools to assist in various implementation tasks like refactoring, codebase navigation, memory analysis, and debugging.\r\n\r\nFurthermore, there is a perception that APIs are more clearly specified when type-defined and type-restricted, as the type information provides a form of self documenting code.\r\n\r\nWhat if we could have both?\r\n\r\nThis talk will introduce an approach that allows the run-time specification and testing of types in dynamic languages, as well as a JavaScript implementation of this approach called “Ristretto.js”. The approach supports such diverse type features as structural type specification and comparison, higher-order functions, extensible object typing, function currying, algebraic data types, and dependent data types (this talk will also explain what all of those mean).\r\n\r\nUsing a library like Ristretto.js, developers can use the dynamic language of their choice, but still benefit from the advantages of a strongly specified type system by using type annotations when needed. Type annotations are directly interoperable with untyped code, such that adopting types in one part of an implementation does not require sweeping changes to the rest of the implementation. Because the approach is implementable entirely within the target language, special supporting infrastructure and pre-compilation steps are not required.\r\n\r\nAcknowledgements: This talk builds on the impressive theoretical work of Phil Wadler. Much of Ristretto.js was implemented by Samuel Li during an internship at Google.\r\n\r\nTalk Structure\r\n\r\nThis talk will first present the relative advantages and disadvantages of dynamic and static typing, providing and discussing specific examples of tasks that are easy or hard in each case. It will then introduce and demo Ristretto.js, showing off both basic and advanced features, highlighting how many of the advantages of static type systems can be achieved using Ristretto. Finally, I will discuss the internals of Ristretto.js and show how the techniques used can be applied to other programming environments.", "Title": "Ristretto: run-time types for JavaScript", "URL": "http://linux.conf.au/schedule/30071/view_talk", "Event": 90, "Start": "2013-01-31 16:35:00", "Presenter_emails": "shane.stephens@gmail.com", "Presenters": "Shane Stephens", "Duration": "0:45:00", "Id": 151, "Room Name": "MCC5"}, {"Description": "10 years ago, the \"md\" Software RAID driver in the Linux kernel was\r\nable to provide mirrored redundancy and stripe/parity redundancy which\r\nare the core features of RAID.  A decade later, md it still be\r\ndeveloped with new features.  Why is that?\r\n\r\nThis talk will explore the various demands made of md by an ever-changing\r\nhardware landscape and ever-changing customer expectations.  It will\r\nparticularly look at error handling, restriping, bad-block management,\r\nand the particular requirements of \"flash\"-based storage devices.\r\n", "Title": "RAID is more than parity and mirrors", "URL": "http://linux.conf.au/schedule/30054/view_talk", "Event": 124, "Start": "2013-01-31 16:35:00", "Presenter_emails": "neilb@suse.de", "Presenters": "Neil Brown", "Duration": "0:45:00", "Id": 152, "Room Name": "MCC6"}, {"Description": "Valve Software has recently committed to bringing Steam to Linux.  The Intel open source graphics driver team has been given access to their source code and was invited up to their office to work with them directly in tuning their apps for Mesa and tuning Mesa for their apps.\r\n\r\nThis talk will cover our work in making mainstream gaming on Linux possible, and the sometimes surprising reactions of a major software developer using open source graphics drivers.\r\n", "Title": "Linux Gaming at Last!  Tuning Open Source Graphics Drivers for Valve Software", "URL": "http://linux.conf.au/schedule/30261/view_talk", "Event": 105, "Start": "2013-02-01 10:40:00", "Presenter_emails": "eric@anholt.net", "Presenters": "Eric Anholt", "Duration": "0:45:00", "Id": 153, "Room Name": "MCC1"}, {"Description": "X version 11 has been with us for 25 years. Over those 25 years, it\r\nhas managed to remain relevant by incorporating new technologies while\r\nretaining compatibility for existing applications. Version 1.13 of the\r\nX server incorporates new extensions required to bring support for\r\nmodern input and output devices to applications, and Linux desktop\r\napplications have already started to support them.\r\n\r\n1.13 stuff:\r\n\r\n *) Multi-touch touch-pad support\r\n *) Multi-touch touch-screen support\r\n *) Hot-plug display devices\r\n *) GPU off-load?\r\n\r\nFuture stuff:\r\n\r\n *) Atomic mode setting\r\n *) Integrated compositing manager\r\n *) Per-CRTC pixmaps\r\n *) SetWindowPixmap extension\r\n\r\nThis presentation will describe these ongoing and anticipated changes\r\ncoming to X that will preserve our legacy application base while also\r\ncontinuing to stretch the bounds of the Linux desktop.\r\n", "Title": "Future directions for the X Window System", "URL": "http://linux.conf.au/schedule/30176/view_talk", "Event": 172, "Start": "2013-02-01 10:40:00", "Presenter_emails": "keithp@keithp.com", "Presenters": "Keith Packard", "Duration": "0:45:00", "Id": 154, "Room Name": "MCC2"}, {"Description": "Storing big data in git is an appealing idea -- until you actually try to do it. This talk will discuss the problems of using git this way, and how git-annex solves them, as well as adding other features, like storing a git repository's data encrypted, in the cloud. \r\n\r\nI'll tell the story of how being stuck behind a dialup modem in 2010, and wanting an excuse to write my first Haskell program, led to being funded on Kickstarter in 2012 to continue developing it into something that approaches or exceeds the capabilities of DropBox.", "Title": "git-annex", "URL": "http://linux.conf.au/schedule/30059/view_talk", "Event": 31, "Start": "2013-02-01 10:40:00", "Presenter_emails": "joeyh@debian.org", "Presenters": "Joey Hess", "Duration": "0:45:00", "Id": 155, "Room Name": "MCC3"}, {"Description": "Typical cloud deployments - be it Openstack, Eucalyptus etc - have a separate control layer installed and upgraded using separate tools (which might be hand-configured PXE + preseeding, Cobbler, Orchestra/MAAS, FAI etc). As a result you have two distinct provisioning systems in play, which allows for more user error and increased special cases in automation.\r\n\r\nUsing Openstack’s bare-metal hypervisor, my team are building a fully self contained cloud, where the control layer for the cloud is itself deployed and upgraded via the same cloud API.\r\n\r\nCome hear me talk about the challenges involved in bootstrapping and operating such an environment, the benefits it can bring and what you can do with it!", "Title": "Openstack on Openstack - a single management API for all your servers.", "URL": "http://linux.conf.au/schedule/30331/view_talk", "Event": 205, "Start": "2013-02-01 10:40:00", "Presenter_emails": "robertc@robertcollins.net", "Presenters": "Robert Collins", "Duration": "0:45:00", "Id": 156, "Room Name": "MCC4"}, {"Description": "There is no one magic solution to having MySQL As A Service work well, it's a lot of small moving parts and options that need to be set, monitored and configured. We may wish it was different, or look at other database technologies, but there is a lot of legacy code that talks to MySQL, with all it's idiosyncrasies - and we need to be able to support this code.\r\n\r\nIn this talk, we'll cover many of the problem areas and what you can do to avoid them. We'll cover stock Oracle MySQL, Percona Server and MariaDB. Where suited, Drizzle will also be discussed.\r\n\r\nA key focus area will be how to run MySQL As A Service. This makes sense even in smaller organisations, providing database services to various apps, not just in big cloud providers.\r\n\r\nSome areas we'll examine:\r\n- IOPs\r\nIOPS are eaten by database sytems for breakfast, MySQL is no exception. We'll look at a crash safe server with replication, how many fsync()s a single transaction causes (hint: greater than 1) and how that number can be reduced.\r\n\r\n- ENOSPC\r\nMySQL traditionally handles ENOSPC very, very poorly. We'll look at new features we've implemented to help avoid ENOSPC. This includes replication logs, UNDO logs and temporary files.\r\n\r\n- Flexibility in users/admin\r\nWe'll also cover ways to provide users with the root MySQL user while not giving them access to the underlying Virtual Machine - enabling a more standardized Database As A Service platform yet giving users a lot of flexibility in how they use their database.\r\n\r\n- Backup/restore/spawning slaves\r\nBackup and restore is also integral to a good database server, so we'll examine backup options that work for streaming directly into cloud storage rather than local disk.", "Title": "MySQL in the cloud, as a service", "URL": "http://linux.conf.au/schedule/30188/view_talk", "Event": 55, "Start": "2013-02-01 10:40:00", "Presenter_emails": "stewart@flamingspork.com", "Presenters": "Stewart Smith", "Duration": "0:45:00", "Id": 157, "Room Name": "MCC5"}, {"Description": "You know it's important for your web project to be accessible to people who use all kinds of assistive technology to access the internet. But all the guidelines for web accessibility you can find don't go much beyond \"make sure all your images have alt text\", and all the resources you can find treat \"accessibility\" as a synonym for \"making your site work in a screen reader\". You know there are other things you should be doing and other forms of assistive technology you should be accomodating, but all the best practices documents are a complicated morass of contradicting information (if you can find best practices documents at all.)\r\n\r\nHave no fear! This tutorial will guide you through the basics of improving web-based open source projects until they work with all kinds of assistive technologies -- and there are more assistive technologies out there than you might think. Together, we'll cover:\r\n\r\n* the wide range of assistive technology people use (including things most people wouldn't think of as assistive technology);\r\n\r\n* quick demonstrations of what the experience of using assistive technology is actually like (no more guessing about how screenreaders treat elements of a page or how voice recognition software allows for keyboardless navigation);\r\n\r\n* common myths about accessibility (and the truths behind the myths);\r\n\r\n* \"attractive nuisances\" (things people think are helping, but actually make the situation worse);\r\n\r\n* simple, concrete examples of changes you can make to your site -- right now!\r\n\r\nCode samples will be provided, along with basic exercises to reinforce the lessons, so please bring a laptop if you can. You won't leave as an accessibility guru, but you'll definitely leave with a toolkit full of ways you can move beyond alt text.", "Title": "Beyond Alt Text: What Every Project Should Know About Accessibility", "URL": "http://linux.conf.au/schedule/30271/view_talk", "Event": 113, "Start": "2013-02-01 10:40:00", "Presenter_emails": "denise@dreamwidth.org", "Presenters": "Denise Paolucci", "Duration": "1:40:00", "Id": 158, "Room Name": "MCC6"}, {"Description": "Free speech recognition engines like Sphinx are not hard-wired for any particular language and accent; they use statistical models tuned for the desired dialect. Unfortunately, there are not very many free models of non-American English, let alone other languages.\r\n\r\nThis talk follows the process of making acoustic and language models of New Zealand English.  It isn't exactly a complicated process, just a fiddly time-consuming one with a maze of pitfalls and shortcuts.  You can get a long way by piggybacking existing speech corpora and models, and the discovery and use of these is covered.\r\n\r\n", "Title": "Make your software understand your non-US accent", "URL": "http://linux.conf.au/schedule/30170/view_talk", "Event": 80, "Start": "2013-02-01 11:35:00", "Presenter_emails": "douglas@halo.gen.nz", "Presenters": "Douglas Bagnall", "Duration": "0:45:00", "Id": 159, "Room Name": "MCC1"}, {"Description": "The X server is a 20 year old code base, and has had less then stellar support for multiple GPU configuration throughout that time. Although the promise of wayland lies in the future, fixing up the X server to deal with modern hw was considered necessary.\r\n\r\nThis talk will discuss improvements to various pieces of the Linux graphics stack and the X server. Output device hotplug, secondary GPU rendering (optimus laptops), GPU switching and multi-GPU rendering will be addressed and what the current status of work in this area.\r\n\r\n", "Title": "Teaching the X server new tricks", "URL": "http://linux.conf.au/schedule/30044/view_talk", "Event": 127, "Start": "2013-02-01 11:35:00", "Presenter_emails": "airlied@gmail.com", "Presenters": "David Airlie", "Duration": "0:45:00", "Id": 160, "Room Name": "MCC2"}, {"Description": "This talk will introduce NovaProva, a new generation unit test framework for C programs.\r\n\r\nI wrote NovaProva because I was sick of writing unit tests using the venerable but clunky CUnit library.  CUnit looked easy when I started writing unit tests but I soon discovered it's limitations and ended up screaming in frustration.  Meanwhile over 18 months the Cyrus IMAP server project has gone from 0 unit tests to 461, of which 277 are written in C with CUnit.  So that's a big itch!\r\n\r\nNovaProva starts with the same basic xUnit paradigm for testing, but extends some concepts in new directions (for example, NovaProva organises tests into trees rather than xUnit's two-level \"suite and test\" approach).  Most importantly, NovaProva is designed using real world experience and modern technologies to make it much easier to write tests, and much easier to discover subtle bugs in the System Under Test, bugs that unit other test frameworks miss.  Ideally NovaProva should make testing C code as easy as possible.\r\n\r\nTo make writing tests easy, I had to do some things in NovaProva which were so hard they seemed impossible.  As a result NovaProva now does six things which I believe make it unique amongst C/C++ unit test frameworks:\r\n\r\n- NovaProva is a library which Valgrinds the program which calls it\r\n\r\n- NovaProva implements true reflection in C/C++ (not using magic macros)\r\n\r\n- NovaProva discovers test functions automatically, no configuration needed, just by test function name\r\n\r\n- NovaProva lets the test writer do fully dynamic function interception (mocking, in xUnit speak) at runtime and on a per-test basis (i.e. not using linker tricks)\r\n\r\n- NovaProva provides good reporting and isolation for the many ugly ways C code can fail: memory overruns, uninitialised variables, memory leaks, deadlocks and loops, SEGV, calling exit(), calling syslog().\r\n\r\n- NovaProva's project name is neither silly nor dangerous\r\n\r\nThe talk will cover some of the features of NovaProva, how to use NovaProva in your projects, and describe in technical detail how the impossible was accomplished.  The audience is anyone who works on C programs for a living, whether willingly or not.", "Title": "NovaProva, a new generation unit test framework for C programs", "URL": "http://linux.conf.au/schedule/30171/view_talk", "Event": 96, "Start": "2013-02-01 11:35:00", "Presenter_emails": "gnb@fastmail.fm", "Presenters": "Gregory Banks", "Duration": "0:45:00", "Id": 161, "Room Name": "MCC3"}, {"Description": "This talk provides an overview of Heat, a peek inside the CloudFormation template language, and a demonstration of heat technologies.  Heat provides an Apache 2 licensed CloudFormation orchestration engine that orchestrates cloud infrastructure resources such as storage, networking, instances, and applications into a repeatable running environment for OpenStack IAAS platforms.  Heat also provides several advanced features such as authentication, nested stacks, high availability, and auto-scaling which are demonstrated.\r\n", "Title": "Heat: Orchestrating multiple cloud applications on OpenStack using templates", "URL": "http://linux.conf.au/schedule/30131/view_talk", "Event": 92, "Start": "2013-02-01 11:35:00", "Presenter_emails": "asalkeld@redhat.com,sbaker@redhat.com", "Presenters": "Angus Salkeld,Steve Baker", "Duration": "0:45:00", "Id": 162, "Room Name": "MCC4"}, {"Description": "How Mozilla draws the line between configuration and data while using configuration management tools - with Brian Hourigan and Justin Dow from Mozilla Corporation.\r\n\r\nAs each quarter passes Mozilla depends on configuration management more and more. It's a formal goal to have all of our systems under configuration management. Ideally, no system should ever have data that a configuration management engine doesn't know about.\r\n\r\nHow do you draw the line between configuration data and content? If you're maintaining a web server and have a few hundred kb of data in the DocumentRoot it may make sense to store everything in a VCS. If you're maintaining a mrepo/cobbler system, people will notice (and probably complain) if you add 6GB of binary data to a VCS.\r\n\r\nWe all know backups are important. \"Backup all the things\" is a great motto to live by, but often it is the time you spend installing and configuring a server that is lost during a disaster. Not just the data. Configuration management can go a long way in that regard, but it might not be appropriate for everything. If you are maintaining your own RPMs, you don't want to check all your RPMs into your VCS and lug those around with you. There is a concept of \"data\" and there is a concept of \"configuration\". Both of these are very important to all aspects of systems administration, and a VCS might be appropriate for configuration and plain text data, but not necessarily for binary data. Backups might be appropriate for data, but not necessarily for configuration. Where do you draw the line? How do these strategies work together? What if you have nightly backups of your data, but not of your configuration? How much time do you want to spent restoring a backup, just to get your software's configuration back? What if your new guy accidentally inserted a space after the leading slash in his \"sudo rm -rf\" command and wiped out half of your server? Where do you start to get that server back up and running exactly how it was, with both the data and the configuration intact?\r\n\r\nWe will go into depth on the following points using free and open source software:\r\n\r\n- How do you distinguish configuration data from content?\r\n- Where should you keep it?\r\n- How do you implement version control on data that isn't meant for a version control system?\r\n- How do you customize this data for just a few systems?", "Title": "How Mozilla draws the line between configuration and data while using configuration management tools", "URL": "http://linux.conf.au/schedule/30159/view_talk", "Event": 118, "Start": "2013-02-01 11:35:00", "Presenter_emails": "bhourigan@mozilla.com,jdow@mozilla.com", "Presenters": "Brian Hourigan,Justin Dow", "Duration": "0:45:00", "Id": 163, "Room Name": "MCC5"}, {"Description": "A few years ago, respected kernel hacker Dave Jones gave a highly amusing talk, \"Why userspace sucks\"[1], which looked at the extraordinary ways in which userspace programmers wreck the performance of Linux systems--systems based on the kernel whose performance kernel hackers go to such lengths to improve.\r\n\r\nThere's no denying Dave's analysis. But, sucking can go in both directions, and there are some myths about the perfection of kernel development to be deconstructed.\r\n\r\nI'll take the specific example of programming interfaces--a place where kernel hackers inflict special pain on userspace, in the form of designs that are inconsistent, insufficiently general, unmaintainable, nonstandard, overcomplicated, nonextensible, poorly integrated with existing APIs, and simply out-and-out wrong. That leads to a parallel question: is code the only--or even the best--way to contribute to a project? That question in turn leads to some ideas about how we might improve the process of API design.\r\n\r\n[1] http://lwn.net/Articles/192214/", "Title": "Why kernel space sucks", "URL": "http://linux.conf.au/schedule/30013/view_talk", "Event": 37, "Start": "2013-02-01 13:20:00", "Presenter_emails": "michael.kerrisk@gmail.com", "Presenters": "Michael Kerrisk", "Duration": "0:45:00", "Id": 165, "Room Name": "MCC1"}, {"Description": "Efficiency in image processing has always been of high importance, this is increasingly true when performed on embedded and mobile devices. A majority of mobile devices are using Advanced RISC Machines (ARM) processors but surprisingly single instruction multiple data (SIMD) optimisations for this architecture is not yet common. This is especially true when we consider open source frameworks and libraries running on these newer mobile ARM devices. \r\n\r\nINTEL have recently used their Streaming SIMD Extensions 2 (SSE2) framework to improve efficiency of heavyweight functions within the Open Compute Vision (OpenCV) library. Unfortunately, the energy efficiency of INTEL processors means it is not the dominant architecture for mobile devices. Image processing on these devices is now common due to the increasing camera capabilities (where most modern smartphones contain an 8 Megapixel camera). We also see a majority of Android and iOS apps leveraging the OpenCV library to perform image processing. The OpenCV library has numerous computationally intensive operations where the use of SIMD is beneficial, INTEL has identified and remedied these bottlenecks using SSE2, however most mobile devices (which run ARM) will not benefit from it. This is of fundamental importance for a mobile architecture in which efficiency and battery life are the major concern. \r\n\r\nAn alternative to INTEL's SIMD instruction sets (SSE and AVX) are ARM's NEON intrinsic instruction set (released in 2009) and the Ne10 software framework (2012). NEON contains similar, but not identical, vector instructions to SSE and AVX. The Ne10 library provides a set of commonly used vector operations, with each vector operation function consisting of clusters of pre-rolled NEON intrinsics. Ne10 provides a higher level of abstraction, enabling C/C++ floating point arrays to be manipulated at a higher level, allowing for faster development time. But at what cost?\r\n\r\nEnd-users are increasingly using their phones as media processing machines, but what can the app developer do to save the battery life of these devices? Using SIMD to improve computing efficiency which in turn reduced clock cycles is an attractive option!\r\n\r\nDuring this session we will compare between SSE, NEON and Ne10 when considering SIMD optimisations to critical functions of the OpenCV library, we will also discuss speedup factors and ease of use (from a programmers perspective). We will also \"briefly\" examine auto-vectorisation and how different compilers stack-up. Finally we \"might\" have a demonstration of some simple image processing using our NEON-ised OpenCV framework for iOS and Android devices.", "Title": "Lighting up OpenCV with Ne10 and NEON", "URL": "http://linux.conf.au/schedule/30228/view_talk", "Event": 125, "Start": "2013-02-01 13:20:00", "Presenter_emails": "beau@inbeta.org", "Presenters": "Beau Johnston", "Duration": "0:45:00", "Id": 166, "Room Name": "MCC2"}, {"Description": "(Or, 'Why Everything You've Read in LWN and Phoronix Comments is Untrue'.)\r\n\r\nWayland is possibly the most impressive free software project to date in terms of the amount of controversy generated to the number of people who've actually ever used it.\r\n\r\nThe X Window System has served UNIX and its derivatives admirably for longer than the presenter has been alive.  Born in the age of monochrome displays, X's extensibility has allowed it to be dragged kicking and screaming into the twenty-first century.  But this extensibility has come at a cost: the average X server now has at least two wholly unused rendering models, four input stacks, four display management extensions, et al.  Not only that, but the internal design and implementation of the X server (which could generously be described as 'awful') is a serious hinderance to achieving anything.\r\n\r\nOne thing as constant as X's dominance is new rival window systems which aim to replace it.  DirectFB, Berlin/Fresco, QWS, the Y Window System and more, have all aimed at one time or another to unseat X, and failed.  But over the past few years, since the revival of X under the X.Org banner, a great deal of its development has been directed at making it easier for others to replace X.  The ongoing development of DRM/KMS, Mesa/EGL, libpciaccess, libxkbcommon and others, has actually made it practical to build a competing window system for the first time.\r\n\r\nSo where do we stand now? What are the actual benefits and downsides of each? (If you said that X's network transparency is a benefit, please come see this to hear about how that's totally wrong.) Does X's extension model really mean it'll live to see 50? Will Wayland replace X next week?\r\n\r\nThis talk will try to explain the design of both X and Wayland, how they actually operate in practice (which is often totally unrelated to the design), and how they actually differ.  If time allows, there might well be bonus information, speculation and pontification on the future development of each.  This will hopefully be rounded off with the obligatory demo of the true mark of a useful and complete window system: semi-transparent rotated windows.", "Title": "The real story behind Wayland and X", "URL": "http://linux.conf.au/schedule/30256/view_talk", "Event": 74, "Start": "2013-02-01 13:20:00", "Presenter_emails": "daniel@fooishbar.org", "Presenters": "Daniel Stone", "Duration": "0:45:00", "Id": 167, "Room Name": "MCC3"}, {"Description": "The OpenStack project uses project gating to ensure that the latest\r\ncode in the repository always works.  Gating is a process where every\r\nchange, after passing code review, is automatically tested and merged\r\nonly if it passes the test suite.  Especially for large projects with\r\ncomplex test suites, this process can keep code quality high while\r\nmaking it easier to accept patches from new contributors.\r\n\r\nThe OpenStack CI team developed Zuul to manage its project gating\r\nsystem.  Zuul is a flexible, general purpose system to integrate\r\nGerrit code review and Jenkins and can be used for project automation\r\npurposes beyond trunk gating.  Driven by a simple, readable YAML file,\r\nZuul has a set of basic concepts that can be combined to make very\r\npowerful automation pipelines.  Zuul can perform speculative execution\r\nof tests on multiple dependent changes in parallel to keep merges\r\nhappening quickly for gated projects.\r\n\r\nThis presentation will review how OpenStack uses project gating as\r\nwell as the capabilities of Zuul and how to set up a similar system\r\nfor any project.\r\n", "Title": "How OpenStack Improves Code Quality with Project Gating and Zuul", "URL": "http://linux.conf.au/schedule/30104/view_talk", "Event": 126, "Start": "2013-02-01 13:20:00", "Presenter_emails": "corvus@inaugust.com", "Presenters": "James Blair", "Duration": "0:45:00", "Id": 168, "Room Name": "MCC4"}, {"Description": "In recent years, communities as wide-ranging as Wikihow to Thunderbird have been surveying participants and using this information to improve the experiences of participants. A variety of open source projects are now tracking contributors to identify where people fall away, and to nudge them forward. In this talk, you will learn the state of the art in community measurement, common mistakes made in surveying, and how to actively use data to improve activity within a project.\r\n\r\nThis talk will cover the following issues in detail:\r\n\r\n* How Wikipedia used A/B testing to improve contribution rejection messages\r\n* Based on entrance/exit surveys from OpenHatch's Open Source Comes to Campus program, what do new contributors know?\r\n* The impact of treating gender as a plain-text field, rather than a drop-down, on the answer rate\r\n* How Ubuntu's Developer Advisory Team tracks, contacts, and nudges new contributors\r\n* How motivations for Thunderbird contributors differ substantially from the FLOSSpols survey\r\n* How to misread your survey data (and tips on avoiding that)\r\n\r\nUpon leaving this talk, you will have a solid background in the current state of data collection within open source communities and how to apply those tools to your own project.", "Title": "Quantitative community management", "URL": "http://linux.conf.au/schedule/30306/view_talk", "Event": 81, "Start": "2013-02-01 13:20:00", "Presenter_emails": "lca@asheesh.org", "Presenters": "Asheesh Laroia", "Duration": "0:45:00", "Id": 169, "Room Name": "MCC5"}, {"Description": "Ceph is one of the most exciting new technologies to recently emerge in the Linux storage space. Based on the RADOS object store, the Ceph stack boasts massive scalability and high availability using nothing but commercial, off-the shelf hardware and free and open source software.\r\n\r\nCeph includes a massively distributed filesystem (Ceph FS), a striped, replicated, highly available block device (RADOS block device, RBD), S3 and Swift object storage capability through the RESTful RADOS Gateway, and a simple, well-documented native API with language bindings for C, C++ and Python. The Ceph filesystem and RBD have been part of the mainline kernel since the 2.6.3x releases, and the server-side stack has recently undergone an extensive cleanup and stabilization phase.\r\n\r\nThe Ceph stack is also well integrated into OpenStack, making it a potential \"one-stop shop\" for OpenStack object, image and volume storage.\r\n\r\nIn this hands-on tutorial, Florian and Tim will walk you through the initial setup of a Ceph cluster, explore its capabilities, highlight its most important features and identify current shortcomings, discuss performance considerations, and identify common Ceph failure modes and troubleshooting steps.\r\n\r\nAttendees should have a good understanding of Linux systems administration. Prior experience with distributed storage (like Lustre, GlusterFS, DRBD, Swift) is a plus but not required. Prior knowledge of the Ceph stack is not necessary. Attendees will have the opportunity to follow the tutorial in a virtual Ceph cluster of their own; pre-installed Libvirt/KVM virtual images will be available for that purpose.\r\n\r\nCo-presenter: Tim Serong, SUSE", "Title": "Ceph: object storage, block storage, file system, replication, massive scalability, and then some!", "URL": "http://linux.conf.au/schedule/30091/view_talk", "Event": 53, "Start": "2013-02-01 13:20:00", "Presenter_emails": "florian@hastexo.com,tserong@suse.com", "Presenters": "Florian Haas,Tim Serong", "Duration": "1:40:00", "Id": 170, "Room Name": "MCC6"}, {"Description": "Identity systems on the Web are a bit of a mess. Surely in 2013, we would have something else than usernames and passwords for logging into websites. A solution that doesn't require trusting a central authority with a privacy policy that can change at a whim.\r\n\r\nIt turns out that solving the general identity problem is very hard. Some of these solutions require complicated redirections, an overwhelming amount of jargon and lots of verbose XML. The technology has been around for a long time, but implementing it properly (and safely) is often incredibly difficult. It's a lot to ask of the millions of part-time developers out there that are building sites out of some quick HTML, a MySQL database and some PHP code samples.\r\n\r\nThis talk will explore the challenges of the existing Web identity solutions and introduce the choices that we made during the development of Persona (formerly BrowserID), a new Open Source federated identity solution from Mozilla, designed and built to respect user privacy.\r\n\r\nIt will cover:\r\n\r\n- a quick overview of existing identity systems on the Web\r\n- a discussion of the complexities and privacy-related concerns that existing identity solutions have\r\n- the cryptographic protocol behind Persona (including how crypto is used to provide both authentication and privacy, even from your identity provider)\r\n- the Persona federation approach: fully distributed with fallbacks\r\n- demos and actual code from sites that have implemented Persona\r\n- the basics of the Persona API so that attendees can go out and support this technology on their own sites without much trouble\r\n\r\nIdentity is a very significant piece of Internet infrastructure and so it is critical that the solution that gets widely adopted be free-as-in-freedom, cross-browser, distributed and ruthlessly focused on making it easy for developers and end-users.", "Title": "Building Persona: federated and privacy-sensitive identity for the Web", "URL": "http://linux.conf.au/schedule/30049/view_talk", "Event": 38, "Start": "2013-02-01 14:15:00", "Presenter_emails": "francois@fmarier.org", "Presenters": "Francois Marier", "Duration": "0:45:00", "Id": 171, "Room Name": "MCC1"}, {"Description": "For the last few years, a consortium has been running scans over the entirety of the .nz and .au networks (as defined by the GeoIP database). Focusing on the most popular ports, the results of these scans are a fascinating look into the 'health' -or otherwise- of these countries' networks.\r\n\r\nConcentrating on the banners and headers from making a connection on TCP ports 22, 23, 80, 53, 443, and 445*, it is possible to fingerprint both the OS and associated patch level of some hosts at a particular point in time. When aggregated, what does this information suggest about current patching strategies in Australasia? Do particular operating systems appear to be easier to keep up to date, or are we failing to maintain them? Finally, excluding harried systems administrators of every type, who might have a vested interest in such a project?\r\n\r\n*ssh, telnet, http, dns, https and smb/windows shares, respectively.", "Title": "Crazy quilts: unpicking patch deployment in .au and .nz", "URL": "http://linux.conf.au/schedule/30077/view_talk", "Event": 32, "Start": "2013-02-01 14:15:00", "Presenter_emails": "jm.pirieclarke@gmail.com", "Presenters": "Joh Pirie-Clarke", "Duration": "0:45:00", "Id": 172, "Room Name": "MCC2"}, {"Description": "What do gamepads, joysticks, guitars and even android glow palettes have to do with graphics creation? Quite a lot, it turns out... especially if one is immersed in the culture of Open Source innovators, hardware hackers and other interesting types.\r\n\r\nSpecifically, though, this presentation will give an overview of hacking the Inkscape vector graphics drawing program to accept various input from, and even output to, a somewhat eclectic collection of hardware devices. These range from inexpensive to costly, off-the-shelf to custom, common to unique, sane to silly... And also a surprisingly timed request that came in to help those suffering from some extreme disabilities.\r\n\r\nThe talk will cover design and motivations, along with several criteria that guided the efforts at different times. Much of the focus will be with software at several levels, including API design decisions, driver writing and leveraging considerations and various lessons learned. XInput, GTK+ extended devices and custom interfacing will all be highlighted.\r\n\r\nVarious hardware options will be covered, including support for professional 6DoF engineering input hardware, gamepads and joysticks, Wii controller based options, game guitars and custom Android-based physical IO devices. Of the latter, design of both hardware and software for a glowing android-based artists' palette will explored along with some of the motivations and inspirations involved. And odd as some of these might sound, there are sound reasons that will be revealed for using even the most eclectic seeming of them.\r\n\r\nBy the end of the presentation those attending should be able to gain inspiration on how out-of-the-box thinking might be applied to their own projects, along with insight on software API design & implementation, and hardware hacking motivation. And finally hilarity most likely will ensue with attempts to form a volunteer game-controller guitar band to create a collaborative graphics performance piece.\r\n", "Title": "Graphics from Gamepads, Guitars, and Gadgets Galore", "URL": "http://linux.conf.au/schedule/30317/view_talk", "Event": 114, "Start": "2013-02-01 14:15:00", "Presenter_emails": "jon@joncruz.org", "Presenters": "Jon Cruz", "Duration": "0:45:00", "Id": 173, "Room Name": "MCC3"}, {"Description": "Ladies and gentlemen, start your database engines!\r\n\r\nPostgreSQL 9.2 beta is here, and it's faster and more exciting than ever before. Come down to the track and join us for a high-speed tour of a database which is faster than ever before!\r\n\r\nStarting at pole position, we will whip around the features of version 9.2, speeding through one demo after another, including:\r\n\r\n    cascading replication\r\n    enhanced vertical scalability\r\n    improved performance\r\n    index-only access\r\n    range types\r\n    JSON support\r\n    better live DDL deployments\r\n    new administrative views\r\n\r\nIt's the fastest PostgreSQL yet, and you have a shotgun seat!", "Title": "PostgreSQL 9.2: Full Throttle Database", "URL": "http://linux.conf.au/schedule/30326/view_talk", "Event": 112, "Start": "2013-02-01 14:15:00", "Presenter_emails": "josh@pgexperts.com", "Presenters": "Josh Berkus", "Duration": "0:45:00", "Id": 174, "Room Name": "MCC4"}, {"Description": "A lot of open source projects are started for the same simple reason: a developer wants a specific program and what is out there doesn't fulfill the need. That's how subsurface was created - there was no decent diving log software that would run on Linux and support some of the key features that we were looking for.\r\n\r\nFrom this starting point we got to a very decent diving log program that happened to run not just on Linux but also on Windows and Mac OS, that supported the vast majority of dive computers out there, had a decent UI (with some highlights like anti-aliased rendering and a novel approach to delivering multi-dimensional information in an easy to understand graphical format).\r\n\r\nThe majority of this talk won't be as much about the actual diving log (it's a user space application that has a fairly narrow audience - even though it seems that a lot of the people at LCA tend to be scuba divers). Instead the focus will be on two specific aspects: First, the process of going from a desire to have a specific piece of software available to an implementation of that using the vast array of libraries and tools available in open source - and getting to a top notch app in less than six months with mostly only two developers engaged part time. And second the aesthetically pleasing visualization of what is in effect a vast amount of complex, multidimensional data.", "Title": "Scratching your own itch - subsurface diving log", "URL": "http://linux.conf.au/schedule/30018/view_talk", "Event": 42, "Start": "2013-02-01 14:15:00", "Presenter_emails": "dirk.hohndel@intel.com", "Presenters": "Dirk Hohndel", "Duration": "0:45:00", "Id": 175, "Room Name": "MCC5"}, {"Description": "", "Title": "Conference Closing", "Event": 30, "Start": "2013-02-01 15:40:00", "Duration": "0:45:00", "Id": 189, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Conference Closing", "Event": 30, "Start": "2013-02-01 16:35:00", "Duration": "0:45:00", "Id": 190, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Speaker's dinner", "Event": 119, "Start": "2013-01-29 18:00:00", "Duration": "4:00:00", "Id": 204, "Room Name": "Speaker's Dinner Venue"}, {"Description": "", "Title": "Penguin Dinner", "Event": 120, "Start": "2013-01-31 18:00:00", "Duration": "4:00:00", "Id": 205, "Room Name": "Penguin Dinner Venue -- Scope at Mount Stromlo"}, {"Description": "", "Title": "PDNS Breakfast", "Event": 121, "Start": "2013-01-30 07:30:00", "Duration": "1:30:00", "Id": 206, "Room Name": "PDNS Venue -- Gandall Hall at the Australian National Gallery"}, {"Description": "", "Title": "Linux in Defence - Jamie Birse", "Event": 128, "Start": "2013-01-28 10:40:00", "Duration": "0:20:00", "Id": 207, "Room Name": "MCC3"}, {"Description": "", "Title": "Syzix: heading off the beaten $PATH - Kevin Pulo", "Event": 129, "Start": "2013-01-28 11:00:00", "Duration": "0:10:00", "Id": 208, "Room Name": "MCC3"}, {"Description": "", "Title": "How OSS technology to help UTS:IT to build a virtualized  networking lab - Li Bing Chen and James Lucas", "Event": 130, "Start": "2013-01-28 11:10:00", "Duration": "0:20:00", "Id": 209, "Room Name": "MCC3"}, {"Description": "", "Title": "Samba 4.0 - Andrew Bartlett", "Event": 131, "Start": "2013-01-28 11:30:00", "Duration": "0:25:00", "Id": 210, "Room Name": "MCC3"}, {"Description": "", "Title": "The Finer Art of Being a Senior Sysadmin - Sheeri Cabral", "Event": 132, "Start": "2013-01-28 11:55:00", "Duration": "0:25:00", "Id": 211, "Room Name": "MCC3"}, {"Description": "", "Title": "OzLabs.org: Administering a system for \"smart people\" -  Martin Schwenke and Stephen Rothwell", "Event": 133, "Start": "2013-01-28 13:20:00", "Duration": "0:20:00", "Id": 212, "Room Name": "MCC3"}, {"Description": "", "Title": "Configuration Management with Ansible - Daniel Hall", "Event": 134, "Start": "2013-01-28 13:40:00", "Duration": "0:15:00", "Id": 213, "Room Name": "MCC3"}, {"Description": "", "Title": "Zombie pancakes: rebooting Flapjack - Lindsay Holmwood", "Event": 135, "Start": "2013-01-28 13:55:00", "Duration": "0:15:00", "Id": 214, "Room Name": "MCC3"}, {"Description": "", "Title": "CWDM: Coarse Wave Division Multiplexing - Glen Turner", "Event": 216, "Start": "2013-01-28 14:10:00", "Duration": "0:20:00", "Id": 215, "Room Name": "MCC3"}, {"Description": "", "Title": "Operating in an Ephemeral World - Steven Ellis", "Event": 137, "Start": "2013-01-28 14:40:00", "Duration": "0:20:00", "Id": 216, "Room Name": "MCC3"}, {"Description": "", "Title": "Communicating with third parties - Julien Goodwin", "Event": 136, "Start": "2013-01-28 14:30:00", "Duration": "0:10:00", "Id": 218, "Room Name": "MCC3"}, {"Description": "", "Title": "Another look at scaling monitoring - Devdas Bhagat", "Event": 138, "Start": "2013-01-28 15:40:00", "Duration": "0:20:00", "Id": 219, "Room Name": "MCC3"}, {"Description": "", "Title": "Making SNMP work, despite vendors best efforts - Nick  Clifford", "Event": 139, "Start": "2013-01-28 16:00:00", "Duration": "0:20:00", "Id": 220, "Room Name": "MCC3"}, {"Description": "", "Title": "Securing Linux with SELinux - Sander van Vugt", "Event": 140, "Start": "2013-01-28 16:20:00", "Duration": "0:20:00", "Id": 221, "Room Name": "MCC3"}, {"Description": "", "Title": "blkreplay: Experiences with Commercial vs OpenSource  Storage Systems - Thomas Schöbel-Theuer", "Event": 141, "Start": "2013-01-28 16:40:00", "Duration": "0:20:00", "Id": 222, "Room Name": "MCC3"}, {"Description": "", "Title": "Seven Ways to Crash Your PostgreSQL Server - Josh Berkus", "Event": 142, "Start": "2013-01-28 17:00:00", "Duration": "0:20:00", "Id": 223, "Room Name": "MCC3"}, {"Description": "", "Title": "Linux Australia AGM", "Event": 143, "Start": "2013-01-30 17:30:00", "Duration": "1:00:00", "Id": 224, "Room Name": "MCC2"}, {"Description": "", "Title": "OpenStack Practical", "Event": 257, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 225, "Room Name": "MCC1"}, {"Description": "", "Title": "Keysigning Party", "Event": 259, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 226, "Room Name": "MCC2"}, {"Description": "", "Title": "Open Source Industry Australia (OSIA) BoF", "Event": 262, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 227, "Room Name": "MCC3"}, {"Description": "", "Title": "Android MAC BoF", "Event": 265, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 228, "Room Name": "MCC4"}, {"Description": "", "Title": "BOF TBA", "Event": 144, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 229, "Room Name": "MCC5"}, {"Description": "", "Title": "OpenStack Documentation Jam Session", "Event": 269, "Start": "2013-01-30 18:30:00", "Duration": "1:00:00", "Id": 230, "Room Name": "MCC6"}, {"Description": "", "Title": "OpenStack Practical", "Event": 257, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 231, "Room Name": "MCC1"}, {"Description": "", "Title": "C BoF", "Event": 260, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 232, "Room Name": "MCC2"}, {"Description": "", "Title": "Programming/Open Source/Linux for Research Institutes and Universities", "Event": 263, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 233, "Room Name": "MCC3"}, {"Description": "", "Title": "Free software activism meetup", "Event": 266, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 234, "Room Name": "MCC4"}, {"Description": "", "Title": "Smart crafting BOF - ping @KathyReid", "Event": 268, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 235, "Room Name": "MCC5"}, {"Description": "", "Title": "OpenStack Documentation Jam Session", "Event": 269, "Start": "2013-01-30 19:30:00", "Duration": "1:00:00", "Id": 236, "Room Name": "MCC6"}, {"Description": "", "Title": "Jobs BoF", "Event": 258, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 237, "Room Name": "MCC1"}, {"Description": "", "Title": "Geeks & Depression BlueHackers BoF", "Event": 261, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 238, "Room Name": "MCC2"}, {"Description": "", "Title": "Alternative startups and open source business models BoF", "Event": 264, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 239, "Room Name": "MCC3"}, {"Description": "", "Title": "Emacs BoF", "Event": 267, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 240, "Room Name": "MCC4"}, {"Description": "", "Title": "Smart crafting BOF - ping @KathyReid", "Event": 268, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 241, "Room Name": "MCC5"}, {"Description": "", "Title": "OpenStack Documentation Jam Session", "Event": 269, "Start": "2013-01-30 20:30:00", "Duration": "1:00:00", "Id": 242, "Room Name": "MCC6"}, {"Description": "", "Title": "Introduction and State of MobileFOSS", "Event": 152, "Start": "2013-01-28 10:40:00", "Duration": "0:25:00", "Id": 251, "Room Name": "MCC6"}, {"Description": "", "Title": "Creating The Friendly Borgtel", "Event": 153, "Start": "2013-01-28 11:05:00", "Duration": "0:25:00", "Id": 252, "Room Name": "MCC6"}, {"Description": "", "Title": "Project Grimlock", "Event": 154, "Start": "2013-01-28 11:30:00", "Duration": "0:25:00", "Id": 253, "Room Name": "MCC6"}, {"Description": "", "Title": "Serval Maps", "Event": 155, "Start": "2013-01-28 11:55:00", "Duration": "0:25:00", "Id": 254, "Room Name": "MCC6"}, {"Description": "", "Title": "Why Arduino-enabled Mobile Phones Are Important ", "Event": 156, "Start": "2013-01-28 13:20:00", "Duration": "0:35:00", "Id": 255, "Room Name": "MCC6"}, {"Description": "", "Title": "Open Phoenux - The Open Phone", "Event": 233, "Start": "2013-01-28 13:55:00", "Duration": "0:50:00", "Id": 256, "Room Name": "MCC6"}, {"Description": "", "Title": "Lightning Talks", "Event": 149, "Start": "2013-01-28 14:45:00", "Duration": "0:15:00", "Id": 258, "Room Name": "MCC6"}, {"Description": "", "Title": "Field Trialling the Serval Project with New Zealand Red Cross", "Event": 158, "Start": "2013-01-28 15:40:00", "Duration": "0:25:00", "Id": 259, "Room Name": "MCC6"}, {"Description": "", "Title": "Audio / Video encoding and the clapperWebCamRecorder - Eric McCreath", "Event": 145, "Start": "2013-01-28 10:40:00", "Duration": "0:50:00", "Id": 263, "Room Name": "MCC5"}, {"Description": "", "Title": "Open art and content creation tools - Andrew Pam", "Event": 146, "Start": "2013-01-28 11:30:00", "Duration": "0:25:00", "Id": 264, "Room Name": "MCC5"}, {"Description": "", "Title": "Fun with GStreamer Pipelines! - Tim Ansell", "Event": 224, "Start": "2013-01-28 11:55:00", "Duration": "0:25:00", "Id": 265, "Room Name": "MCC5"}, {"Description": "", "Title": "Getting started with a Podcast - Sheeri Cabral", "Event": 151, "Start": "2013-01-28 14:10:00", "Duration": "0:50:00", "Id": 267, "Room Name": "MCC5"}, {"Description": "", "Title": "Remixing with FOSS - Pia Waugh", "Event": 148, "Start": "2013-01-28 15:40:00", "Duration": "0:30:00", "Id": 268, "Room Name": "MCC5"}, {"Description": "", "Title": "Lightning Talks", "Event": 149, "Start": "2013-01-28 16:10:00", "Duration": "0:30:00", "Id": 269, "Room Name": "MCC5"}, {"Description": "", "Title": "Slide guitar construction workshop - Jonathan Mettes", "Event": 150, "Start": "2013-01-28 16:40:00", "Duration": "0:40:00", "Id": 270, "Room Name": "MCC5"}, {"Description": "", "Title": "Solving Interesting Problems by Writing Parsers - Jacinta Richardson", "Event": 160, "Start": "2013-01-29 10:40:00", "Duration": "0:25:00", "Id": 271, "Room Name": "MCC3"}, {"Description": "", "Title": "Making code more functional: Lambda land in layperson's language - Katie Miller & Steve Dalton", "Event": 161, "Start": "2013-01-29 11:05:00", "Duration": "0:35:00", "Id": 272, "Room Name": "MCC3"}, {"Description": "", "Title": "Validating Core Parallel Software? - Paul E McKenney", "Event": 162, "Start": "2013-01-29 11:40:00", "Duration": "0:25:00", "Id": 273, "Room Name": "MCC3"}, {"Description": "", "Title": "Reducing bugs with Boost/Test - Andrew McDonnell", "Event": 163, "Start": "2013-01-29 12:05:00", "Duration": "0:15:00", "Id": 275, "Room Name": "MCC3"}, {"Description": "", "Title": "PHP in 2013: generators, and password hashing, and finally (oh my!) - Adam Harvey", "Event": 164, "Start": "2013-01-29 13:20:00", "Duration": "0:25:00", "Id": 278, "Room Name": "MCC3"}, {"Description": "", "Title": "AngularJS and the new web development ecosystem - Daniel Nadasi", "Event": 165, "Start": "2013-01-29 13:45:00", "Duration": "0:35:00", "Id": 279, "Room Name": "MCC3"}, {"Description": "", "Title": "Embedding everything in everything for fun and profit - Mark Aufflick", "Event": 167, "Start": "2013-01-29 14:20:00", "Duration": "0:25:00", "Id": 280, "Room Name": "MCC3"}, {"Description": "", "Title": "Designing an efficient runtime library for AVR microcontrollers - Alastair D'Silva", "Event": 166, "Start": "2013-01-29 14:45:00", "Duration": "0:15:00", "Id": 281, "Room Name": "MCC3"}, {"Description": "", "Title": "What we can learn from Erlang - Tim McNamara", "Event": 192, "Start": "2013-01-29 15:40:00", "Duration": "0:25:00", "Id": 282, "Room Name": "MCC3"}, {"Description": "", "Title": "Concurrent Programming is not so difficult - Daniel Bryan", "Event": 193, "Start": "2013-01-29 16:05:00", "Duration": "0:35:00", "Id": 283, "Room Name": "MCC3"}, {"Description": "", "Title": "Lightning Talks", "Event": 149, "Start": "2013-01-29 16:40:00", "Duration": "0:40:00", "Id": 284, "Room Name": "MCC3"}, {"Description": "", "Title": "Keynote - Bdale Garbee", "Event": 168, "Start": "2013-01-28 09:00:00", "Duration": "1:00:00", "Id": 285, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Keynote - Radia Perlman", "Event": 169, "Start": "2013-01-29 09:00:00", "Duration": "1:00:00", "Id": 286, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Keynote - \"bunnie\" Huang", "Event": 171, "Start": "2013-01-31 09:00:00", "Duration": "1:00:00", "Id": 287, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Keynote - Sir Tim Berners-Lee", "Event": 170, "Start": "2013-02-01 09:00:00", "Duration": "1:00:00", "Id": 288, "Room Name": "Llewellyn Hall"}, {"Description": "", "Title": "Welcome - Tristan Goode", "Event": 173, "Start": "2013-01-29 10:40:00", "Duration": "0:10:00", "Id": 289, "Room Name": "MCC2"}, {"Description": "", "Title": "Introduction to OpenStack - Joshua McKenty", "Event": 174, "Start": "2013-01-29 10:50:00", "Duration": "0:40:00", "Id": 290, "Room Name": "MCC2"}, {"Description": "", "Title": "Intro to Swift for New Contributors - John Dickinson", "Event": 178, "Start": "2013-01-29 11:30:00", "Duration": "0:25:00", "Id": 291, "Room Name": "MCC2"}, {"Description": "", "Title": "NeCTAR Research Cloud: OpenStack in Production - Tom Fifeld", "Event": 176, "Start": "2013-01-29 11:55:00", "Duration": "0:25:00", "Id": 292, "Room Name": "MCC2"}, {"Description": "", "Title": "All-around OpenStack storage with Ceph - Florian Haas", "Event": 179, "Start": "2013-01-29 13:20:00", "Duration": "0:25:00", "Id": 293, "Room Name": "MCC2"}, {"Description": "", "Title": "Bare metal provisioning with OpenStack - Devananda van der Veen", "Event": 177, "Start": "2013-01-29 13:45:00", "Duration": "0:25:00", "Id": 294, "Room Name": "MCC2"}, {"Description": "", "Title": "Writing API extensions for Nova - Christopher Yeoh", "Event": 180, "Start": "2013-01-29 14:10:00", "Duration": "0:25:00", "Id": 295, "Room Name": "MCC2"}, {"Description": "", "Title": "The OpenStack Metering Project - Angus Salkeld", "Event": 181, "Start": "2013-01-29 14:35:00", "Duration": "0:25:00", "Id": 296, "Room Name": "MCC2"}, {"Description": "", "Title": "Lightweight PaaS on the NCI OpenStack Cloud - Kevin Pulo", "Event": 182, "Start": "2013-01-29 15:40:00", "Duration": "0:25:00", "Id": 297, "Room Name": "MCC2"}, {"Description": "", "Title": "Enabling Compute Clusters atop OpenStack - Enis Afgan", "Event": 183, "Start": "2013-01-29 16:05:00", "Duration": "0:25:00", "Id": 298, "Room Name": "MCC2"}, {"Description": "", "Title": "Shared Panel with Open Government", "Event": 184, "Start": "2013-01-29 16:30:00", "Duration": "0:50:00", "Id": 300, "Room Name": "MCC2"}, {"Description": "", "Title": "Welcome", "Event": 185, "Start": "2013-01-28 10:40:00", "Duration": "0:20:00", "Id": 301, "Room Name": "MCC2"}, {"Description": "", "Title": "Tracking Vulnerable JARs - Arun Babu Neelicattu", "Event": 186, "Start": "2013-01-28 11:00:00", "Duration": "0:40:00", "Id": 302, "Room Name": "MCC2"}, {"Description": "", "Title": "SELinux Status Report - Russel Coker", "Event": 187, "Start": "2013-01-28 11:40:00", "Duration": "0:40:00", "Id": 303, "Room Name": "MCC2"}, {"Description": "", "Title": "Trusted Computing and Hadoop HDFS - Jason Cohen", "Event": 188, "Start": "2013-01-28 13:20:00", "Duration": "0:50:00", "Id": 304, "Room Name": "MCC2"}, {"Description": "", "Title": "Security Models Running Amok - Casey Schaufler", "Event": 190, "Start": "2013-01-28 14:10:00", "Duration": "0:50:00", "Id": 305, "Room Name": "MCC2"}, {"Description": "", "Title": "MySQL Security - Sheeri Cabral", "Event": 189, "Start": "2013-01-28 15:40:00", "Duration": "0:50:00", "Id": 306, "Room Name": "MCC2"}, {"Description": "", "Title": "Panel: Where in the stack does security belong?", "Event": 191, "Start": "2013-01-28 16:30:00", "Duration": "0:50:00", "Id": 307, "Room Name": "MCC2"}, {"Description": "", "Title": "Delivering IaaS with Apache CloudStack - Joe Brockmeier", "Event": 194, "Start": "2013-01-28 10:40:00", "Duration": "0:50:00", "Id": 308, "Room Name": "MCC1"}, {"Description": "", "Title": "oVirt - Dan Macpherson", "Event": 195, "Start": "2013-01-28 11:30:00", "Duration": "0:25:00", "Id": 309, "Room Name": "MCC1"}, {"Description": "", "Title": "Aeolus - Dan Macpherson", "Event": 196, "Start": "2013-01-28 11:55:00", "Duration": "0:10:00", "Id": 310, "Room Name": "MCC1"}, {"Description": "", "Title": "Asynchronous Block Storage Replication with MARS Light - Thomas Schobel-Theuer", "Event": 252, "Start": "2013-01-28 12:05:00", "Duration": "0:15:00", "Id": 311, "Room Name": "MCC1"}, {"Description": "", "Title": "Ops: From bare metal to cloud space - Phil Ingram", "Event": 197, "Start": "2013-01-28 13:20:00", "Duration": "0:25:00", "Id": 312, "Room Name": "MCC1"}, {"Description": "", "Title": "VMs on VLANs on Bridges on Bonds on many NICs - Kim Hawtin", "Event": 198, "Start": "2013-01-28 13:45:00", "Duration": "0:25:00", "Id": 313, "Room Name": "MCC1"}, {"Description": "", "Title": "OpenStack Swift Overview - John Dickinson", "Event": 199, "Start": "2013-01-28 14:10:00", "Duration": "0:25:00", "Id": 314, "Room Name": "MCC1"}, {"Description": "", "Title": "JORN and the rise and fall of clustering - Jamie Birse", "Event": 200, "Start": "2013-01-28 14:35:00", "Duration": "0:25:00", "Id": 315, "Room Name": "MCC1"}, {"Description": "", "Title": "MongoDB Replication & Replica Sets - Stephen Steneker", "Event": 201, "Start": "2013-01-28 15:40:00", "Duration": "0:25:00", "Id": 316, "Room Name": "MCC1"}, {"Description": "", "Title": "MariaDB Galera Cluster - Daniel Black", "Event": 202, "Start": "2013-01-28 16:05:00", "Duration": "0:25:00", "Id": 317, "Room Name": "MCC1"}, {"Description": "", "Title": "The Grand Distributed Storage Debate: GlusterFS and Ceph going head to head - Florian Haas, Sage Weil, John Mark Walker", "Event": 203, "Start": "2013-01-28 16:30:00", "Duration": "0:50:00", "Id": 318, "Room Name": "MCC1"}, {"Description": "", "Title": "Feminism, anarchism and FOSS - Skye Croeser", "Event": 206, "Start": "2013-01-29 10:40:00", "Duration": "0:25:00", "Id": 319, "Room Name": "MCC6"}, {"Description": "", "Title": "Overcoming imposter syndrome - Denise Paolucci", "Event": 207, "Start": "2013-01-29 11:05:00", "Duration": "0:35:00", "Id": 320, "Room Name": "MCC6"}, {"Description": "", "Title": "Have you been a lone unicorn - Robyn Willison", "Event": 255, "Start": "2013-01-29 11:40:00", "Duration": "0:25:00", "Id": 322, "Room Name": "MCC6"}, {"Description": "", "Title": "CyberWar: Mo' Metaphor, Mo' Money, Mo' Problems? - Joh Pirie-Clark", "Event": 208, "Start": "2013-01-29 12:05:00", "Duration": "0:15:00", "Id": 323, "Room Name": "MCC6"}, {"Description": "", "Title": "Less flack, moar hack! - Kathy Reid", "Event": 209, "Start": "2013-01-29 13:20:00", "Duration": "0:25:00", "Id": 324, "Room Name": "MCC6"}, {"Description": "", "Title": "Open Source Cities - Fee Plumley", "Event": 210, "Start": "2013-01-29 13:45:00", "Duration": "0:35:00", "Id": 325, "Room Name": "MCC6"}, {"Description": "", "Title": "Recipe for making geek jewellery - Ruth Ellison", "Event": 211, "Start": "2013-01-29 14:20:00", "Duration": "0:25:00", "Id": 327, "Room Name": "MCC6"}, {"Description": "", "Title": "Educating girls about FOSS with FOSS - Katie Miller", "Event": 212, "Start": "2013-01-29 14:45:00", "Duration": "0:15:00", "Id": 328, "Room Name": "MCC6"}, {"Description": "", "Title": "Getting your talk accepted: write a convincing talk proposal - Jacinta Richardson", "Event": 213, "Start": "2013-01-29 15:40:00", "Duration": "0:25:00", "Id": 329, "Room Name": "MCC6"}, {"Description": "", "Title": "py.test, Selenium, jQuery and the Pacific Ocean - Brianna Laugher", "Event": 256, "Start": "2013-01-29 16:05:00", "Duration": "0:25:00", "Id": 330, "Room Name": "MCC6"}, {"Description": "", "Title": "Robogals - Sam Cheah", "Event": 214, "Start": "2013-01-29 16:30:00", "Duration": "0:50:00", "Id": 331, "Room Name": "MCC6"}, {"Description": "", "Title": "Browsers and HTML5 video accessibility - Silvia Pfeiffer", "Event": 225, "Start": "2013-01-28 13:20:00", "Duration": "0:25:00", "Id": 336, "Room Name": "MCC5"}, {"Description": "", "Title": "Implementing Threaded Accelerated Compositing in WebKit GTK+ - Gwang Yoon Hwang", "Event": 217, "Start": "2013-01-29 10:40:00", "Duration": "0:25:00", "Id": 337, "Room Name": "MCC4"}, {"Description": "", "Title": "Defeating Cross-Site Scripting attacks with Content Security Policy - Francois Marier", "Event": 218, "Start": "2013-01-29 11:05:00", "Duration": "0:25:00", "Id": 338, "Room Name": "MCC4"}, {"Description": "", "Title": "The WebKit Browser Engine - An Overview - Dirk Schulze", "Event": 219, "Start": "2013-01-29 11:30:00", "Duration": "0:50:00", "Id": 339, "Room Name": "MCC4"}, {"Description": "", "Title": "Panel session", "Event": 253, "Start": "2013-01-29 13:20:00", "Duration": "0:50:00", "Id": 340, "Room Name": "MCC4"}, {"Description": "", "Title": "Web IDL: Defining Web APIs and Implementing Javascript Bindings - Cameron McCormack", "Event": 220, "Start": "2013-01-29 14:10:00", "Duration": "0:25:00", "Id": 341, "Room Name": "MCC4"}, {"Description": "", "Title": "Web Animations: unifying CSS Transitions, CSS Animations, and SVG - Shane Stephens", "Event": 221, "Start": "2013-01-29 14:35:00", "Duration": "0:25:00", "Id": 342, "Room Name": "MCC4"}, {"Description": "", "Title": "The Horrible History of Web Development - Daniel Nadasi", "Event": 222, "Start": "2013-01-29 15:40:00", "Duration": "0:50:00", "Id": 343, "Room Name": "MCC4"}, {"Description": "", "Title": "The Future of HTML5 Apps - Jeremy Apthorp", "Event": 223, "Start": "2013-01-29 16:30:00", "Duration": "0:50:00", "Id": 344, "Room Name": "MCC4"}, {"Description": "", "Title": "Sound effects triggering with Tttrigger - Jonathan Woithe", "Event": 226, "Start": "2013-01-28 13:45:00", "Duration": "0:25:00", "Id": 345, "Room Name": "MCC5"}, {"Description": "", "Title": "OpenStack CI - Monty Taylor", "Event": 227, "Start": "2013-01-28 10:40:00", "Duration": "0:40:00", "Id": 346, "Room Name": "MCC4"}, {"Description": "", "Title": "project-builder.org - Bruno Cornec", "Event": 228, "Start": "2013-01-28 11:20:00", "Duration": "1:00:00", "Id": 347, "Room Name": "MCC4"}, {"Description": "", "Title": "Zuul - James Blair", "Event": 229, "Start": "2013-01-28 13:20:00", "Duration": "0:50:00", "Id": 348, "Room Name": "MCC4"}, {"Description": "", "Title": "Two years with Samba's autobuild - Andrew Bartlett", "Event": 230, "Start": "2013-01-28 14:10:00", "Duration": "0:50:00", "Id": 349, "Room Name": "MCC4"}, {"Description": "", "Title": "The agony and ecstasy of CI: a war story - Stewart Smith", "Event": 231, "Start": "2013-01-28 15:40:00", "Duration": "0:50:00", "Id": 350, "Room Name": "MCC4"}, {"Description": "", "Title": "Building an Appliance on Android", "Event": 234, "Start": "2013-01-28 16:05:00", "Duration": "0:25:00", "Id": 352, "Room Name": "MCC6"}, {"Description": "", "Title": "Serval Project Technology Stack", "Event": 235, "Start": "2013-01-28 16:30:00", "Duration": "0:25:00", "Id": 353, "Room Name": "MCC6"}, {"Description": "", "Title": "Introduction to FirefoxOS", "Event": 236, "Start": "2013-01-28 16:55:00", "Duration": "0:25:00", "Id": 354, "Room Name": "MCC6"}, {"Description": "", "Title": "testr - Robert Collins", "Event": 232, "Start": "2013-01-28 16:30:00", "Duration": "0:50:00", "Id": 355, "Room Name": "MCC4"}, {"Description": "", "Title": "The Syzix Project - Kevin Pulo", "Event": 238, "Start": "2013-01-29 10:40:00", "Duration": "0:40:00", "Id": 356, "Room Name": "MCC5"}, {"Description": "", "Title": "Open Build System - Tim Serong", "Event": 239, "Start": "2013-01-29 11:20:00", "Duration": "1:00:00", "Id": 357, "Room Name": "MCC5"}, {"Description": "", "Title": "OpenStack and Linux Distros - Monty Taylor", "Event": 240, "Start": "2013-01-29 13:20:00", "Duration": "0:55:00", "Id": 358, "Room Name": "MCC5"}, {"Description": "", "Title": "Crowdsourcing upstream refactoring - Tom Marble and Bdale Garbee", "Event": 241, "Start": "2013-01-29 14:15:00", "Duration": "0:45:00", "Id": 359, "Room Name": "MCC5"}, {"Description": "", "Title": "Reviewing FLOSS: experience and feedback from 10 years - Bruno Cornec and Paul Whyman", "Event": 242, "Start": "2013-01-29 15:40:00", "Duration": "0:45:00", "Id": 360, "Room Name": "MCC5"}, {"Description": "", "Title": "(c) assignment and governance hints - Michael Meeks", "Event": 243, "Start": "2013-01-29 16:25:00", "Duration": "0:20:00", "Id": 361, "Room Name": "MCC5"}, {"Description": "", "Title": "LibreOffice, distributions and packaging - Michael Meeks", "Event": 244, "Start": "2013-01-29 16:45:00", "Duration": "0:35:00", "Id": 362, "Room Name": "MCC5"}, {"Description": "", "Title": "\"State of the Federation\" opening address", "Event": 245, "Start": "2013-01-29 10:40:00", "Duration": "0:20:00", "Id": 363, "Room Name": "MCC1"}, {"Description": "", "Title": "Open discussion about what we want to achieve by this time next year", "Event": 246, "Start": "2013-01-29 11:00:00", "Duration": "0:20:00", "Id": 364, "Room Name": "MCC1"}, {"Description": "", "Title": "Service delivery panel", "Event": 247, "Start": "2013-01-29 11:20:00", "Duration": "1:00:00", "Id": 365, "Room Name": "MCC1"}, {"Description": "", "Title": "Open data panel", "Event": 248, "Start": "2013-01-29 13:20:00", "Duration": "0:50:00", "Id": 366, "Room Name": "MCC1"}, {"Description": "", "Title": "Participatory democracy & civic hacking panel", "Event": 249, "Start": "2013-01-29 14:10:00", "Duration": "0:50:00", "Id": 367, "Room Name": "MCC1"}, {"Description": "", "Title": "Lightning Talks", "Event": 250, "Start": "2013-01-29 15:40:00", "Duration": "0:50:00", "Id": 368, "Room Name": "MCC1"}, {"Description": "", "Title": "Shared Panel with OpenStack", "Event": 251, "Start": "2013-01-29 16:30:00", "Duration": "0:50:00", "Id": 369, "Room Name": "MCC1"}]